AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4l_generic.h
    struct {
      __IOM uint32_t SLEN2      : 1;            /*!< This bit enables slot 2 for ADC conversions.                              */
      __IOM uint32_t WCEN2      : 1;            /*!< This bit enables the window compare function for slot 2.                  */
            uint32_t            : 6;
      __IOM uint32_t CHSEL2     : 4;            /*!< Select one of the 11 channel inputs for this slot.                        */
            uint32_t            : 4;
      __IOM uint32_t PRMODE2    : 2;            /*!< Set the Precision Mode For Slot 2.                                        */
      __IOM uint32_t TRKCYC2    : 6;            /*!< Set additional input signal sampling/tracking time to the specified
                                                     number of ADC clock cycles. (Note that a value of 0 in
                                                     this register specifies the minimum required 5 cycles.
                                                     A maximum of 64 specifies 69 cycles.)                                     */
      __IOM uint32_t ADSEL2     : 3;            /*!< Select the number of measurements to average in the accumulate
                                                     divide module for this slot.                                              */
            uint32_t            : 5;
    } SL2CFG_b;
  } ;

  union {
    __IOM uint32_t SL3CFG;                      /*!< Slot 3 Configuration                                                      */

    struct {
      __IOM uint32_t SLEN3      : 1;            /*!< This bit enables slot 3 for ADC conversions.                              */
      __IOM uint32_t WCEN3      : 1;            /*!< This bit enables the window compare function for slot 3.                  */
            uint32_t            : 6;
      __IOM uint32_t CHSEL3     : 4;            /*!< Select one of the 11 channel inputs for this slot.                        */
            uint32_t            : 4;
      __IOM uint32_t PRMODE3    : 2;            /*!< Set the Precision Mode For Slot 3.                                        */
      __IOM uint32_t TRKCYC3    : 6;            /*!< Set additional input signal sampling/tracking time to the specified
                                                     number of ADC clock cycles. (Note that a value of 0 in
                                                     this register specifies the minimum required 5 cycles.
                                                     A maximum of 64 specifies 69 cycles.)                                     */
      __IOM uint32_t ADSEL3     : 3;            /*!< Select the number of measurements to average in the accumulate
                                                     divide module for this slot.                                              */
            uint32_t            : 5;
    } SL3CFG_b;
  } ;

  union {
    __IOM uint32_t SL4CFG;                      /*!< Slot 4 Configuration                                                      */

    struct {
      __IOM uint32_t SLEN4      : 1;            /*!< This bit enables slot 4 for ADC conversions.                              */
      __IOM uint32_t WCEN4      : 1;            /*!< This bit enables the window compare function for slot 4.                  */
            uint32_t            : 6;
      __IOM uint32_t CHSEL4     : 4;            /*!< Select one of the 11 channel inputs for this slot.                        */
            uint32_t            : 4;
      __IOM uint32_t PRMODE4    : 2;            /*!< Set the Precision Mode For Slot 4.                                        */
      __IOM uint32_t TRKCYC4    : 6;            /*!< Set additional input signal sampling/tracking time to the specified
                                                     number of ADC clock cycles. (Note that a value of 0 in
                                                     this register specifies the minimum required 5 cycles.
                                                     A maximum of 64 specifies 69 cycles.)                                     */
      __IOM uint32_t ADSEL4     : 3;            /*!< Select the number of measurements to average in the accumulate
                                                     divide module for this slot.                                              */
            uint32_t            : 5;
    } SL4CFG_b;
  } ;

  union {
    __IOM uint32_t SL5CFG;                      /*!< Slot 5 Configuration                                                      */

    struct {
      __IOM uint32_t SLEN5      : 1;            /*!< This bit enables slot 5 for ADC conversions.                              */
      __IOM uint32_t WCEN5      : 1;            /*!< This bit enables the window compare function for slot 5.                  */
            uint32_t            : 6;
      __IOM uint32_t CHSEL5     : 4;            /*!< Select one of the 11 channel inputs for this slot.                        */
            uint32_t            : 4;
      __IOM uint32_t PRMODE5    : 2;            /*!< Set the Precision Mode For Slot 5.                                        */
      __IOM uint32_t TRKCYC5    : 6;            /*!< Set additional input signal sampling/tracking time to the specified
                                                     number of ADC clock cycles. (Note that a value of 0 in
                                                     this register specifies the minimum required 5 cycles.
                                                     A maximum of 64 specifies 69 cycles.)                                     */
      __IOM uint32_t ADSEL5     : 3;            /*!< Select the number of measurements to average in the accumulate
                                                     divide module for this slot.                                              */
            uint32_t            : 5;
    } SL5CFG_b;
  } ;

  union {
    __IOM uint32_t SL6CFG;                      /*!< Slot 6 Configuration                                                      */

