AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4l_generic.h
    struct {
      __IOM uint32_t SLEN6      : 1;            /*!< This bit enables slot 6 for ADC conversions.                              */
      __IOM uint32_t WCEN6      : 1;            /*!< This bit enables the window compare function for slot 6.                  */
            uint32_t            : 6;
      __IOM uint32_t CHSEL6     : 4;            /*!< Select one of the 11 channel inputs for this slot.                        */
            uint32_t            : 4;
      __IOM uint32_t PRMODE6    : 2;            /*!< Set the Precision Mode For Slot 6.                                        */
      __IOM uint32_t TRKCYC6    : 6;            /*!< Set additional input signal sampling/tracking time to the specified
                                                     number of ADC clock cycles. (Note that a value of 0 in
                                                     this register specifies the minimum required 5 cycles.
                                                     A maximum of 64 specifies 69 cycles.)                                     */
      __IOM uint32_t ADSEL6     : 3;            /*!< Select the number of measurements to average in the accumulate
                                                     divide module for this slot.                                              */
            uint32_t            : 5;
    } SL6CFG_b;
  } ;

  union {
    __IOM uint32_t SL7CFG;                      /*!< Slot 7 Configuration                                                      */

    struct {
      __IOM uint32_t SLEN7      : 1;            /*!< This bit enables slot 7 for ADC conversions.                              */
      __IOM uint32_t WCEN7      : 1;            /*!< This bit enables the window compare function for slot 7.                  */
            uint32_t            : 6;
      __IOM uint32_t CHSEL7     : 4;            /*!< Select one of the 11 channel inputs for this slot.                        */
            uint32_t            : 4;
      __IOM uint32_t PRMODE7    : 2;            /*!< Set the Precision Mode For Slot 7.                                        */
      __IOM uint32_t TRKCYC7    : 6;            /*!< Set additional input signal sampling/tracking time to the specified
                                                     number of ADC clock cycles. (Note that a value of 0 in
                                                     this register specifies the minimum required 5 cycles.
                                                     A maximum of 64 specifies 69 cycles.)                                     */
      __IOM uint32_t ADSEL7     : 3;            /*!< Select the number of measurements to average in the accumulate
                                                     divide module for this slot.                                              */
            uint32_t            : 5;
    } SL7CFG_b;
  } ;

  union {
    __IOM uint32_t WULIM;                       /*!< Window Comparator Upper Limits                                            */

    struct {
      __IOM uint32_t ULIM       : 20;           /*!< Sets the upper limit for the window comparator.                           */
            uint32_t            : 12;
    } WULIM_b;
  } ;

  union {
    __IOM uint32_t WLLIM;                       /*!< Window Comparator Lower Limits                                            */

    struct {
      __IOM uint32_t LLIM       : 20;           /*!< Sets the lower limit for the window comparator.                           */
            uint32_t            : 12;
    } WLLIM_b;
  } ;

  union {
    __IOM uint32_t SCWLIM;                      /*!< Scale Window Comparator Limits                                            */

    struct {
      __IOM uint32_t SCWLIMEN   : 1;            /*!< Scale the window limits compare values per precision mode. When
                                                     set to 0x0 (default), the values in the 20-bit limits registers
                                                     will compare directly with the FIFO values regardless of
                                                     the precision mode the slot is configured to. When set
                                                     to 0x1, the compare values will be divided by the difference
                                                     in precision bits while performing the window limit comparisons.          */
            uint32_t            : 31;
    } SCWLIM_b;
  } ;

  union {
    __IOM uint32_t FIFO;                        /*!< The ADC FIFO Register contains the slot number and fifo data
                                                     for the oldest conversion data in the FIFO. The COUNT field
                                                     indicates the total number of valid entries in the FIFO.
                                                     A write to this register will pop one of the FIFO entries
                                                     off the FIFO and decrease the COUNT by 1 if the COUNT is
                                                     greater than zero.                                                        */

    struct {
      __IOM uint32_t DATA       : 20;           /*!< Oldest data in the FIFO.                                                  */
      __IOM uint32_t COUNT      : 8;            /*!< Number of valid entries in the ADC FIFO.                                  */
      __IOM uint32_t SLOTNUM    : 3;            /*!< Slot number associated with this FIFO data.                               */
      __IOM uint32_t RSVD       : 1;            /*!< RESERVED.                                                                 */
    } FIFO_b;
  } ;

  union {
    __IOM uint32_t FIFOPR;                      /*!< This is a Pop Read mirrored copy of the ADCFIFO register with
                                                     the only difference being that reading this register will
                                                     result in a simultaneous FIFO POP which is also achieved
                                                     by writing to the ADCFIFO Register. Note: The DFIFORDEN
                                                     bit must be set in the CFG register for the the destructive
                                                     read to be enabled.                                                       */

