AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4l_generic.h
    struct {
            uint32_t            : 7;
      __IOM uint32_t OSEL       : 1;            /*!< Selects the RTC oscillator (1=LFRC, 0=XT)                                 */
            uint32_t            : 24;
    } OCTRL_b;
  } ;

  union {
    __IOM uint32_t CLKOUT;                      /*!< This register enables the CLKOUT to the GPIOs, and selects the
                                                     clock source to that.                                                     */

    struct {
      __IOM uint32_t CKSEL      : 6;            /*!< CLKOUT signal select                                                      */
            uint32_t            : 1;
      __IOM uint32_t CKEN       : 1;            /*!< Enable the CLKOUT signal                                                  */
            uint32_t            : 24;
    } CLKOUT_b;
  } ;
  __IM  uint32_t  RESERVED1[3];

  union {
    __IOM uint32_t HFADJ;                       /*!< This register controls the HFRC adjustment. The HFRC clock can
                                                     change with temperature and process corners, and this register
                                                     controls the HFRC adjustment logic which reduces the fluctuations
                                                     to the clock.                                                             */

    struct {
      __IOM uint32_t HFADJEN    : 1;            /*!< HFRC adjustment control                                                   */
      __IOM uint32_t HFADJCK    : 3;            /*!< Repeat period for HFRC adjustment                                         */
            uint32_t            : 4;
      __IOM uint32_t HFXTADJ    : 12;           /*!< Target HFRC adjustment value.                                             */
      __IOM uint32_t HFWARMUP   : 1;            /*!< XT warmup period for HFRC adjustment                                      */
      __IOM uint32_t HFADJGAIN  : 3;            /*!< Gain control for HFRC adjustment                                          */
      __IOM uint32_t HFADJMAXDELTA : 5;         /*!< Maximum delta for HF Adjustments. 0=Disabled, 1-31=maximum delta
                                                     step                                                                      */
            uint32_t            : 3;
    } HFADJ_b;
  } ;
  __IM  uint32_t  RESERVED2[3];

  union {
    __IOM uint32_t CLOCKENSTAT;                 /*!< This register provides the enable status to all the peripheral
                                                     clocks.                                                                   */

    struct {
      __IOM uint32_t CLOCKENSTAT : 32;          /*!< Clock enable status                                                       */
    } CLOCKENSTAT_b;
  } ;

  union {
    __IOM uint32_t CLOCKEN2STAT;                /*!< This is a continuation of the clock enable status.                        */

    struct {
      __IOM uint32_t CLOCKEN2STAT : 32;         /*!< Clock enable status 2                                                     */
    } CLOCKEN2STAT_b;
  } ;

  union {
    __IOM uint32_t CLOCKEN3STAT;                /*!< This is a continuation of the clock enable status.                        */

    struct {
      __IOM uint32_t CLOCKEN3STAT : 32;         /*!< Clock enable status 3                                                     */
    } CLOCKEN3STAT_b;
  } ;
  __IM  uint32_t  RESERVED3[2];

  union {
    __IOM uint32_t MISC;                        /*!< This register controls a 'safe' mode for burst, which disables
                                                     the clock when burst transition is happening. It also includes
                                                     a register to force the HFRC during deep sleep. It is mainly
                                                     used for debug and testing.                                               */

    struct {
      __IOM uint32_t FRCHFRC    : 1;            /*!< Force HFRC On .                                                           */
      __IOM uint32_t FRCBURSTOFF : 1;           /*!< Force fclk, hclk, fclk_wic and fclk_pmu to be turned off during
                                                     burst transition.                                                         */
      __IOM uint32_t USEHFRC2FQ48MHZ : 1;       /*!< Use HFRC-48MHz or HFRC2-48MHz for DSP                                     */
      __IOM uint32_t USEHFRC2FQ96MHZ : 1;       /*!< Use HFRC-96MHz or HFRC2-96MHz for DSP                                     */
      __IOM uint32_t USEHFRC2FQ192MHZ : 1;      /*!< Use HFRC-192MHz or HFRC2-192MHz for MCU                                   */
      __IOM uint32_t FRCHFRC2   : 1;            /*!< Force HFRC2 On.Setting this bit forces HFRC2 to remain on, including
                                                     in deep sleep. When changing a module's clock source to
                                                     HFRC2, this bit must be set and remain set when any module
                                                     is using HFRC2 as its clock.                                              */
            uint32_t            : 2;
      __IOM uint32_t PWRONCLKENGFX : 1;         /*!< Chicken bit to disable Rev B clock enable during reset                    */
            uint32_t            : 1;
      __IOM uint32_t PWRONCLKENSDIO : 1;        /*!< Chicken bit to disable Rev B clock enable during reset                    */
      __IOM uint32_t PWRONCLKENCRYPTO : 1;      /*!< Chicken bit to disable Rev B clock enable during reset                    */
      __IOM uint32_t PWRONCLKENI2S0 : 1;        /*!< Chicken bit to disable Rev B clock enable during reset                    */
      __IOM uint32_t PWRONCLKENI2S1 : 1;        /*!< Chicken bit to disable Rev B clock enable during reset                    */
      __IOM uint32_t AXIXACLKENOVRRIDE : 1;     /*!< Chicken bit to disable Rev B added clock gating                           */
      __IOM uint32_t PWRONCLKENI2S0REFCLK : 1;  /*!< Chicken bit to disable Rev B clock enable during reset                    */
      __IOM uint32_t PWRONCLKENI2S1REFCLK : 1;  /*!< Chicken bit to disable Rev B clock enable during reset                    */
            uint32_t            : 1;
      __IOM uint32_t CM4DAXICLKGATEEN : 1;      /*!< Chicken bit to enable clock gating on CM4 DAXI CLK                        */
      __IOM uint32_t GFXCLKCLKGATEEN : 1;       /*!< Chicken bit to enable clock gating on GFX CLK                             */
      __IOM uint32_t GFXAXICLKCLKGATEEN : 1;    /*!< Chicken bit to enable clock gating on GFX AXI CLK                         */
      __IOM uint32_t APBDMACPUCLKCLKGATEEN : 1; /*!< Chicken bit to enable clock gating on APB DMA CPU CLK                     */
      __IOM uint32_t ETMTRACECLKCLKGATEEN : 1;  /*!< Chicken bit to enable clock gating on ETM TRACE CLK                       */
      __IOM uint32_t HFRCFUNCCLKGATEEN : 1;     /*!< Chicken bit to enable clock gating on HFRC_FUNC_CLK                       */
      __IOM uint32_t HFRC96TRUNKGATE : 1;       /*!< DO NOT USE. HFRC96_TRUNK_GATE. Setting this bit when BIT23=0,
                                                     will kill HFRC root clock.                                                */
      __IOM uint32_t CLKGENMISCSPARE : 1;       /*!< Spare/Unused Chicken Bit                                                  */
            uint32_t            : 6;
    } MISC_b;
  } ;

  union {
    __IOM uint32_t HF2ADJ0;                     /*!< This register controls hf2adj enable, fast_start enable, fast_start_delay
                                                     setting and counter input offset.                                         */

