AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4l_generic.h
    struct {
      __IOM uint32_t HF2ADJEN   : 1;            /*!< HF2ADJ control                                                            */
      __IOM uint32_t HF2ADJFASTSTREN : 1;       /*!< Fast_start_delay control                                                  */
      __IOM uint32_t HF2ADJFASTSTRDLY : 13;     /*!< Fast_start_delay value setting                                            */
      __IOM uint32_t HF2ADJCNTINOFFSET : 14;    /*!< Counter input offset                                                      */
      __IOM uint32_t HF2ADJXTHSMUXSEL : 1;      /*!< 0=XTHS 1=EXTREF select                                                    */
            uint32_t            : 2;
    } HF2ADJ0_b;
  } ;

  union {
    __IOM uint32_t HF2ADJ1;                     /*!< This register controls hf2adj trimming enable and trimming offset.        */

    struct {
      __IOM uint32_t HF2ADJTRIMEN : 3;          /*!< HF2ADJ output selection                                                   */
      __IOM uint32_t HF2ADJTRIMOFFSET : 11;     /*!< HF2ADJ trimming offset. (signed number)                                   */
            uint32_t            : 18;
    } HF2ADJ1_b;
  } ;

  union {
    __IOM uint32_t HF2ADJ2;                     /*!< This register controls xtal32m divider ratio and HF2ADJ ration
                                                     setting.                                                                  */

    struct {
      __IOM uint32_t HF2ADJXTALDIVRATIO : 2;    /*!< XTAL32MHz divider ratio for HF2ADJ.                                       */
      __IOM uint32_t HF2ADJRATIO : 29;          /*!< HF2ADJ ratio setting.                                                     */
            uint32_t            : 1;
    } HF2ADJ2_b;
  } ;

  union {
    __IOM uint32_t HF2VAL;                      /*!< This register provides the read back of the HF2TUNE                       */

    struct {
      __IOM uint32_t HF2ADJTRIMOUT : 11;        /*!< HF2ADJ trimming output                                                    */
            uint32_t            : 21;
    } HF2VAL_b;
  } ;
  __IM  uint32_t  RESERVED4[8];

  union {
    __IOM uint32_t LFRCCTRL;                    /*!< LFRC control                                                              */

    struct {
      __IOM uint32_t LFRCOUT    : 1;            /*!< Disable LFRC output                                                       */
      __IOM uint32_t LFRCPWD    : 1;            /*!< Power down LFRC                                                           */
            uint32_t            : 30;
    } LFRCCTRL_b;
  } ;
  __IM  uint32_t  RESERVED5[2];

  union {
    __IOM uint32_t DISPCLKCTRL;                 /*!< Provides ability to select the PLL reference clock, and derivative
                                                     of the display clock                                                      */

    struct {
      __IOM uint32_t PLLCLKSEL  : 2;            /*!< Selection for PLL reference clock.                                        */
            uint32_t            : 1;
      __IOM uint32_t PLLCLKEN   : 1;            /*!< Enable for the PLL clock through clkgen                                   */
      __IOM uint32_t DISPCLKSEL : 2;            /*!< Selection for PLL reference clock.                                        */
            uint32_t            : 26;
    } DISPCLKCTRL_b;
  } ;

  union {
    __IOM uint32_t CLKGENSPARES;                /*!< CLKGEN Spare Regs                                                         */

    struct {
      __IOM uint32_t CLKGENSPARES : 32;         /*!< Placeholer spare registes that can be used as needed for future
                                                     use                                                                       */
    } CLKGENSPARES_b;
  } ;

  union {
    __IOM uint32_t HFRCIDLECOUNTERS;            /*!< Provides SW controlled # idle cycles before powering down HFRC,
                                                     HFRC2., core clock enable(s)                                              */

    struct {
      __IOM uint32_t HFRCPWRDOWNDELAY : 6;      /*!< Idle counter for HFRC POWER DOWN DELAY                                    */
            uint32_t            : 2;
      __IOM uint32_t HFRCCLKREQDELAY : 6;       /*!< Idle counter for HFRC CLK REQ DELAY                                       */
            uint32_t            : 2;
      __IOM uint32_t HFRC2PWRDOWNDELAY : 6;     /*!< Idle counter for HFRC2 POWER DOWN DELAY                                   */
            uint32_t            : 2;
      __IOM uint32_t HFRC2CLKREQDELAY : 6;      /*!< Enable for the PLL clock through clkgen                                   */
            uint32_t            : 1;
      __IOM uint32_t UPDATEENABLE : 1;          /*!< usage : Clear UPDATEENABLE or 1'b0; Update other bits fields
                                                     of this register. Set this register to 1'b1 for HW to update.             */
    } HFRCIDLECOUNTERS_b;
  } ;
} CLKGEN_Type;                                  /*!< Size = 144 (0x90)                                                         */



/* =========================================================================================================================== */
/* ================                                            CPU                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief CM4 Complex Registers (Cache, TCM, DAXI) (CPU)
  */

typedef struct {                                /*!< CPU Structure                                                             */

  union {
    __IOM uint32_t CACHECFG;                    /*!< CM4 Cache Control                                                         */

    struct {
      __IOM uint32_t ENABLE     : 1;            /*!< Enables the CM4 cache controller and enables power to the cache
                                                     SRAMs. The ICACHE_ENABLE and DCACHE_ENABLE should be set
                                                     to enable caching for each type of access.                                */
      __IOM uint32_t LRU        : 1;            /*!< Sets the cache repleacment policy. 0=LRR (least recently replaced),
                                                     1=LRU (least recently used). LRR minimizes writes to the
                                                     TAG SRAM.                                                                 */
      __IOM uint32_t NC0ENABLE  : 1;            /*!< Enable Non-cacheable region 0. See NCR0 registers to define
                                                     the region.                                                               */
      __IOM uint32_t NC1ENABLE  : 1;            /*!< Enable Non-cacheable region 1. See NCR1 registers to define
                                                     the region.                                                               */
      __IOM uint32_t CONFIG     : 4;            /*!< Sets the cache configuration                                              */
      __IOM uint32_t IENABLE    : 1;            /*!< Enable CM4 Instruction Caching                                            */
      __IOM uint32_t DENABLE    : 1;            /*!< Enable CM4 Data Caching.                                                  */
      __IOM uint32_t CLKGATE    : 1;            /*!< Enable clock gating of cache TAG RAM. Software should enable
                                                     this bit for optimal power efficiency.                                    */
      __IOM uint32_t LS         : 1;            /*!< Enable LS (light sleep) of cache RAMs. Software should DISABLE
                                                     this bit since cache activity is too high to benefit from
                                                     LS usage.                                                                 */
      __IOM uint32_t NC1CACHELOCK : 1;          /*!< Only valid when Cache Mode D is set. When high sets the mode
                                                     of the the NC1 region such that all accesse to this region
                                                     are cached in to the upper half of the cache. When set
                                                     low then NCR1 is non cacheable.                                           */
      __IOM uint32_t NC0CACHELOCK : 1;          /*!< Only valid when Cache Mode D is set. When high sets the mode
                                                     of the the NC0 region such that all accesse to this region
                                                     are cached in to the lower half of the cache. When set
                                                     low then NCR0 is non cacheable.                                           */
            uint32_t            : 6;
      __IOM uint32_t DATACLKGATE : 1;           /*!< Enable aggressive clock gating of entire data array. This bit
                                                     should be set to 1 for optimal power efficiency.                          */
            uint32_t            : 3;
      __IOM uint32_t ENABLEMONITOR : 1;         /*!< Enable Cache Monitoring Stats. Cache monitoring consumes additional
                                                     power and should only be enabled when profiling code and
                                                     counters will increment when this bit is set. Counter values
                                                     will be retained when this is set to 0, allowing software
                                                     to enable/disable counting for multiple code segments.                    */
            uint32_t            : 7;
    } CACHECFG_b;
  } ;
  __IM  uint32_t  RESERVED;

  union {
    __IOM uint32_t CACHECTRL;                   /*!< Cache Control                                                             */

