AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4l_generic.h
    struct {
      __IOM uint32_t ICODEFAULTADDR : 32;       /*!< The ICODE bus address observed when a Bus Fault occurred. Once
                                                     an address is captured in this field, it is held until
                                                     the corresponding Fault Observed bit is cleared in the
                                                     FAULTSTATUS register.                                                     */
    } ICODEFAULTADDR_b;
  } ;

  union {
    __IOM uint32_t DCODEFAULTADDR;              /*!< DCODE bus address which was present when a bus fault occurred.            */

    struct {
      __IOM uint32_t DCODEFAULTADDR : 32;       /*!< The DCODE bus address observed when a Bus Fault occurred. Once
                                                     an address is captured in this field, it is held until
                                                     the corresponding Fault Observed bit is cleared in the
                                                     FAULTSTATUS register.                                                     */
    } DCODEFAULTADDR_b;
  } ;

  union {
    __IOM uint32_t SYSFAULTADDR;                /*!< System bus address which was present when a bus fault occurred.           */

    struct {
      __IOM uint32_t SYSFAULTADDR : 32;         /*!< SYS bus address observed when a Bus Fault occurred. Once an
                                                     address is captured in this field, it is held until the
                                                     corresponding Fault Observed bit is cleared in the FAULTSTATUS
                                                     register.                                                                 */
    } SYSFAULTADDR_b;
  } ;

  union {
    __IOM uint32_t FAULTSTATUS;                 /*!< Reflects the status of the bus decoders' fault detection. Any
                                                     write to this register will clear all of the status bits
                                                     within the register.                                                      */

    struct {
      __IOM uint32_t ICODEFAULT : 1;            /*!< The ICODE Bus Decoder Fault Detected bit. When set, a fault
                                                     has been detected, and the ICODEFAULTADDR register will
                                                     contain the bus address which generated the fault.                        */
      __IOM uint32_t DCODEFAULT : 1;            /*!< DCODE Bus Decoder Fault Detected bit. When set, a fault has
                                                     been detected, and the DCODEFAULTADDR register will contain
                                                     the bus address which generated the fault.                                */
      __IOM uint32_t SYSFAULT   : 1;            /*!< SYS Bus Decoder Fault Detected bit. When set, a fault has been
                                                     detected, and the SYSFAULTADDR register will contain the
                                                     bus address which generated the fault.                                    */
            uint32_t            : 29;
    } FAULTSTATUS_b;
  } ;

  union {
    __IOM uint32_t FAULTCAPTUREEN;              /*!< Enable the fault capture registers                                        */

    struct {
      __IOM uint32_t FAULTCAPTUREEN : 1;        /*!< Fault Capture Enable field. When set, the Fault Capture monitors
                                                     are enabled and addresses which generate a hard fault are
                                                     captured into the FAULTADDR registers.                                    */
            uint32_t            : 31;
    } FAULTCAPTUREEN_b;
  } ;
  __IM  uint32_t  RESERVED4[11];

  union {
    __IOM uint32_t INTEN;                       /*!< Set bits in this register to allow this module to generate the
                                                     corresponding interrupt.                                                  */

    struct {
      __IOM uint32_t AXIWERROR  : 1;            /*!< AXI Write Error Occurred                                                  */
            uint32_t            : 31;
    } INTEN_b;
  } ;

  union {
    __IOM uint32_t INTSTAT;                     /*!< Read bits from this register to discover the cause of a recent
                                                     interrupt.                                                                */

    struct {
      __IOM uint32_t AXIWERROR  : 1;            /*!< AXI Write Error Occurred                                                  */
            uint32_t            : 31;
    } INTSTAT_b;
  } ;

  union {
    __IOM uint32_t INTCLR;                      /*!< Write a 1 to a bit in this register to clear the interrupt status
                                                     associated with that bit.                                                 */

    struct {
      __IOM uint32_t AXIWERROR  : 1;            /*!< AXI Write Error Occurred                                                  */
            uint32_t            : 31;
    } INTCLR_b;
  } ;

  union {
    __IOM uint32_t INTSET;                      /*!< Write a 1 to a bit in this register to instantly generate an
                                                     interrupt from this module. (Generally used for testing
                                                     purposes).                                                                */

    struct {
      __IOM uint32_t AXIWERROR  : 1;            /*!< AXI Write Error Occurred                                                  */
            uint32_t            : 31;
    } INTSET_b;
  } ;

  union {
    __IOM uint32_t WRITEERRADDR;                /*!< DAXI Write Error Address                                                  */

