AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4l_generic.h
    struct {
      __IOM uint32_t WERRADDR   : 32;           /*!< This address will be approximate since multiple write transactions
                                                     might be in flight at any given time. However, it should
                                                     be accurate when debugging/single-stepping                                */
    } WRITEERRADDR_b;
  } ;
  __IM  uint32_t  RESERVED5[11];

  union {
    __IOM uint32_t DMON0;                       /*!< Data Cache Total Accesses                                                 */

    struct {
      __IOM uint32_t DACCESS    : 32;           /*!< Total accesses to data cache. All performance metrics should
                                                     be relative to the number of accesses performed.                          */
    } DMON0_b;
  } ;

  union {
    __IOM uint32_t DMON1;                       /*!< Data Cache Tag Lookups                                                    */

    struct {
      __IOM uint32_t DLOOKUP    : 32;           /*!< Total tag lookups from data cache.                                        */
    } DMON1_b;
  } ;

  union {
    __IOM uint32_t DMON2;                       /*!< Data Cache Hits                                                           */

    struct {
      __IOM uint32_t DHIT       : 32;           /*!< Cache hits from lookup operations.                                        */
    } DMON2_b;
  } ;

  union {
    __IOM uint32_t DMON3;                       /*!< Data Cache Line Hits                                                      */

    struct {
      __IOM uint32_t DLINE      : 32;           /*!< Cache hits from line cache                                                */
    } DMON3_b;
  } ;

  union {
    __IOM uint32_t IMON0;                       /*!< Instruction Cache Total Accesses                                          */

    struct {
      __IOM uint32_t IACCESS    : 32;           /*!< Total accesses to Instruction cache                                       */
    } IMON0_b;
  } ;

  union {
    __IOM uint32_t IMON1;                       /*!< Instruction Cache Tag Lookups                                             */

    struct {
      __IOM uint32_t ILOOKUP    : 32;           /*!< Total tag lookups from Instruction cache                                  */
    } IMON1_b;
  } ;

  union {
    __IOM uint32_t IMON2;                       /*!< Instruction Cache Hits                                                    */

    struct {
      __IOM uint32_t IHIT       : 32;           /*!< Cache hits from lookup operations                                         */
    } IMON2_b;
  } ;

  union {
    __IOM uint32_t IMON3;                       /*!< Instruction Cache Line Hits                                               */

    struct {
      __IOM uint32_t ILINE      : 32;           /*!< Cache hits from line cache                                                */
    } IMON3_b;
  } ;
} CPU_Type;                                     /*!< Size = 288 (0x120)                                                        */



/* =========================================================================================================================== */
/* ================                                          CRYPTO                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Embedded security and cryptographic services (CRYPTO)
  */

typedef struct {                                /*!< CRYPTO Structure                                                          */

  union {
    __IOM uint32_t MEMORYMAP0;                  /*!< This register maps the virtual register R0 to a physical address
                                                     in memory.                                                                */

    struct {
            uint32_t            : 1;
      __IOM uint32_t PHYSADDRMAP0 : 10;         /*!< Contains the physical address in memory to map the R0 register.           */
            uint32_t            : 21;
    } MEMORYMAP0_b;
  } ;

  union {
    __IOM uint32_t MEMORYMAP1;                  /*!< This register maps the virtual register R1 to a physical address
                                                     in memory.                                                                */

    struct {
            uint32_t            : 1;
      __IOM uint32_t PHYSADDRMAP1 : 10;         /*!< Contains the physical address in memory to map the R1 register.           */
            uint32_t            : 21;
    } MEMORYMAP1_b;
  } ;

  union {
    __IOM uint32_t MEMORYMAP2;                  /*!< This register maps the virtual register R2 to a physical address
                                                     in memory.                                                                */

    struct {
            uint32_t            : 1;
      __IOM uint32_t PHYSADDRMAP2 : 10;         /*!< Contains the physical address in memory to map the R2 register.           */
            uint32_t            : 21;
    } MEMORYMAP2_b;
  } ;

  union {
    __IOM uint32_t MEMORYMAP3;                  /*!< This register maps the virtual register R3 to a physical address
                                                     in memory.                                                                */

    struct {
            uint32_t            : 1;
      __IOM uint32_t PHYSADDRMAP3 : 10;         /*!< Contains the physical address in memory to map the R3 register.           */
            uint32_t            : 21;
    } MEMORYMAP3_b;
  } ;

  union {
    __IOM uint32_t MEMORYMAP4;                  /*!< This register maps the virtual register R4 to a physical address
                                                     in memory.                                                                */

