AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4l_generic.h
    struct {
      __IOM uint32_t PKASWRESET : 1;            /*!< The reset mechanism takes about four PKA clock cycles until
                                                     the reset line is deasserted                                              */
            uint32_t            : 31;
    } PKASWRESET_b;
  } ;

  union {
    __IOM uint32_t PKAL0;                       /*!< This register holds one of the optional size of the operation.            */

    struct {
      __IOM uint32_t PKAL0      : 13;           /*!< Size of the operation in bytes.                                           */
            uint32_t            : 19;
    } PKAL0_b;
  } ;

  union {
    __IOM uint32_t PKAL1;                       /*!< This register holds one of the optional size of the operation.            */

    struct {
      __IOM uint32_t PKAL1      : 13;           /*!< Size of the operation in bytes.                                           */
            uint32_t            : 19;
    } PKAL1_b;
  } ;

  union {
    __IOM uint32_t PKAL2;                       /*!< This register holds one of the optional size of the operation.            */

    struct {
      __IOM uint32_t PKAL2      : 13;           /*!< Size of the operation in bytes.                                           */
            uint32_t            : 19;
    } PKAL2_b;
  } ;

  union {
    __IOM uint32_t PKAL3;                       /*!< This register holds one of the optional size of the operation.            */

    struct {
      __IOM uint32_t PKAL3      : 13;           /*!< Size of the operation in bytes.                                           */
            uint32_t            : 19;
    } PKAL3_b;
  } ;

  union {
    __IOM uint32_t PKAL4;                       /*!< This register holds one of the optional size of the operation.            */

    struct {
      __IOM uint32_t PKAL4      : 13;           /*!< Size of the operation in bytes.                                           */
            uint32_t            : 19;
    } PKAL4_b;
  } ;

  union {
    __IOM uint32_t PKAL5;                       /*!< This register holds one of the optional size of the operation.            */

    struct {
      __IOM uint32_t PKAL5      : 13;           /*!< Size of the operation in bytes.                                           */
            uint32_t            : 19;
    } PKAL5_b;
  } ;

  union {
    __IOM uint32_t PKAL6;                       /*!< This register holds one of the optional size of the operation.            */

    struct {
      __IOM uint32_t PKAL6      : 13;           /*!< Size of the operation in bytes.                                           */
            uint32_t            : 19;
    } PKAL6_b;
  } ;

  union {
    __IOM uint32_t PKAL7;                       /*!< This register holds one of the optional size of the operation.            */

    struct {
      __IOM uint32_t PKAL7      : 13;           /*!< Size of the operation in bytes.                                           */
            uint32_t            : 19;
    } PKAL7_b;
  } ;

  union {
    __IOM uint32_t PKAPIPERDY;                  /*!< This register indicates whether the PKA pipe is ready to receive
                                                     a new OPCODE.                                                             */

    struct {
      __IOM uint32_t PKAPIPERDY : 1;            /*!< Indication whether PKA pipe is ready for new OPCODE.                      */
            uint32_t            : 31;
    } PKAPIPERDY_b;
  } ;

  union {
    __IOM uint32_t PKADONE;                     /*!< This register indicates whether PKA operation is completed.               */

    struct {
      __IOM uint32_t PKADONE    : 1;            /*!< Indicates if PKA operation is completed, and pipe is empty.               */
            uint32_t            : 31;
    } PKADONE_b;
  } ;

  union {
    __IOM uint32_t PKAMONSELECT;                /*!< This register defines which PKA FSM monitor is being output.              */

    struct {
      __IOM uint32_t PKAMONSELECT : 4;          /*!< Defines which PKA FSM monitor is being output.                            */
            uint32_t            : 28;
    } PKAMONSELECT_b;
  } ;
  __IM  uint32_t  RESERVED[2];

  union {
    __IOM uint32_t PKAVERSION;                  /*!< This register holds the pka version                                       */

    struct {
      __IOM uint32_t PKAVERSION : 32;           /*!< This is the PKA version                                                   */
    } PKAVERSION_b;
  } ;
  __IM  uint32_t  RESERVED1[2];

  union {
    __IOM uint32_t PKAMONREAD;                  /*!< The PKA monitor bus register.                                             */

    struct {
      __IOM uint32_t PKAMONREAD : 32;           /*!< This is the PKA monitor bus register output                               */
    } PKAMONREAD_b;
  } ;

  union {
    __IOM uint32_t PKASRAMADDR;                 /*!< first address given to PKA SRAM for write transactions.                   */

    struct {
      __IOM uint32_t PKASRAMADDR : 32;          /*!< PKA SRAM write starting address                                           */
    } PKASRAMADDR_b;
  } ;

  union {
    __IOM uint32_t PKASRAMWDATA;                /*!< Write data to PKA SRAM.                                                   */

    struct {
      __IOM uint32_t PKASRAMWDATA : 32;         /*!< 32 bit write to PKA SRAM: triggers the SRAM write DMA address
                                                     automatically incremented                                                 */
    } PKASRAMWDATA_b;
  } ;

  union {
    __IOM uint32_t PKASRAMRDATA;                /*!< Read data from PKA SRAM.                                                  */

    struct {
      __IOM uint32_t PKASRAMRDATA : 32;         /*!< 32 bit read from PKA SRAM: read - triggers the SRAM read DMA
                                                     address automatically incremented                                         */
    } PKASRAMRDATA_b;
  } ;

  union {
    __IOM uint32_t PKASRAMWRCLR;                /*!< Write buffer clean.                                                       */

