AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4l_generic.h
    struct {
      __IOM uint32_t CHACHABLOCKCNTMSB : 32;    /*!< bits 31:0 of CHACHA_BLOCK_CNT_MSB register.                               */
    } CHACHABLOCKCNTMSB_b;
  } ;

  union {
    __IOM uint32_t CHACHASWRESET;               /*!< Resets CHACHA_SALSA engine.                                               */

    struct {
      __IOM uint32_t CHACHSWRESET : 1;          /*!< Writing to this address resets the only FSM of CHACHA engine.
                                                     The reset takes 4 CORE_CLK cycles.                                        */
            uint32_t            : 31;
    } CHACHASWRESET_b;
  } ;

  union {
    __IOM uint32_t CHACHAFORPOLYKEY0;           /*!< bits 255:224 of CHACHA_FOR_POLY_KEY                                       */

    struct {
      __IOM uint32_t CHACHAFORPOLYKEY0 : 32;    /*!< bits 255:224 of CHACHA_FOR_POLY_KEY                                       */
    } CHACHAFORPOLYKEY0_b;
  } ;

  union {
    __IOM uint32_t CHACHAFORPOLYKEY1;           /*!< bits 223:192 of CHACHA_FOR_POLY_KEY                                       */

    struct {
      __IOM uint32_t CHACHAFORPOLYKEY1 : 32;    /*!< bits 223:192 of CHACHA_FOR_POLY_KEY                                       */
    } CHACHAFORPOLYKEY1_b;
  } ;

  union {
    __IOM uint32_t CHACHAFORPOLYKEY2;           /*!< bits191:160 of CHACHA_FOR_POLY_KEY                                        */

    struct {
      __IOM uint32_t CHACHAFORPOLYKEY2 : 32;    /*!< bits191:160 of CHACHA_FOR_POLY_KEY                                        */
    } CHACHAFORPOLYKEY2_b;
  } ;

  union {
    __IOM uint32_t CHACHAFORPOLYKEY3;           /*!< bits159:128 of CHACHA_FOR_POLY_KEY                                        */

    struct {
      __IOM uint32_t CHACHAFORPOLYKEY3 : 32;    /*!< bits 159:128 of CHACHA_FOR_POLY_KEY                                       */
    } CHACHAFORPOLYKEY3_b;
  } ;

  union {
    __IOM uint32_t CHACHAFORPOLYKEY4;           /*!< bits 127:96 of CHACHA_FOR_POLY_KEY                                        */

    struct {
      __IOM uint32_t CHACHAFORPOLYKEY4 : 32;    /*!< bits 127:96 of CHACHA_FOR_POLY_KEY                                        */
    } CHACHAFORPOLYKEY4_b;
  } ;

  union {
    __IOM uint32_t CHACHAFORPOLYKEY5;           /*!< bits 95:64 of CHACHA_FOR_POLY_KEY                                         */

    struct {
      __IOM uint32_t CHACHAFORPOLYKEY5 : 32;    /*!< bits 95:64 of CHACHA_FOR_POLY_KEY                                         */
    } CHACHAFORPOLYKEY5_b;
  } ;

  union {
    __IOM uint32_t CHACHAFORPOLYKEY6;           /*!< bits 63:32 of CHACHA_FOR_POLY_KEY                                         */

    struct {
      __IOM uint32_t CHACHAFORPOLYKEY6 : 32;    /*!< bits 63:32 of CHACHA_FOR_POLY_KEY                                         */
    } CHACHAFORPOLYKEY6_b;
  } ;

  union {
    __IOM uint32_t CHACHAFORPOLYKEY7;           /*!< bits 31:0 of CHACHA_FOR_POLY_KEY                                          */

    struct {
      __IOM uint32_t CHACHAFORPOLYKEY7 : 32;    /*!< bits 31:0 of CHACHA_FOR_POLY_KEY                                          */
    } CHACHAFORPOLYKEY7_b;
  } ;

  union {
    __IOM uint32_t CHACHABYTEWORDORDERCNTLREG;  /*!< CHACHA_SALSA DATA ORDER configuration.                                    */

    struct {
      __IOM uint32_t CHACHADINWORDORDER : 1;    /*!< Change the words order of the input data.                                 */
      __IOM uint32_t CHACHADINBYTEORDER : 1;    /*!< Change the byte order of the input data.                                  */
      __IOM uint32_t CHACHACOREMATRIXLBEORDER : 1;/*!< Change the quarter of a matrix order in core                            */
      __IOM uint32_t CHACHADOUTWORDORDER : 1;   /*!< Change the words order of the output data.                                */
      __IOM uint32_t CHACHADOUTBYTEORDER : 1;   /*!< Change the byte order of the output data.                                 */
            uint32_t            : 27;
    } CHACHABYTEWORDORDERCNTLREG_b;
  } ;

  union {
    __IOM uint32_t CHACHADEBUGREG;              /*!< This register is used to debug the CHACHA engine                          */

    struct {
      __IOM uint32_t CHACHADEBUGFSMSTATE : 2;   /*!< CHACHA_DEBUG_FSM_STATE                                                    */
            uint32_t            : 30;
    } CHACHADEBUGREG_b;
  } ;
  __IM  uint32_t  RESERVED9[5];

  union {
    __IOM uint32_t AESKEY00;                    /*!< bits 31:0 of AES Key0 (used as the AES key in non-tunneling
                                                     operations, and as the first tunnel stage key in tunneling
                                                     operations).                                                              */

    struct {
      __IOM uint32_t AESKEY00   : 32;           /*!< bits 31:0 of AES Key0.                                                    */
    } AESKEY00_b;
  } ;

  union {
    __IOM uint32_t AESKEY01;                    /*!< bits 63:32 of AES Key0 (used as the AES key in non-tunneling
                                                     operations, and as the first tunnel stage key in tunneling
                                                     operations).                                                              */

    struct {
      __IOM uint32_t AESKEY01   : 32;           /*!< bits 63:32 of AES Key0.                                                   */
    } AESKEY01_b;
  } ;

  union {
    __IOM uint32_t AESKEY02;                    /*!< bits 95:64 of AES Key0 (used as the AES key in non-tunneling
                                                     operations, and as the first tunnel stage key in tunneling
                                                     operations).                                                              */

    struct {
      __IOM uint32_t AESKEY02   : 32;           /*!< bits 95:64 of AES Key0.                                                   */
    } AESKEY02_b;
  } ;

  union {
    __IOM uint32_t AESKEY03;                    /*!< bits 127:96 of AES Key0 (used as the AES key in non-tunneling
                                                     operations, and as the first tunnel stage key in tunneling
                                                     operations).                                                              */

