AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4l_generic.h
    struct {
      __IOM uint32_t DINBUFFERDATA : 32;        /*!< This register is mapped into 8 addresses in order to enable
                                                     a CPU burst.                                                              */
    } DINBUFFER_b;
  } ;
  __IM  uint32_t  RESERVED40[7];

  union {
    __IOM uint32_t DINMEMDMABUSY;               /*!< Indicates whether memory (AXI) source DMA (DIN) is busy.                  */

    struct {
      __IOM uint32_t DINMEMDMABUSY : 1;         /*!< DIN memory DMA busy                                                       */
            uint32_t            : 31;
    } DINMEMDMABUSY_b;
  } ;
  __IM  uint32_t  RESERVED41;

  union {
    __IOM uint32_t SRCLLIWORD0;                 /*!< This register is used in direct LLI mode - holds the location
                                                     of the data source in the memory (AXI).                                   */

    struct {
      __IOM uint32_t SRCLLIWORD0 : 32;          /*!< Source address within memory.                                             */
    } SRCLLIWORD0_b;
  } ;

  union {
    __IOM uint32_t SRCLLIWORD1;                 /*!< This register is used in direct LLI mode - holds the number
                                                     of bytes to be read from the memory (AXI). Writing to this
                                                     register triggers the DMA. Note: This is a special register,
                                                     affected by internal logic. Test result of this register
                                                     is NA.                                                                    */

    struct {
      __IOM uint32_t BYTESNUM   : 30;           /*!< Total number of bytes to read using DMA in this entry                     */
      __IOM uint32_t FIRST      : 1;            /*!< 0x1 - Indicates the first LLI entry                                       */
      __IOM uint32_t LAST       : 1;            /*!< 0x1 - Indicates the last LLI entry                                        */
    } SRCLLIWORD1_b;
  } ;

  union {
    __IOM uint32_t SRAMSRCADDR;                 /*!< Location of data (start address) to be read from SRAM. Note:
                                                     This is a special register, affected by internal logic.
                                                     Test result of this register is NA.                                       */

    struct {
      __IOM uint32_t SRAMSOURCE : 32;           /*!< SRAM source base address of data                                          */
    } SRAMSRCADDR_b;
  } ;

  union {
    __IOM uint32_t DINSRAMBYTESLEN;             /*!< This register holds the size of the data (in bytes) to be read
                                                     from the SRAM. Note: This is a special register, affected
                                                     by internal logic. Test result of this register is NA.                    */

    struct {
      __IOM uint32_t BYTESLEN   : 32;           /*!< Size of data to read from SRAM (bytes). This is the trigger
                                                     to the SRAM SRC DMA.                                                      */
    } DINSRAMBYTESLEN_b;
  } ;

  union {
    __IOM uint32_t DINSRAMDMABUSY;              /*!< This register holds the status of the SRAM DMA DIN.                       */

    struct {
      __IOM uint32_t BUSY       : 1;            /*!< DIN SRAM DMA busy:                                                        */
            uint32_t            : 31;
    } DINSRAMDMABUSY_b;
  } ;

  union {
    __IOM uint32_t DINSRAMENDIANNESS;           /*!< This register defines the endianness of the DIN interface to
                                                     SRAM.                                                                     */

    struct {
      __IOM uint32_t SRAMDINENDIANNESS : 1;     /*!< Defines the endianness of DIN interface to SRAM:                          */
            uint32_t            : 31;
    } DINSRAMENDIANNESS_b;
  } ;
  __IM  uint32_t  RESERVED42[2];

  union {
    __IOM uint32_t DINCPUDATASIZE;              /*!< This register hold the number of bytes to be transmited using
                                                     external DMA. Note: This is a special register, affected
                                                     by internal logic. Test result of this register is NA.                    */

    struct {
      __IOM uint32_t CPUDINSIZE : 16;           /*!< When using external DMA, the size of transmited data in bytes
                                                     should be written to this register.                                       */
            uint32_t            : 16;
    } DINCPUDATASIZE_b;
  } ;
  __IM  uint32_t  RESERVED43;

  union {
    __IOM uint32_t FIFOINEMPTY;                 /*!< DIN FIFO empty indication                                                 */

    struct {
      __IOM uint32_t EMPTY      : 1;            /*!< 0x1 - FIFO empty                                                          */
            uint32_t            : 31;
    } FIFOINEMPTY_b;
  } ;
  __IM  uint32_t  RESERVED44;

  union {
    __IOM uint32_t DINFIFORSTPNTR;              /*!< Writing to this register resets the DIN_FIFO pointers.                    */

    struct {
      __IOM uint32_t RST        : 1;            /*!< Writing any value to this address resets the DIN_FIFO pointers.           */
            uint32_t            : 31;
    } DINFIFORSTPNTR_b;
  } ;
  __IM  uint32_t  RESERVED45[41];

  union {
    __IOM uint32_t DOUTBUFFER;                  /*!< Cryptographic result - CPU can directly access it. Note: This
                                                     is a special register, affected by internal logic. Test
                                                     result of this register is NA.                                            */

