AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4l_generic.h
    struct {
      __IOM uint32_t HOSTDCUEN2 : 32;           /*!< Debug Control Unit (DCU) Enable bits.                                     */
    } HOSTDCUEN2_b;
  } ;

  union {
    __IOM uint32_t HOSTDCUEN3;                  /*!< The DCU [1271:96] enable register. Note: This is a special register,
                                                     affected by internal logic. Test result of this register
                                                     is NA.                                                                    */

    struct {
      __IOM uint32_t HOSTDCUEN3 : 32;           /*!< Debug Control Unit (DCU) Enable bits.                                     */
    } HOSTDCUEN3_b;
  } ;

  union {
    __IOM uint32_t HOSTDCULOCK0;                /*!< The DCU lock register. Note: This is a special register, affected
                                                     by internal logic. Test result of this register is NA.                    */

    struct {
      __IOM uint32_t HOSTDCULOCK0 : 32;         /*!< DCU_lock [31:0] register (a dedicated lock register per DCU
                                                     bit).                                                                     */
    } HOSTDCULOCK0_b;
  } ;

  union {
    __IOM uint32_t HOSTDCULOCK1;                /*!< The DCU lock register. Note: This is a special register, affected
                                                     by internal logic. Test result of this register is NA.                    */

    struct {
      __IOM uint32_t HOSTDCULOCK1 : 32;         /*!< DCU_lock [63:32] register (a dedicated lock register per DCU
                                                     bit).                                                                     */
    } HOSTDCULOCK1_b;
  } ;

  union {
    __IOM uint32_t HOSTDCULOCK2;                /*!< The DCU lock register. Note: This is a special register, affected
                                                     by internal logic. Test result of this register is NA.                    */

    struct {
      __IOM uint32_t HOSTDCULOCK2 : 32;         /*!< DCU_lock [95:64] register (a dedicated lock register per DCU
                                                     bit).                                                                     */
    } HOSTDCULOCK2_b;
  } ;

  union {
    __IOM uint32_t HOSTDCULOCK3;                /*!< The DCU lock register. Note: This is a special register, affected
                                                     by internal logic. Test result of this register is NA.                    */

    struct {
      __IOM uint32_t HOSTDCULOCK3 : 32;         /*!< DCU_lock [127:96] register (a dedicated lock register per DCU
                                                     bit).                                                                     */
    } HOSTDCULOCK3_b;
  } ;

  union {
    __IOM uint32_t AOICVDCURESTRICTIONMASK0;    /*!< The DCU lock register.                                                    */

    struct {
      __IOM uint32_t AOICVDCURESTRICTIONMASK0 : 32;/*!< AO_ICV_DCU_RESTRICTION_MASK [31:0] parameter, that will be a
                                                     customer modifiable.                                                      */
    } AOICVDCURESTRICTIONMASK0_b;
  } ;

  union {
    __IOM uint32_t AOICVDCURESTRICTIONMASK1;    /*!< The 'ICV_DCU_restriction_mask' parameter is read by FW during
                                                     the secure debug verification to prevent OEM from setting
                                                     specific DCUs that protect ICV secrets                                    */

    struct {
      __IOM uint32_t AOICVDCURESTRICTIONMASK1 : 32;/*!< AO_ICV_DCU_RESTRICTION_MASK [63:32] parameter, that will be
                                                     a customer modifiable.                                                    */
    } AOICVDCURESTRICTIONMASK1_b;
  } ;

  union {
    __IOM uint32_t AOICVDCURESTRICTIONMASK2;    /*!< The 'ICV_DCU_restriction_mask' parameter is read by FW during
                                                     the secure debug verification to prevent OEM from setting
                                                     specific DCUs that protect ICV secrets                                    */

    struct {
      __IOM uint32_t AOICVDCURESTRICTIONMASK2 : 32;/*!< AO_ICV_DCU_RESTRICTION_MASK [95:64] parameter, that will be
                                                     a customer modifiable.                                                    */
    } AOICVDCURESTRICTIONMASK2_b;
  } ;

  union {
    __IOM uint32_t AOICVDCURESTRICTIONMASK3;    /*!< The 'ICV_DCU_restriction_mask' parameter is read by FW during
                                                     the secure debug verification to prevent OEM from setting
                                                     specific DCUs that protect ICV secrets                                    */

    struct {
      __IOM uint32_t AOICVDCURESTRICTIONMASK3 : 32;/*!< AO_ICV_DCU_RESTRICTION_MASK [127:96] parameter, that will be
                                                     a customer modifiable.                                                    */
    } AOICVDCURESTRICTIONMASK3_b;
  } ;

  union {
    __IOM uint32_t AOCCSECDEBUGRESET;           /*!< The reset-upon-debug indication                                           */

    struct {
      __IOM uint32_t AOCCSECDEBUGRESET : 1;     /*!< For resets Cerberus, and prevents loading the HW keys after
                                                     that reset                                                                */
            uint32_t            : 31;
    } AOCCSECDEBUGRESET_b;
  } ;

  union {
    __IOM uint32_t HOSTAOLOCKBITS;              /*!< These masks will define, per LCS, which DCU bits will be tied
                                                     to zero, even if the Host tries to set them. Note: This
                                                     is a special register, affected by internal logic. Test
                                                     result of this register is NA.                                            */

