AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4l_generic.h
    struct {
      __IOM uint32_t HOSTSHADOWKCPREG : 1;      /*!< This field is used to update the KCP registers when the device
                                                     is in CM or DM mode, The KCP is updated by shifting                       */
            uint32_t            : 31;
    } HOSTSHADOWKCPREG_b;
  } ;

  union {
    __IOM uint32_t HOSTSHADOWKCEREG;            /*!< This register interface is used to update the KCE registers
                                                     when the device is in CM or DM mode, The KCE is updated
                                                     by shifting                                                               */

    struct {
      __IOM uint32_t HOSTSHADOWKCEREG : 1;      /*!< This field is used to update the KCE registers when the device
                                                     is in CM or DM mode, The KCE is updated by shifting                       */
            uint32_t            : 31;
    } HOSTSHADOWKCEREG_b;
  } ;

  union {
    __IOM uint32_t HOSTSHADOWKPICVREG;          /*!< This register interface is used to update the KPICV registers
                                                     when the device is in CM or DM mode, The KPICV is updated
                                                     by shifting                                                               */

    struct {
      __IOM uint32_t HOSTSHADOWKPICVREG : 1;    /*!< This field is used to update the KPICV registers when the device
                                                     is in CM or DM mode, The KPICV is updated by shifting                     */
            uint32_t            : 31;
    } HOSTSHADOWKPICVREG_b;
  } ;

  union {
    __IOM uint32_t HOSTSHADOWKCEICVREG;         /*!< This register interface is used to update the KCEICV registers
                                                     when the device is in CM or DM mode, The KCEICV is updated
                                                     by shifting                                                               */

    struct {
      __IOM uint32_t HOSTSHADOWKCEICVREG : 1;   /*!< This field is used to update the KCEICV registers when the device
                                                     is in CM or DM mode, The KCEICV is updated by shifting                    */
            uint32_t            : 31;
    } HOSTSHADOWKCEICVREG_b;
  } ;

  union {
    __IOM uint32_t OTPADDRWIDTHDEF;             /*!< OTP_ADDR_WIDTH parameter, that will define the integrated OTP
                                                     address width (address in words). The supported sizes are
                                                     6 (for 2 Kbits),7,8,9,11 (for 64 Kbits). The default value
                                                     in the provided RTL will be 6.Note: This is a special register,
                                                     affected by internal logic. Test result of this register
                                                     is NA.                                                                    */

    struct {
      __IOM uint32_t OTPADDRWIDTHDEF : 4;       /*!< Holds the OTP_ADDR_WIDTH_DEF value.                                       */
            uint32_t            : 28;
    } OTPADDRWIDTHDEF_b;
  } ;
} CRYPTO_Type;                                  /*!< Size = 7984 (0x1f30)                                                      */



/* =========================================================================================================================== */
/* ================                                            DSP                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief DSP Control Interface (DSP)
  */

typedef struct {                                /*!< DSP Structure                                                             */
  __IM  uint32_t  RESERVED[16];

  union {
    __IOM uint32_t MUTEX0;                      /*!< MUTEX 0                                                                   */

    struct {
      __IOM uint32_t MUTEX0     : 3;            /*!< Mutex Value (000=resource free, 001=CPU owns mutex, 010=DSP0
                                                     owns mutex, 100=DSP1 owns mutex)                                          */
            uint32_t            : 29;
    } MUTEX0_b;
  } ;

  union {
    __IOM uint32_t MUTEX1;                      /*!< MUTEX 1                                                                   */

    struct {
      __IOM uint32_t MUTEX1     : 3;            /*!< Mutex Value (000=resource free, 001=CPU owns mutex, 010=DSP0
                                                     owns mutex, 100=DSP1 owns mutex)                                          */
            uint32_t            : 29;
    } MUTEX1_b;
  } ;

  union {
    __IOM uint32_t MUTEX2;                      /*!< MUTEX 2                                                                   */

    struct {
      __IOM uint32_t MUTEX2     : 3;            /*!< Mutex Value (000=resource free, 001=CPU owns mutex, 010=DSP0
                                                     owns mutex, 100=DSP1 owns mutex)                                          */
            uint32_t            : 29;
    } MUTEX2_b;
  } ;

  union {
    __IOM uint32_t MUTEX3;                      /*!< MUTEX 3                                                                   */

    struct {
      __IOM uint32_t MUTEX3     : 3;            /*!< Mutex Value (000=resource free, 001=CPU owns mutex, 010=DSP0
                                                     owns mutex, 100=DSP1 owns mutex)                                          */
            uint32_t            : 29;
    } MUTEX3_b;
  } ;

  union {
    __IOM uint32_t MUTEX4;                      /*!< MUTEX 4                                                                   */

