AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4l_generic.h
    struct {
      __IOM uint32_t DSP1RESETVEC : 32;         /*!< DSP 1 Reset Vector Address.                                               */
    } DSP1RESETVEC_b;
  } ;

  union {
    __IOM uint32_t DSP1IRQMASK;                 /*!< DSP 1 IRQ Mask                                                            */

    struct {
      __IOM uint32_t DSP1IRQMASK : 23;          /*!< DSP 1 IRQ Mask                                                            */
            uint32_t            : 9;
    } DSP1IRQMASK_b;
  } ;

  union {
    __IOM uint32_t DSP1WAKEMASK;                /*!< DSP 1 IRQ Wake Mask                                                       */

    struct {
      __IOM uint32_t DSP1WAKEMASK : 23;         /*!< DSP 1 IRQ Wake Mask                                                       */
            uint32_t            : 9;
    } DSP1WAKEMASK_b;
  } ;

  union {
    __IOM uint32_t DSP1RAWIRQSTAT31to0;         /*!< DSP 1 Raw IRQ31-0 Status                                                  */

    struct {
      __IOM uint32_t DSP1RAWIRQSTAT31to0 : 32;  /*!< DSP 1 Raw IRQ31-0 Status                                                  */
    } DSP1RAWIRQSTAT31to0_b;
  } ;

  union {
    __IOM uint32_t DSP1RAWIRQSTAT63to32;        /*!< DSP 1 Raw IRQ63-32 Status                                                 */

    struct {
      __IOM uint32_t DSP1RAWIRQSTAT63to32 : 32; /*!< DSP 1 Raw IRQ63-32 Status                                                 */
    } DSP1RAWIRQSTAT63to32_b;
  } ;

  union {
    __IOM uint32_t DSP1RAWIRQSTAT95to64;        /*!< DSP 1 Raw IRQ95-64 Status                                                 */

    struct {
      __IOM uint32_t DSP1RAWIRQSTAT95to64 : 32; /*!< DSP 1 Raw IRQ95-64 Status                                                 */
    } DSP1RAWIRQSTAT95to64_b;
  } ;
  __IM  uint32_t  RESERVED10;

  union {
    __IOM uint32_t DSP1L2LVLINT;                /*!< DSP 1 L2 Level Interrupt Mux                                              */

    struct {
      __IOM uint32_t DSP1L2LVLINT : 19;         /*!< DSP 1 L2 Level Interrupt Mux                                              */
            uint32_t            : 13;
    } DSP1L2LVLINT_b;
  } ;

  union {
    __IOM uint32_t DSP1L3LVLINT;                /*!< DSP 1 L3 Level Interrupt Mux                                              */

    struct {
      __IOM uint32_t DSP1L3LVLINT : 19;         /*!< DSP 1 L3 Level Interrupt Mux                                              */
            uint32_t            : 13;
    } DSP1L3LVLINT_b;
  } ;

  union {
    __IOM uint32_t DSP1L4LVLINT;                /*!< DSP 1 L4 Level Interrupt Mux                                              */

    struct {
      __IOM uint32_t DSP1L4LVLINT : 19;         /*!< DSP 1 L4 Level Interrupt Mux                                              */
            uint32_t            : 13;
    } DSP1L4LVLINT_b;
  } ;

  union {
    __IOM uint32_t DSP1L5LVLINT;                /*!< DSP 1 L5 Level Interrupt Mux                                              */

    struct {
      __IOM uint32_t DSP1L5LVLINT : 19;         /*!< DSP 1 L5 Level Interrupt Mux                                              */
            uint32_t            : 13;
    } DSP1L5LVLINT_b;
  } ;

  union {
    __IOM uint32_t DSP1IDMATRIGCTL;             /*!< DSP 1 IDMA Trigger Control and Status                                     */

    struct {
      __IOM uint32_t DSP1IDMATRIGSTAT : 1;      /*!< DSP 1 iDMA Trigger Status                                                 */
            uint32_t            : 3;
      __IOM uint32_t DSP1IDMATRIGPULSE : 1;     /*!< DSP 1 iDMA Trigger Pulse - When written a '1', this will cause
                                                     a single step enable (valid only when IDMATRIG is set to
                                                     SSTEP)                                                                    */
            uint32_t            : 27;
    } DSP1IDMATRIGCTL_b;
  } ;
  __IM  uint32_t  RESERVED11[3];

  union {
    __IOM uint32_t DSP1INTORMASK31TO0A;         /*!< DSP1 Interrupt OR Mask A for IRQ31-0                                      */

    struct {
      __IOM uint32_t DSP1INTMCUIOORMASKA : 32;  /*!< DSP1 MCU IO Interrupt OR Mask A                                           */
    } DSP1INTORMASK31TO0A_b;
  } ;

  union {
    __IOM uint32_t DSP1INTORMASK63TO32A;        /*!< DSP1 Interrupt OR Mask A for IRQ63-32                                     */

    struct {
      __IOM uint32_t DSP1TMRORMASKA : 10;       /*!< DSP1 Timer Interrupt OR Mask A                                            */
            uint32_t            : 2;
      __IOM uint32_t DSP1I2SORMASKA : 4;        /*!< DSP1 I2S Interrupt OR Mask A                                              */
      __IOM uint32_t DSP1PDMORMASKA : 4;        /*!< DSP1 PDM Interrupt OR Mask A                                              */
            uint32_t            : 4;
      __IOM uint32_t DSP1GPIOORMASKA : 6;       /*!< DSP1 GPIO Interrupt OR Mask A                                             */
            uint32_t            : 2;
    } DSP1INTORMASK63TO32A_b;
  } ;

  union {
    __IOM uint32_t DSP1INTORMASK95TO64A;        /*!< DSP1 Interrupt OR Mask A for IRQ95-64                                     */

    struct {
      __IOM uint32_t DSP1MBINTORMASKA : 32;     /*!< DSP1 Mailbox Interrupt OR Mask A                                          */
    } DSP1INTORMASK95TO64A_b;
  } ;
  __IM  uint32_t  RESERVED12;

  union {
    __IOM uint32_t DSP1INTORMASK31to0B;         /*!< DSP1 Interrupt OR Mask B for IRQ31-0                                      */

    struct {
      __IOM uint32_t DSP1INTMCUIOORMASKB : 32;  /*!< DSP1 MCU IO Interrupt OR Mask B                                           */
    } DSP1INTORMASK31to0B_b;
  } ;

  union {
    __IOM uint32_t DSP1INTORMASK63TO32B;        /*!< DSP1 Interrupt OR Mask A for IRQ63-32                                     */

