AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4l_generic.h
    struct {
      __IOM uint32_t DSP1TMRORMASKB : 10;       /*!< DSP1 Timer Interrupt OR Mask B                                            */
            uint32_t            : 2;
      __IOM uint32_t DSP1I2SORMASKB : 4;        /*!< DSP1 I2S Interrupt OR Mask B                                              */
      __IOM uint32_t DSP1PDMORMASKB : 4;        /*!< DSP1 PDM Interrupt OR Mask B                                              */
            uint32_t            : 4;
      __IOM uint32_t DSP1GPIOORMASKB : 6;       /*!< DSP1 GPIO Interrupt OR Mask B                                             */
            uint32_t            : 2;
    } DSP1INTORMASK63TO32B_b;
  } ;

  union {
    __IOM uint32_t DSP1INTORMASK95TO64B;        /*!< DSP1 Interrupt OR Mask B for IRQ95-64                                     */

    struct {
      __IOM uint32_t DSP1MBINTORMASKB : 32;     /*!< DSP1 Mailbox Interrupt OR Mask B                                          */
    } DSP1INTORMASK95TO64B_b;
  } ;
  __IM  uint32_t  RESERVED13;

  union {
    __IOM uint32_t DSP1INTENIRQ31TO0;           /*!< DSP1 INT Enable for IRQ31-0                                               */

    struct {
      __IOM uint32_t DSP1INTENIRQ31TO0 : 32;    /*!< DSP1 INT Enable for IRQ31-0                                               */
    } DSP1INTENIRQ31TO0_b;
  } ;

  union {
    __IOM uint32_t DSP1INTENIRQ63TO32;          /*!< DSP1 INT Enable for IRQ63-32                                              */

    struct {
      __IOM uint32_t DSP1INTENIRQ63TO32 : 32;   /*!< DSP1 INT Enable for IRQ63-32                                              */
    } DSP1INTENIRQ63TO32_b;
  } ;

  union {
    __IOM uint32_t DSP1INTENIRQ95TO64;          /*!< DSP1 INT Enable for IRQ95-64                                              */

    struct {
      __IOM uint32_t DSP1INTENIRQ95TO64 : 32;   /*!< DSP1 INT Enable for IRQ95-64                                              */
    } DSP1INTENIRQ95TO64_b;
  } ;
} DSP_Type;                                     /*!< Size = 620 (0x26c)                                                        */



/* =========================================================================================================================== */
/* ================                                           FPIO                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Fast PIO access (FPIO)
  */

typedef struct {                                /*!< FPIO Structure                                                            */

  union {
    __IOM uint32_t RD0;                         /*!< GPIO Input 0 (31-0)                                                       */

    struct {
      __IOM uint32_t RD0        : 32;           /*!< GPIO31-0 Reads pin state - read only. Returns the pad pin state
                                                     for pins 0-31 if the PINCFG's input enable (INPEN) is active
                                                     and RDZERO is inactive.                                                   */
    } RD0_b;
  } ;

  union {
    __IOM uint32_t RD1;                         /*!< GPIO Input 1 (63-32)                                                      */

    struct {
      __IOM uint32_t RD1        : 32;           /*!< GPIO63-32 Reads pin state - read only. Returns the pad pin state
                                                     for pins 0-31 if the PINCFG's input enable (INPEN) is active
                                                     and RDZERO is inactive.                                                   */
    } RD1_b;
  } ;

  union {
    __IOM uint32_t RD2;                         /*!< GPIO Input 2 (95-64)                                                      */

    struct {
      __IOM uint32_t RD2        : 32;           /*!< GPIO95-64 Reads pin state - read only. Returns the pad pin state
                                                     for pins 0-31 if the PINCFG's input enable (INPEN) is active
                                                     and RDZERO is inactive.                                                   */
    } RD2_b;
  } ;

  union {
    __IOM uint32_t RD3;                         /*!< GPIO Input 3 (127-96)                                                     */

    struct {
      __IOM uint32_t RD3        : 32;           /*!< GPIO127-96 Reads pin state - read only. Returns the pad pin
                                                     state for pins 0-31 if the PINCFG's input enable (INPEN)
                                                     is active and RDZERO is inactive.                                         */
    } RD3_b;
  } ;

  union {
    __IOM uint32_t WT0;                         /*!< GPIO Output 0 (31-0)                                                      */

    struct {
      __IOM uint32_t WT0        : 32;           /*!< GPIO31-0 Reads or writes pin state. Writes of 1 bits set output
                                                     pad signal if the GPIO is enabled for output. Reads return
                                                     status, including sets/clears through the WTS and WTC registers.          */
    } WT0_b;
  } ;

  union {
    __IOM uint32_t WT1;                         /*!< GPIO Output 1 (63-32)                                                     */

    struct {
      __IOM uint32_t WT1        : 32;           /*!< GPIO63-32 Reads or writes pin state. Writes of 1 bits set output
                                                     pad signal if the GPIO is enabled for output. Reads return
                                                     status, including sets/clears through the WTS and WTC registers.          */
    } WT1_b;
  } ;

  union {
    __IOM uint32_t WT2;                         /*!< GPIO Output 2 (95-64)                                                     */

