AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4l_generic.h
    struct {
      __IOM uint32_t FNCSEL5    : 4;            /*!< Function select for GPIO pin 5                                            */
      __IOM uint32_t INPEN5     : 1;            /*!< Input enable for GPIO 5                                                   */
      __IOM uint32_t RDZERO5    : 1;            /*!< Return 0 for read data on GPIO 5                                          */
      __IOM uint32_t IRPTEN5    : 2;            /*!< Interrupt enable for GPIO 5                                               */
      __IOM uint32_t OUTCFG5    : 2;            /*!< Pin IO mode selection for GPIO pin 5                                      */
      __IOM uint32_t DS5        : 2;            /*!< Drive strength selection for GPIO 5                                       */
      __IOM uint32_t SR5        : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG5   : 3;            /*!< Pullup/Pulldown configuration for GPIO 5                                  */
      __IOM uint32_t NCESRC5    : 6;            /*!< IOMSTR/MSPI N Chip Select 5, DISP control signals DE, CSX, and
                                                     CS. Polarity is determined by CE_POLARITY field                           */
      __IOM uint32_t NCEPOL5    : 1;            /*!< Polarity select for NCE for GPIO 5                                        */
            uint32_t            : 3;
      __IOM uint32_t FIEN5      : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN5      : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG5_b;
  } ;

  union {
    __IOM uint32_t PINCFG6;                     /*!< Controls the operation of GPIO pin 6.                                     */

    struct {
      __IOM uint32_t FNCSEL6    : 4;            /*!< Function select for GPIO pin 6                                            */
      __IOM uint32_t INPEN6     : 1;            /*!< Input enable for GPIO 6                                                   */
      __IOM uint32_t RDZERO6    : 1;            /*!< Return 0 for read data on GPIO 6                                          */
      __IOM uint32_t IRPTEN6    : 2;            /*!< Interrupt enable for GPIO 6                                               */
      __IOM uint32_t OUTCFG6    : 2;            /*!< Pin IO mode selection for GPIO pin 6                                      */
      __IOM uint32_t DS6        : 2;            /*!< Drive strength selection for GPIO 6                                       */
      __IOM uint32_t SR6        : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG6   : 3;            /*!< Pullup/Pulldown configuration for GPIO 6                                  */
      __IOM uint32_t NCESRC6    : 6;            /*!< IOMSTR/MSPI N Chip Select 6, DISP control signals DE, CSX, and
                                                     CS. Polarity is determined by CE_POLARITY field                           */
      __IOM uint32_t NCEPOL6    : 1;            /*!< Polarity select for NCE for GPIO 6                                        */
            uint32_t            : 3;
      __IOM uint32_t FIEN6      : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN6      : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG6_b;
  } ;

  union {
    __IOM uint32_t PINCFG7;                     /*!< Controls the operation of GPIO pin 7.                                     */

    struct {
      __IOM uint32_t FNCSEL7    : 4;            /*!< Function select for GPIO pin 7                                            */
      __IOM uint32_t INPEN7     : 1;            /*!< Input enable for GPIO 7                                                   */
      __IOM uint32_t RDZERO7    : 1;            /*!< Return 0 for read data on GPIO 7                                          */
      __IOM uint32_t IRPTEN7    : 2;            /*!< Interrupt enable for GPIO 7                                               */
      __IOM uint32_t OUTCFG7    : 2;            /*!< Pin IO mode selection for GPIO pin 7                                      */
      __IOM uint32_t DS7        : 2;            /*!< Drive strength selection for GPIO 7                                       */
      __IOM uint32_t SR7        : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG7   : 3;            /*!< Pullup/Pulldown configuration for GPIO 7                                  */
      __IOM uint32_t NCESRC7    : 6;            /*!< IOMSTR/MSPI N Chip Select 7, DISP control signals DE, CSX, and
                                                     CS. Polarity is determined by CE_POLARITY field                           */
      __IOM uint32_t NCEPOL7    : 1;            /*!< Polarity select for NCE for GPIO 7                                        */
            uint32_t            : 3;
      __IOM uint32_t FIEN7      : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN7      : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG7_b;
  } ;

  union {
    __IOM uint32_t PINCFG8;                     /*!< Controls the operation of GPIO pin 8.                                     */

