AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4l_generic.h
    struct {
      __IOM uint32_t FNCSEL11   : 4;            /*!< Function select for GPIO pin 11                                           */
      __IOM uint32_t INPEN11    : 1;            /*!< Input enable for GPIO 11                                                  */
      __IOM uint32_t RDZERO11   : 1;            /*!< Return 0 for read data on GPIO 11                                         */
      __IOM uint32_t IRPTEN11   : 2;            /*!< Interrupt enable for GPIO 11                                              */
      __IOM uint32_t OUTCFG11   : 2;            /*!< Pin IO mode selection for GPIO pin 11                                     */
      __IOM uint32_t DS11       : 2;            /*!< Drive strength selection for GPIO 11                                      */
      __IOM uint32_t SR11       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG11  : 3;            /*!< Pullup/Pulldown configuration for GPIO 11                                 */
      __IOM uint32_t NCESRC11   : 6;            /*!< IOMSTR/MSPI N Chip Select 11, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL11   : 1;            /*!< Polarity select for NCE for GPIO 11                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN11     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN11     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG11_b;
  } ;

  union {
    __IOM uint32_t PINCFG12;                    /*!< Controls the operation of GPIO pin 12.                                    */

    struct {
      __IOM uint32_t FNCSEL12   : 4;            /*!< Function select for GPIO pin 12                                           */
      __IOM uint32_t INPEN12    : 1;            /*!< Input enable for GPIO 12                                                  */
      __IOM uint32_t RDZERO12   : 1;            /*!< Return 0 for read data on GPIO 12                                         */
      __IOM uint32_t IRPTEN12   : 2;            /*!< Interrupt enable for GPIO 12                                              */
      __IOM uint32_t OUTCFG12   : 2;            /*!< Pin IO mode selection for GPIO pin 12                                     */
      __IOM uint32_t DS12       : 2;            /*!< Drive strength selection for GPIO 12                                      */
      __IOM uint32_t SR12       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG12  : 3;            /*!< Pullup/Pulldown configuration for GPIO 12                                 */
      __IOM uint32_t NCESRC12   : 6;            /*!< IOMSTR/MSPI N Chip Select 12, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL12   : 1;            /*!< Polarity select for NCE for GPIO 12                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN12     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN12     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG12_b;
  } ;

  union {
    __IOM uint32_t PINCFG13;                    /*!< Controls the operation of GPIO pin 13.                                    */

    struct {
      __IOM uint32_t FNCSEL13   : 4;            /*!< Function select for GPIO pin 13                                           */
      __IOM uint32_t INPEN13    : 1;            /*!< Input enable for GPIO 13                                                  */
      __IOM uint32_t RDZERO13   : 1;            /*!< Return 0 for read data on GPIO 13                                         */
      __IOM uint32_t IRPTEN13   : 2;            /*!< Interrupt enable for GPIO 13                                              */
      __IOM uint32_t OUTCFG13   : 2;            /*!< Pin IO mode selection for GPIO pin 13                                     */
      __IOM uint32_t DS13       : 2;            /*!< Drive strength selection for GPIO 13                                      */
      __IOM uint32_t SR13       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG13  : 3;            /*!< Pullup/Pulldown configuration for GPIO 13                                 */
      __IOM uint32_t NCESRC13   : 6;            /*!< IOMSTR/MSPI N Chip Select 13, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL13   : 1;            /*!< Polarity select for NCE for GPIO 13                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN13     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN13     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG13_b;
  } ;

  union {
    __IOM uint32_t PINCFG14;                    /*!< Controls the operation of GPIO pin 14.                                    */

