AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4l_generic.h
    struct {
      __IOM uint32_t FNCSEL14   : 4;            /*!< Function select for GPIO pin 14                                           */
      __IOM uint32_t INPEN14    : 1;            /*!< Input enable for GPIO 14                                                  */
      __IOM uint32_t RDZERO14   : 1;            /*!< Return 0 for read data on GPIO 14                                         */
      __IOM uint32_t IRPTEN14   : 2;            /*!< Interrupt enable for GPIO 14                                              */
      __IOM uint32_t OUTCFG14   : 2;            /*!< Pin IO mode selection for GPIO pin 14                                     */
      __IOM uint32_t DS14       : 2;            /*!< Drive strength selection for GPIO 14                                      */
      __IOM uint32_t SR14       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG14  : 3;            /*!< Pullup/Pulldown configuration for GPIO 14                                 */
      __IOM uint32_t NCESRC14   : 6;            /*!< IOMSTR/MSPI N Chip Select 14, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL14   : 1;            /*!< Polarity select for NCE for GPIO 14                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN14     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN14     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG14_b;
  } ;

  union {
    __IOM uint32_t PINCFG15;                    /*!< Controls the operation of GPIO pin 15.                                    */

    struct {
      __IOM uint32_t FNCSEL15   : 4;            /*!< Function select for GPIO pin 15                                           */
      __IOM uint32_t INPEN15    : 1;            /*!< Input enable for GPIO 15                                                  */
      __IOM uint32_t RDZERO15   : 1;            /*!< Return 0 for read data on GPIO 15                                         */
      __IOM uint32_t IRPTEN15   : 2;            /*!< Interrupt enable for GPIO 15                                              */
      __IOM uint32_t OUTCFG15   : 2;            /*!< Pin IO mode selection for GPIO pin 15                                     */
      __IOM uint32_t DS15       : 2;            /*!< Drive strength selection for GPIO 15                                      */
      __IOM uint32_t SR15       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG15  : 3;            /*!< Pullup/Pulldown configuration for GPIO 15                                 */
      __IOM uint32_t NCESRC15   : 6;            /*!< IOMSTR/MSPI N Chip Select 15, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL15   : 1;            /*!< Polarity select for NCE for GPIO 15                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN15     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN15     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG15_b;
  } ;

  union {
    __IOM uint32_t PINCFG16;                    /*!< Controls the operation of GPIO pin 16.                                    */

    struct {
      __IOM uint32_t FNCSEL16   : 4;            /*!< Function select for GPIO pin 16                                           */
      __IOM uint32_t INPEN16    : 1;            /*!< Input enable for GPIO 16                                                  */
      __IOM uint32_t RDZERO16   : 1;            /*!< Return 0 for read data on GPIO 16                                         */
      __IOM uint32_t IRPTEN16   : 2;            /*!< Interrupt enable for GPIO 16                                              */
      __IOM uint32_t OUTCFG16   : 2;            /*!< Pin IO mode selection for GPIO pin 16                                     */
      __IOM uint32_t DS16       : 2;            /*!< Drive strength selection for GPIO 16                                      */
      __IOM uint32_t SR16       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG16  : 3;            /*!< Pullup/Pulldown configuration for GPIO 16                                 */
      __IOM uint32_t NCESRC16   : 6;            /*!< IOMSTR/MSPI N Chip Select 16, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL16   : 1;            /*!< Polarity select for NCE for GPIO 16                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN16     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN16     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG16_b;
  } ;

  union {
    __IOM uint32_t PINCFG17;                    /*!< Controls the operation of GPIO pin 17.                                    */

