AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4l_generic.h
    struct {
      __IOM uint32_t FNCSEL20   : 4;            /*!< Function select for GPIO pin 20                                           */
      __IOM uint32_t INPEN20    : 1;            /*!< Input enable for GPIO 20                                                  */
      __IOM uint32_t RDZERO20   : 1;            /*!< Return 0 for read data on GPIO 20                                         */
      __IOM uint32_t IRPTEN20   : 2;            /*!< Interrupt enable for GPIO 20                                              */
      __IOM uint32_t OUTCFG20   : 2;            /*!< Pin IO mode selection for GPIO pin 20                                     */
      __IOM uint32_t DS20       : 2;            /*!< Drive strength selection for GPIO 20                                      */
      __IOM uint32_t SR20       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG20  : 3;            /*!< Pullup/Pulldown configuration for GPIO 20                                 */
      __IOM uint32_t NCESRC20   : 6;            /*!< IOMSTR/MSPI N Chip Select 20, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL20   : 1;            /*!< Polarity select for NCE for GPIO 20                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN20     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN20     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG20_b;
  } ;

  union {
    __IOM uint32_t PINCFG21;                    /*!< Controls the operation of GPIO pin 21.                                    */

    struct {
      __IOM uint32_t FNCSEL21   : 4;            /*!< Function select for GPIO pin 21                                           */
      __IOM uint32_t INPEN21    : 1;            /*!< Input enable for GPIO 21                                                  */
      __IOM uint32_t RDZERO21   : 1;            /*!< Return 0 for read data on GPIO 21                                         */
      __IOM uint32_t IRPTEN21   : 2;            /*!< Interrupt enable for GPIO 21                                              */
      __IOM uint32_t OUTCFG21   : 2;            /*!< Pin IO mode selection for GPIO pin 21                                     */
      __IOM uint32_t DS21       : 2;            /*!< Drive strength selection for GPIO 21                                      */
      __IOM uint32_t SR21       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG21  : 3;            /*!< Pullup/Pulldown configuration for GPIO 21                                 */
      __IOM uint32_t NCESRC21   : 6;            /*!< IOMSTR/MSPI N Chip Select 21, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL21   : 1;            /*!< Polarity select for NCE for GPIO 21                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN21     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN21     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG21_b;
  } ;

  union {
    __IOM uint32_t PINCFG22;                    /*!< Controls the operation of GPIO pin 22.                                    */

    struct {
      __IOM uint32_t FNCSEL22   : 4;            /*!< Function select for GPIO pin 22                                           */
      __IOM uint32_t INPEN22    : 1;            /*!< Input enable for GPIO 22                                                  */
      __IOM uint32_t RDZERO22   : 1;            /*!< Return 0 for read data on GPIO 22                                         */
      __IOM uint32_t IRPTEN22   : 2;            /*!< Interrupt enable for GPIO 22                                              */
      __IOM uint32_t OUTCFG22   : 2;            /*!< Pin IO mode selection for GPIO pin 22                                     */
      __IOM uint32_t DS22       : 2;            /*!< Drive strength selection for GPIO 22                                      */
      __IOM uint32_t SR22       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG22  : 3;            /*!< Pullup/Pulldown configuration for GPIO 22                                 */
      __IOM uint32_t NCESRC22   : 6;            /*!< IOMSTR/MSPI N Chip Select 22, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL22   : 1;            /*!< Polarity select for NCE for GPIO 22                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN22     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN22     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG22_b;
  } ;

  union {
    __IOM uint32_t PINCFG23;                    /*!< Controls the operation of GPIO pin 23.                                    */

