AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4l_generic.h
    struct {
      __IOM uint32_t FNCSEL29   : 4;            /*!< Function select for GPIO pin 29                                           */
      __IOM uint32_t INPEN29    : 1;            /*!< Input enable for GPIO 29                                                  */
      __IOM uint32_t RDZERO29   : 1;            /*!< Return 0 for read data on GPIO 29                                         */
      __IOM uint32_t IRPTEN29   : 2;            /*!< Interrupt enable for GPIO 29                                              */
      __IOM uint32_t OUTCFG29   : 2;            /*!< Pin IO mode selection for GPIO pin 29                                     */
      __IOM uint32_t DS29       : 2;            /*!< Drive strength selection for GPIO 29                                      */
      __IOM uint32_t SR29       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG29  : 3;            /*!< Pullup/Pulldown configuration for GPIO 29                                 */
      __IOM uint32_t NCESRC29   : 6;            /*!< IOMSTR/MSPI N Chip Select 29, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL29   : 1;            /*!< Polarity select for NCE for GPIO 29                                       */
            uint32_t            : 2;
      __IOM uint32_t VSSPWRSWEN29 : 1;          /*!< VSS power switch enable. Enable VSS power switch when driving
                                                     pad signal to 0 for GPIO 29                                               */
      __IOM uint32_t FIEN29     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN29     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG29_b;
  } ;

  union {
    __IOM uint32_t PINCFG30;                    /*!< Controls the operation of GPIO pin 30.                                    */

    struct {
      __IOM uint32_t FNCSEL30   : 4;            /*!< Function select for GPIO pin 30                                           */
      __IOM uint32_t INPEN30    : 1;            /*!< Input enable for GPIO 30                                                  */
      __IOM uint32_t RDZERO30   : 1;            /*!< Return 0 for read data on GPIO 30                                         */
      __IOM uint32_t IRPTEN30   : 2;            /*!< Interrupt enable for GPIO 30                                              */
      __IOM uint32_t OUTCFG30   : 2;            /*!< Pin IO mode selection for GPIO pin 30                                     */
      __IOM uint32_t DS30       : 2;            /*!< Drive strength selection for GPIO 30                                      */
      __IOM uint32_t SR30       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG30  : 3;            /*!< Pullup/Pulldown configuration for GPIO 30                                 */
      __IOM uint32_t NCESRC30   : 6;            /*!< IOMSTR/MSPI N Chip Select 30, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL30   : 1;            /*!< Polarity select for NCE for GPIO 30                                       */
            uint32_t            : 2;
      __IOM uint32_t VDDPWRSWEN30 : 1;          /*!< VDD power switch enable. Enable VDD power switch when driving
                                                     pad signal to 1 for GPIO 30                                               */
      __IOM uint32_t FIEN30     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN30     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG30_b;
  } ;

  union {
    __IOM uint32_t PINCFG31;                    /*!< Controls the operation of GPIO pin 31.                                    */

    struct {
      __IOM uint32_t FNCSEL31   : 4;            /*!< Function select for GPIO pin 31                                           */
      __IOM uint32_t INPEN31    : 1;            /*!< Input enable for GPIO 31                                                  */
      __IOM uint32_t RDZERO31   : 1;            /*!< Return 0 for read data on GPIO 31                                         */
      __IOM uint32_t IRPTEN31   : 2;            /*!< Interrupt enable for GPIO 31                                              */
      __IOM uint32_t OUTCFG31   : 2;            /*!< Pin IO mode selection for GPIO pin 31                                     */
      __IOM uint32_t DS31       : 2;            /*!< Drive strength selection for GPIO 31                                      */
      __IOM uint32_t SR31       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG31  : 3;            /*!< Pullup/Pulldown configuration for GPIO 31                                 */
      __IOM uint32_t NCESRC31   : 6;            /*!< IOMSTR/MSPI N Chip Select 31, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL31   : 1;            /*!< Polarity select for NCE for GPIO 31                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN31     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN31     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG31_b;
  } ;

  union {
    __IOM uint32_t PINCFG32;                    /*!< Controls the operation of GPIO pin 32.                                    */

