AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4l_generic.h
    struct {
      __IOM uint32_t FNCSEL35   : 4;            /*!< Function select for GPIO pin 35                                           */
      __IOM uint32_t INPEN35    : 1;            /*!< Input enable for GPIO 35                                                  */
      __IOM uint32_t RDZERO35   : 1;            /*!< Return 0 for read data on GPIO 35                                         */
      __IOM uint32_t IRPTEN35   : 2;            /*!< Interrupt enable for GPIO 35                                              */
      __IOM uint32_t OUTCFG35   : 2;            /*!< Pin IO mode selection for GPIO pin 35                                     */
      __IOM uint32_t DS35       : 2;            /*!< Drive strength selection for GPIO 35                                      */
      __IOM uint32_t SR35       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG35  : 3;            /*!< Pullup/Pulldown configuration for GPIO 35                                 */
      __IOM uint32_t NCESRC35   : 6;            /*!< IOMSTR/MSPI N Chip Select 35, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL35   : 1;            /*!< Polarity select for NCE for GPIO 35                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN35     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN35     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG35_b;
  } ;

  union {
    __IOM uint32_t PINCFG36;                    /*!< Controls the operation of GPIO pin 36.                                    */

    struct {
      __IOM uint32_t FNCSEL36   : 4;            /*!< Function select for GPIO pin 36                                           */
      __IOM uint32_t INPEN36    : 1;            /*!< Input enable for GPIO 36                                                  */
      __IOM uint32_t RDZERO36   : 1;            /*!< Return 0 for read data on GPIO 36                                         */
      __IOM uint32_t IRPTEN36   : 2;            /*!< Interrupt enable for GPIO 36                                              */
      __IOM uint32_t OUTCFG36   : 2;            /*!< Pin IO mode selection for GPIO pin 36                                     */
      __IOM uint32_t DS36       : 2;            /*!< Drive strength selection for GPIO 36                                      */
      __IOM uint32_t SR36       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG36  : 3;            /*!< Pullup/Pulldown configuration for GPIO 36                                 */
      __IOM uint32_t NCESRC36   : 6;            /*!< IOMSTR/MSPI N Chip Select 36, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL36   : 1;            /*!< Polarity select for NCE for GPIO 36                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN36     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN36     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG36_b;
  } ;

  union {
    __IOM uint32_t PINCFG37;                    /*!< Controls the operation of GPIO pin 37.                                    */

    struct {
      __IOM uint32_t FNCSEL37   : 4;            /*!< Function select for GPIO pin 37                                           */
      __IOM uint32_t INPEN37    : 1;            /*!< Input enable for GPIO 37                                                  */
      __IOM uint32_t RDZERO37   : 1;            /*!< Return 0 for read data on GPIO 37                                         */
      __IOM uint32_t IRPTEN37   : 2;            /*!< Interrupt enable for GPIO 37                                              */
      __IOM uint32_t OUTCFG37   : 2;            /*!< Pin IO mode selection for GPIO pin 37                                     */
      __IOM uint32_t DS37       : 2;            /*!< Drive strength selection for GPIO 37                                      */
      __IOM uint32_t SR37       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG37  : 3;            /*!< Pullup/Pulldown configuration for GPIO 37                                 */
      __IOM uint32_t NCESRC37   : 6;            /*!< IOMSTR/MSPI N Chip Select 37, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL37   : 1;            /*!< Polarity select for NCE for GPIO 37                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN37     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN37     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG37_b;
  } ;

  union {
    __IOM uint32_t PINCFG38;                    /*!< Controls the operation of GPIO pin 38.                                    */

