AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4l_generic.h
    struct {
      __IOM uint32_t FNCSEL38   : 4;            /*!< Function select for GPIO pin 38                                           */
      __IOM uint32_t INPEN38    : 1;            /*!< Input enable for GPIO 38                                                  */
      __IOM uint32_t RDZERO38   : 1;            /*!< Return 0 for read data on GPIO 38                                         */
      __IOM uint32_t IRPTEN38   : 2;            /*!< Interrupt enable for GPIO 38                                              */
      __IOM uint32_t OUTCFG38   : 2;            /*!< Pin IO mode selection for GPIO pin 38                                     */
      __IOM uint32_t DS38       : 2;            /*!< Drive strength selection for GPIO 38                                      */
      __IOM uint32_t SR38       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG38  : 3;            /*!< Pullup/Pulldown configuration for GPIO 38                                 */
      __IOM uint32_t NCESRC38   : 6;            /*!< IOMSTR/MSPI N Chip Select 38, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL38   : 1;            /*!< Polarity select for NCE for GPIO 38                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN38     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN38     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG38_b;
  } ;

  union {
    __IOM uint32_t PINCFG39;                    /*!< Controls the operation of GPIO pin 39.                                    */

    struct {
      __IOM uint32_t FNCSEL39   : 4;            /*!< Function select for GPIO pin 39                                           */
      __IOM uint32_t INPEN39    : 1;            /*!< Input enable for GPIO 39                                                  */
      __IOM uint32_t RDZERO39   : 1;            /*!< Return 0 for read data on GPIO 39                                         */
      __IOM uint32_t IRPTEN39   : 2;            /*!< Interrupt enable for GPIO 39                                              */
      __IOM uint32_t OUTCFG39   : 2;            /*!< Pin IO mode selection for GPIO pin 39                                     */
      __IOM uint32_t DS39       : 2;            /*!< Drive strength selection for GPIO 39                                      */
      __IOM uint32_t SR39       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG39  : 3;            /*!< Pullup/Pulldown configuration for GPIO 39                                 */
      __IOM uint32_t NCESRC39   : 6;            /*!< IOMSTR/MSPI N Chip Select 39, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL39   : 1;            /*!< Polarity select for NCE for GPIO 39                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN39     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN39     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG39_b;
  } ;

  union {
    __IOM uint32_t PINCFG40;                    /*!< Controls the operation of GPIO pin 40.                                    */

    struct {
      __IOM uint32_t FNCSEL40   : 4;            /*!< Function select for GPIO pin 40                                           */
      __IOM uint32_t INPEN40    : 1;            /*!< Input enable for GPIO 40                                                  */
      __IOM uint32_t RDZERO40   : 1;            /*!< Return 0 for read data on GPIO 40                                         */
      __IOM uint32_t IRPTEN40   : 2;            /*!< Interrupt enable for GPIO 40                                              */
      __IOM uint32_t OUTCFG40   : 2;            /*!< Pin IO mode selection for GPIO pin 40                                     */
      __IOM uint32_t DS40       : 2;            /*!< Drive strength selection for GPIO 40                                      */
      __IOM uint32_t SR40       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG40  : 3;            /*!< Pullup/Pulldown configuration for GPIO 40                                 */
      __IOM uint32_t NCESRC40   : 6;            /*!< IOMSTR/MSPI N Chip Select 40, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL40   : 1;            /*!< Polarity select for NCE for GPIO 40                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN40     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN40     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG40_b;
  } ;

  union {
    __IOM uint32_t PINCFG41;                    /*!< Controls the operation of GPIO pin 41.                                    */

