AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4l_generic.h
    struct {
      __IOM uint32_t FNCSEL44   : 4;            /*!< Function select for GPIO pin 44                                           */
      __IOM uint32_t INPEN44    : 1;            /*!< Input enable for GPIO 44                                                  */
      __IOM uint32_t RDZERO44   : 1;            /*!< Return 0 for read data on GPIO 44                                         */
      __IOM uint32_t IRPTEN44   : 2;            /*!< Interrupt enable for GPIO 44                                              */
      __IOM uint32_t OUTCFG44   : 2;            /*!< Pin IO mode selection for GPIO pin 44                                     */
      __IOM uint32_t DS44       : 2;            /*!< Drive strength selection for GPIO 44                                      */
      __IOM uint32_t SR44       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG44  : 3;            /*!< Pullup/Pulldown configuration for GPIO 44                                 */
      __IOM uint32_t NCESRC44   : 6;            /*!< IOMSTR/MSPI N Chip Select 44, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL44   : 1;            /*!< Polarity select for NCE for GPIO 44                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN44     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN44     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG44_b;
  } ;

  union {
    __IOM uint32_t PINCFG45;                    /*!< Controls the operation of GPIO pin 45.                                    */

    struct {
      __IOM uint32_t FNCSEL45   : 4;            /*!< Function select for GPIO pin 45                                           */
      __IOM uint32_t INPEN45    : 1;            /*!< Input enable for GPIO 45                                                  */
      __IOM uint32_t RDZERO45   : 1;            /*!< Return 0 for read data on GPIO 45                                         */
      __IOM uint32_t IRPTEN45   : 2;            /*!< Interrupt enable for GPIO 45                                              */
      __IOM uint32_t OUTCFG45   : 2;            /*!< Pin IO mode selection for GPIO pin 45                                     */
      __IOM uint32_t DS45       : 2;            /*!< Drive strength selection for GPIO 45                                      */
      __IOM uint32_t SR45       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG45  : 3;            /*!< Pullup/Pulldown configuration for GPIO 45                                 */
      __IOM uint32_t NCESRC45   : 6;            /*!< IOMSTR/MSPI N Chip Select 45, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL45   : 1;            /*!< Polarity select for NCE for GPIO 45                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN45     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN45     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG45_b;
  } ;

  union {
    __IOM uint32_t PINCFG46;                    /*!< Controls the operation of GPIO pin 46.                                    */

    struct {
      __IOM uint32_t FNCSEL46   : 4;            /*!< Function select for GPIO pin 46                                           */
      __IOM uint32_t INPEN46    : 1;            /*!< Input enable for GPIO 46                                                  */
      __IOM uint32_t RDZERO46   : 1;            /*!< Return 0 for read data on GPIO 46                                         */
      __IOM uint32_t IRPTEN46   : 2;            /*!< Interrupt enable for GPIO 46                                              */
      __IOM uint32_t OUTCFG46   : 2;            /*!< Pin IO mode selection for GPIO pin 46                                     */
      __IOM uint32_t DS46       : 2;            /*!< Drive strength selection for GPIO 46                                      */
      __IOM uint32_t SR46       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG46  : 3;            /*!< Pullup/Pulldown configuration for GPIO 46                                 */
      __IOM uint32_t NCESRC46   : 6;            /*!< IOMSTR/MSPI N Chip Select 46, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL46   : 1;            /*!< Polarity select for NCE for GPIO 46                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN46     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN46     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG46_b;
  } ;

  union {
    __IOM uint32_t PINCFG47;                    /*!< Controls the operation of GPIO pin 47.                                    */

