AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4l_generic.h
    struct {
      __IOM uint32_t FNCSEL50   : 4;            /*!< Function select for GPIO pin 50                                           */
      __IOM uint32_t INPEN50    : 1;            /*!< Input enable for GPIO 50                                                  */
      __IOM uint32_t RDZERO50   : 1;            /*!< Return 0 for read data on GPIO 50                                         */
      __IOM uint32_t IRPTEN50   : 2;            /*!< Interrupt enable for GPIO 50                                              */
      __IOM uint32_t OUTCFG50   : 2;            /*!< Pin IO mode selection for GPIO pin 50                                     */
      __IOM uint32_t DS50       : 2;            /*!< Drive strength selection for GPIO 50                                      */
      __IOM uint32_t SR50       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG50  : 3;            /*!< Pullup/Pulldown configuration for GPIO 50                                 */
      __IOM uint32_t NCESRC50   : 6;            /*!< IOMSTR/MSPI N Chip Select 50, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL50   : 1;            /*!< Polarity select for NCE for GPIO 50                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN50     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN50     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG50_b;
  } ;

  union {
    __IOM uint32_t PINCFG51;                    /*!< Controls the operation of GPIO pin 51.                                    */

    struct {
      __IOM uint32_t FNCSEL51   : 4;            /*!< Function select for GPIO pin 51                                           */
      __IOM uint32_t INPEN51    : 1;            /*!< Input enable for GPIO 51                                                  */
      __IOM uint32_t RDZERO51   : 1;            /*!< Return 0 for read data on GPIO 51                                         */
      __IOM uint32_t IRPTEN51   : 2;            /*!< Interrupt enable for GPIO 51                                              */
      __IOM uint32_t OUTCFG51   : 2;            /*!< Pin IO mode selection for GPIO pin 51                                     */
      __IOM uint32_t DS51       : 2;            /*!< Drive strength selection for GPIO 51                                      */
      __IOM uint32_t SR51       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG51  : 3;            /*!< Pullup/Pulldown configuration for GPIO 51                                 */
      __IOM uint32_t NCESRC51   : 6;            /*!< IOMSTR/MSPI N Chip Select 51, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL51   : 1;            /*!< Polarity select for NCE for GPIO 51                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN51     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN51     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG51_b;
  } ;

  union {
    __IOM uint32_t PINCFG52;                    /*!< Controls the operation of GPIO pin 52.                                    */

    struct {
      __IOM uint32_t FNCSEL52   : 4;            /*!< Function select for GPIO pin 52                                           */
      __IOM uint32_t INPEN52    : 1;            /*!< Input enable for GPIO 52                                                  */
      __IOM uint32_t RDZERO52   : 1;            /*!< Return 0 for read data on GPIO 52                                         */
      __IOM uint32_t IRPTEN52   : 2;            /*!< Interrupt enable for GPIO 52                                              */
      __IOM uint32_t OUTCFG52   : 2;            /*!< Pin IO mode selection for GPIO pin 52                                     */
      __IOM uint32_t DS52       : 2;            /*!< Drive strength selection for GPIO 52                                      */
      __IOM uint32_t SR52       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG52  : 3;            /*!< Pullup/Pulldown configuration for GPIO 52                                 */
      __IOM uint32_t NCESRC52   : 6;            /*!< IOMSTR/MSPI N Chip Select 52, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL52   : 1;            /*!< Polarity select for NCE for GPIO 52                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN52     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN52     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG52_b;
  } ;

  union {
    __IOM uint32_t PINCFG53;                    /*!< Controls the operation of GPIO pin 53.                                    */

