AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4l_generic.h
    struct {
      __IOM uint32_t FNCSEL59   : 4;            /*!< Function select for GPIO pin 59                                           */
      __IOM uint32_t INPEN59    : 1;            /*!< Input enable for GPIO 59                                                  */
      __IOM uint32_t RDZERO59   : 1;            /*!< Return 0 for read data on GPIO 59                                         */
      __IOM uint32_t IRPTEN59   : 2;            /*!< Interrupt enable for GPIO 59                                              */
      __IOM uint32_t OUTCFG59   : 2;            /*!< Pin IO mode selection for GPIO pin 59                                     */
      __IOM uint32_t DS59       : 2;            /*!< Drive strength selection for GPIO 59                                      */
      __IOM uint32_t SR59       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG59  : 3;            /*!< Pullup/Pulldown configuration for GPIO 59                                 */
      __IOM uint32_t NCESRC59   : 6;            /*!< IOMSTR/MSPI N Chip Select 59, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL59   : 1;            /*!< Polarity select for NCE for GPIO 59                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN59     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN59     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG59_b;
  } ;

  union {
    __IOM uint32_t PINCFG60;                    /*!< Controls the operation of GPIO pin 60.                                    */

    struct {
      __IOM uint32_t FNCSEL60   : 4;            /*!< Function select for GPIO pin 60                                           */
      __IOM uint32_t INPEN60    : 1;            /*!< Input enable for GPIO 60                                                  */
      __IOM uint32_t RDZERO60   : 1;            /*!< Return 0 for read data on GPIO 60                                         */
      __IOM uint32_t IRPTEN60   : 2;            /*!< Interrupt enable for GPIO 60                                              */
      __IOM uint32_t OUTCFG60   : 2;            /*!< Pin IO mode selection for GPIO pin 60                                     */
      __IOM uint32_t DS60       : 2;            /*!< Drive strength selection for GPIO 60                                      */
      __IOM uint32_t SR60       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG60  : 3;            /*!< Pullup/Pulldown configuration for GPIO 60                                 */
      __IOM uint32_t NCESRC60   : 6;            /*!< IOMSTR/MSPI N Chip Select 60, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL60   : 1;            /*!< Polarity select for NCE for GPIO 60                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN60     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN60     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG60_b;
  } ;

  union {
    __IOM uint32_t PINCFG61;                    /*!< Controls the operation of GPIO pin 61.                                    */

    struct {
      __IOM uint32_t FNCSEL61   : 4;            /*!< Function select for GPIO pin 61                                           */
      __IOM uint32_t INPEN61    : 1;            /*!< Input enable for GPIO 61                                                  */
      __IOM uint32_t RDZERO61   : 1;            /*!< Return 0 for read data on GPIO 61                                         */
      __IOM uint32_t IRPTEN61   : 2;            /*!< Interrupt enable for GPIO 61                                              */
      __IOM uint32_t OUTCFG61   : 2;            /*!< Pin IO mode selection for GPIO pin 61                                     */
      __IOM uint32_t DS61       : 2;            /*!< Drive strength selection for GPIO 61                                      */
      __IOM uint32_t SR61       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG61  : 3;            /*!< Pullup/Pulldown configuration for GPIO 61                                 */
      __IOM uint32_t NCESRC61   : 6;            /*!< IOMSTR/MSPI N Chip Select 61, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL61   : 1;            /*!< Polarity select for NCE for GPIO 61                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN61     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN61     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG61_b;
  } ;

  union {
    __IOM uint32_t PINCFG62;                    /*!< Controls the operation of GPIO pin 62.                                    */

