AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4l_generic.h
    struct {
      __IOM uint32_t FNCSEL62   : 4;            /*!< Function select for GPIO pin 62                                           */
      __IOM uint32_t INPEN62    : 1;            /*!< Input enable for GPIO 62                                                  */
      __IOM uint32_t RDZERO62   : 1;            /*!< Return 0 for read data on GPIO 62                                         */
      __IOM uint32_t IRPTEN62   : 2;            /*!< Interrupt enable for GPIO 62                                              */
      __IOM uint32_t OUTCFG62   : 2;            /*!< Pin IO mode selection for GPIO pin 62                                     */
      __IOM uint32_t DS62       : 2;            /*!< Drive strength selection for GPIO 62                                      */
      __IOM uint32_t SR62       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG62  : 3;            /*!< Pullup/Pulldown configuration for GPIO 62                                 */
      __IOM uint32_t NCESRC62   : 6;            /*!< IOMSTR/MSPI N Chip Select 62, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL62   : 1;            /*!< Polarity select for NCE for GPIO 62                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN62     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN62     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG62_b;
  } ;

  union {
    __IOM uint32_t PINCFG63;                    /*!< Controls the operation of GPIO pin 63.                                    */

    struct {
      __IOM uint32_t FNCSEL63   : 4;            /*!< Function select for GPIO pin 63                                           */
      __IOM uint32_t INPEN63    : 1;            /*!< Input enable for GPIO 63                                                  */
      __IOM uint32_t RDZERO63   : 1;            /*!< Return 0 for read data on GPIO 63                                         */
      __IOM uint32_t IRPTEN63   : 2;            /*!< Interrupt enable for GPIO 63                                              */
      __IOM uint32_t OUTCFG63   : 2;            /*!< Pin IO mode selection for GPIO pin 63                                     */
      __IOM uint32_t DS63       : 2;            /*!< Drive strength selection for GPIO 63                                      */
      __IOM uint32_t SR63       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG63  : 3;            /*!< Pullup/Pulldown configuration for GPIO 63                                 */
      __IOM uint32_t NCESRC63   : 6;            /*!< IOMSTR/MSPI N Chip Select 63, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL63   : 1;            /*!< Polarity select for NCE for GPIO 63                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN63     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN63     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG63_b;
  } ;

  union {
    __IOM uint32_t PINCFG64;                    /*!< Controls the operation of GPIO pin 64.                                    */

    struct {
      __IOM uint32_t FNCSEL64   : 4;            /*!< Function select for GPIO pin 64                                           */
      __IOM uint32_t INPEN64    : 1;            /*!< Input enable for GPIO 64                                                  */
      __IOM uint32_t RDZERO64   : 1;            /*!< Return 0 for read data on GPIO 64                                         */
      __IOM uint32_t IRPTEN64   : 2;            /*!< Interrupt enable for GPIO 64                                              */
      __IOM uint32_t OUTCFG64   : 2;            /*!< Pin IO mode selection for GPIO pin 64                                     */
      __IOM uint32_t DS64       : 2;            /*!< Drive strength selection for GPIO 64                                      */
      __IOM uint32_t SR64       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG64  : 3;            /*!< Pullup/Pulldown configuration for GPIO 64                                 */
      __IOM uint32_t NCESRC64   : 6;            /*!< IOMSTR/MSPI N Chip Select 64, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL64   : 1;            /*!< Polarity select for NCE for GPIO 64                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN64     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN64     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG64_b;
  } ;

  union {
    __IOM uint32_t PINCFG65;                    /*!< Controls the operation of GPIO pin 65.                                    */

