AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4l_generic.h
    struct {
      __IOM uint32_t FNCSEL65   : 4;            /*!< Function select for GPIO pin 65                                           */
      __IOM uint32_t INPEN65    : 1;            /*!< Input enable for GPIO 65                                                  */
      __IOM uint32_t RDZERO65   : 1;            /*!< Return 0 for read data on GPIO 65                                         */
      __IOM uint32_t IRPTEN65   : 2;            /*!< Interrupt enable for GPIO 65                                              */
      __IOM uint32_t OUTCFG65   : 2;            /*!< Pin IO mode selection for GPIO pin 65                                     */
      __IOM uint32_t DS65       : 2;            /*!< Drive strength selection for GPIO 65                                      */
      __IOM uint32_t SR65       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG65  : 3;            /*!< Pullup/Pulldown configuration for GPIO 65                                 */
      __IOM uint32_t NCESRC65   : 6;            /*!< IOMSTR/MSPI N Chip Select 65, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL65   : 1;            /*!< Polarity select for NCE for GPIO 65                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN65     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN65     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG65_b;
  } ;

  union {
    __IOM uint32_t PINCFG66;                    /*!< Controls the operation of GPIO pin 66.                                    */

    struct {
      __IOM uint32_t FNCSEL66   : 4;            /*!< Function select for GPIO pin 66                                           */
      __IOM uint32_t INPEN66    : 1;            /*!< Input enable for GPIO 66                                                  */
      __IOM uint32_t RDZERO66   : 1;            /*!< Return 0 for read data on GPIO 66                                         */
      __IOM uint32_t IRPTEN66   : 2;            /*!< Interrupt enable for GPIO 66                                              */
      __IOM uint32_t OUTCFG66   : 2;            /*!< Pin IO mode selection for GPIO pin 66                                     */
      __IOM uint32_t DS66       : 2;            /*!< Drive strength selection for GPIO 66                                      */
      __IOM uint32_t SR66       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG66  : 3;            /*!< Pullup/Pulldown configuration for GPIO 66                                 */
      __IOM uint32_t NCESRC66   : 6;            /*!< IOMSTR/MSPI N Chip Select 66, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL66   : 1;            /*!< Polarity select for NCE for GPIO 66                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN66     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN66     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG66_b;
  } ;

  union {
    __IOM uint32_t PINCFG67;                    /*!< Controls the operation of GPIO pin 67.                                    */

    struct {
      __IOM uint32_t FNCSEL67   : 4;            /*!< Function select for GPIO pin 67                                           */
      __IOM uint32_t INPEN67    : 1;            /*!< Input enable for GPIO 67                                                  */
      __IOM uint32_t RDZERO67   : 1;            /*!< Return 0 for read data on GPIO 67                                         */
      __IOM uint32_t IRPTEN67   : 2;            /*!< Interrupt enable for GPIO 67                                              */
      __IOM uint32_t OUTCFG67   : 2;            /*!< Pin IO mode selection for GPIO pin 67                                     */
      __IOM uint32_t DS67       : 2;            /*!< Drive strength selection for GPIO 67                                      */
      __IOM uint32_t SR67       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG67  : 3;            /*!< Pullup/Pulldown configuration for GPIO 67                                 */
      __IOM uint32_t NCESRC67   : 6;            /*!< IOMSTR/MSPI N Chip Select 67, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL67   : 1;            /*!< Polarity select for NCE for GPIO 67                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN67     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN67     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG67_b;
  } ;

  union {
    __IOM uint32_t PINCFG68;                    /*!< Controls the operation of GPIO pin 68.                                    */

