AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4l_generic.h
    struct {
      __IOM uint32_t FNCSEL71   : 4;            /*!< Function select for GPIO pin 71                                           */
      __IOM uint32_t INPEN71    : 1;            /*!< Input enable for GPIO 71                                                  */
      __IOM uint32_t RDZERO71   : 1;            /*!< Return 0 for read data on GPIO 71                                         */
      __IOM uint32_t IRPTEN71   : 2;            /*!< Interrupt enable for GPIO 71                                              */
      __IOM uint32_t OUTCFG71   : 2;            /*!< Pin IO mode selection for GPIO pin 71                                     */
      __IOM uint32_t DS71       : 2;            /*!< Drive strength selection for GPIO 71                                      */
      __IOM uint32_t SR71       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG71  : 3;            /*!< Pullup/Pulldown configuration for GPIO 71                                 */
      __IOM uint32_t NCESRC71   : 6;            /*!< IOMSTR/MSPI N Chip Select 71, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL71   : 1;            /*!< Polarity select for NCE for GPIO 71                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN71     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN71     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG71_b;
  } ;

  union {
    __IOM uint32_t PINCFG72;                    /*!< Controls the operation of GPIO pin 72.                                    */

    struct {
      __IOM uint32_t FNCSEL72   : 4;            /*!< Function select for GPIO pin 72                                           */
      __IOM uint32_t INPEN72    : 1;            /*!< Input enable for GPIO 72                                                  */
      __IOM uint32_t RDZERO72   : 1;            /*!< Return 0 for read data on GPIO 72                                         */
      __IOM uint32_t IRPTEN72   : 2;            /*!< Interrupt enable for GPIO 72                                              */
      __IOM uint32_t OUTCFG72   : 2;            /*!< Pin IO mode selection for GPIO pin 72                                     */
      __IOM uint32_t DS72       : 2;            /*!< Drive strength selection for GPIO 72                                      */
      __IOM uint32_t SR72       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG72  : 3;            /*!< Pullup/Pulldown configuration for GPIO 72                                 */
      __IOM uint32_t NCESRC72   : 6;            /*!< IOMSTR/MSPI N Chip Select 72, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL72   : 1;            /*!< Polarity select for NCE for GPIO 72                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN72     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN72     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG72_b;
  } ;

  union {
    __IOM uint32_t PINCFG73;                    /*!< Controls the operation of GPIO pin 73.                                    */

    struct {
      __IOM uint32_t FNCSEL73   : 4;            /*!< Function select for GPIO pin 73                                           */
      __IOM uint32_t INPEN73    : 1;            /*!< Input enable for GPIO 73                                                  */
      __IOM uint32_t RDZERO73   : 1;            /*!< Return 0 for read data on GPIO 73                                         */
      __IOM uint32_t IRPTEN73   : 2;            /*!< Interrupt enable for GPIO 73                                              */
      __IOM uint32_t OUTCFG73   : 2;            /*!< Pin IO mode selection for GPIO pin 73                                     */
      __IOM uint32_t DS73       : 2;            /*!< Drive strength selection for GPIO 73                                      */
      __IOM uint32_t SR73       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG73  : 3;            /*!< Pullup/Pulldown configuration for GPIO 73                                 */
      __IOM uint32_t NCESRC73   : 6;            /*!< IOMSTR/MSPI N Chip Select 73, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL73   : 1;            /*!< Polarity select for NCE for GPIO 73                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN73     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN73     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG73_b;
  } ;

  union {
    __IOM uint32_t PINCFG74;                    /*!< Controls the operation of GPIO pin 74.                                    */

