AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4l_generic.h
    struct {
      __IOM uint32_t FNCSEL74   : 4;            /*!< Function select for GPIO pin 74                                           */
      __IOM uint32_t INPEN74    : 1;            /*!< Input enable for GPIO 74                                                  */
      __IOM uint32_t RDZERO74   : 1;            /*!< Return 0 for read data on GPIO 74                                         */
      __IOM uint32_t IRPTEN74   : 2;            /*!< Interrupt enable for GPIO 74                                              */
      __IOM uint32_t OUTCFG74   : 2;            /*!< Pin IO mode selection for GPIO pin 74                                     */
      __IOM uint32_t DS74       : 2;            /*!< Drive strength selection for GPIO 74                                      */
      __IOM uint32_t SR74       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG74  : 3;            /*!< Pullup/Pulldown configuration for GPIO 74                                 */
      __IOM uint32_t NCESRC74   : 6;            /*!< IOMSTR/MSPI N Chip Select 74, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL74   : 1;            /*!< Polarity select for NCE for GPIO 74                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN74     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN74     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG74_b;
  } ;

  union {
    __IOM uint32_t PINCFG75;                    /*!< Controls the operation of GPIO pin 75.                                    */

    struct {
      __IOM uint32_t FNCSEL75   : 4;            /*!< Function select for GPIO pin 75                                           */
      __IOM uint32_t INPEN75    : 1;            /*!< Input enable for GPIO 75                                                  */
      __IOM uint32_t RDZERO75   : 1;            /*!< Return 0 for read data on GPIO 75                                         */
      __IOM uint32_t IRPTEN75   : 2;            /*!< Interrupt enable for GPIO 75                                              */
      __IOM uint32_t OUTCFG75   : 2;            /*!< Pin IO mode selection for GPIO pin 75                                     */
      __IOM uint32_t DS75       : 2;            /*!< Drive strength selection for GPIO 75                                      */
      __IOM uint32_t SR75       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG75  : 3;            /*!< Pullup/Pulldown configuration for GPIO 75                                 */
      __IOM uint32_t NCESRC75   : 6;            /*!< IOMSTR/MSPI N Chip Select 75, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL75   : 1;            /*!< Polarity select for NCE for GPIO 75                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN75     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN75     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG75_b;
  } ;

  union {
    __IOM uint32_t PINCFG76;                    /*!< Controls the operation of GPIO pin 76.                                    */

    struct {
      __IOM uint32_t FNCSEL76   : 4;            /*!< Function select for GPIO pin 76                                           */
      __IOM uint32_t INPEN76    : 1;            /*!< Input enable for GPIO 76                                                  */
      __IOM uint32_t RDZERO76   : 1;            /*!< Return 0 for read data on GPIO 76                                         */
      __IOM uint32_t IRPTEN76   : 2;            /*!< Interrupt enable for GPIO 76                                              */
      __IOM uint32_t OUTCFG76   : 2;            /*!< Pin IO mode selection for GPIO pin 76                                     */
      __IOM uint32_t DS76       : 2;            /*!< Drive strength selection for GPIO 76                                      */
      __IOM uint32_t SR76       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG76  : 3;            /*!< Pullup/Pulldown configuration for GPIO 76                                 */
      __IOM uint32_t NCESRC76   : 6;            /*!< IOMSTR/MSPI N Chip Select 76, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL76   : 1;            /*!< Polarity select for NCE for GPIO 76                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN76     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN76     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG76_b;
  } ;

  union {
    __IOM uint32_t PINCFG77;                    /*!< Controls the operation of GPIO pin 77.                                    */

