AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4l_generic.h
    struct {
      __IOM uint32_t FNCSEL80   : 4;            /*!< Function select for GPIO pin 80                                           */
      __IOM uint32_t INPEN80    : 1;            /*!< Input enable for GPIO 80                                                  */
      __IOM uint32_t RDZERO80   : 1;            /*!< Return 0 for read data on GPIO 80                                         */
      __IOM uint32_t IRPTEN80   : 2;            /*!< Interrupt enable for GPIO 80                                              */
      __IOM uint32_t OUTCFG80   : 2;            /*!< Pin IO mode selection for GPIO pin 80                                     */
      __IOM uint32_t DS80       : 2;            /*!< Drive strength selection for GPIO 80                                      */
      __IOM uint32_t SR80       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG80  : 3;            /*!< Pullup/Pulldown configuration for GPIO 80                                 */
      __IOM uint32_t NCESRC80   : 6;            /*!< IOMSTR/MSPI N Chip Select 80, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL80   : 1;            /*!< Polarity select for NCE for GPIO 80                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN80     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN80     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG80_b;
  } ;

  union {
    __IOM uint32_t PINCFG81;                    /*!< Controls the operation of GPIO pin 81.                                    */

    struct {
      __IOM uint32_t FNCSEL81   : 4;            /*!< Function select for GPIO pin 81                                           */
      __IOM uint32_t INPEN81    : 1;            /*!< Input enable for GPIO 81                                                  */
      __IOM uint32_t RDZERO81   : 1;            /*!< Return 0 for read data on GPIO 81                                         */
      __IOM uint32_t IRPTEN81   : 2;            /*!< Interrupt enable for GPIO 81                                              */
      __IOM uint32_t OUTCFG81   : 2;            /*!< Pin IO mode selection for GPIO pin 81                                     */
      __IOM uint32_t DS81       : 2;            /*!< Drive strength selection for GPIO 81                                      */
      __IOM uint32_t SR81       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG81  : 3;            /*!< Pullup/Pulldown configuration for GPIO 81                                 */
      __IOM uint32_t NCESRC81   : 6;            /*!< IOMSTR/MSPI N Chip Select 81, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL81   : 1;            /*!< Polarity select for NCE for GPIO 81                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN81     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN81     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG81_b;
  } ;

  union {
    __IOM uint32_t PINCFG82;                    /*!< Controls the operation of GPIO pin 82.                                    */

    struct {
      __IOM uint32_t FNCSEL82   : 4;            /*!< Function select for GPIO pin 82                                           */
      __IOM uint32_t INPEN82    : 1;            /*!< Input enable for GPIO 82                                                  */
      __IOM uint32_t RDZERO82   : 1;            /*!< Return 0 for read data on GPIO 82                                         */
      __IOM uint32_t IRPTEN82   : 2;            /*!< Interrupt enable for GPIO 82                                              */
      __IOM uint32_t OUTCFG82   : 2;            /*!< Pin IO mode selection for GPIO pin 82                                     */
      __IOM uint32_t DS82       : 2;            /*!< Drive strength selection for GPIO 82                                      */
      __IOM uint32_t SR82       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG82  : 3;            /*!< Pullup/Pulldown configuration for GPIO 82                                 */
      __IOM uint32_t NCESRC82   : 6;            /*!< IOMSTR/MSPI N Chip Select 82, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL82   : 1;            /*!< Polarity select for NCE for GPIO 82                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN82     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN82     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG82_b;
  } ;

  union {
    __IOM uint32_t PINCFG83;                    /*!< Controls the operation of GPIO pin 83.                                    */

