AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4l_generic.h
    struct {
      __IOM uint32_t FNCSEL83   : 4;            /*!< Function select for GPIO pin 83                                           */
      __IOM uint32_t INPEN83    : 1;            /*!< Input enable for GPIO 83                                                  */
      __IOM uint32_t RDZERO83   : 1;            /*!< Return 0 for read data on GPIO 83                                         */
      __IOM uint32_t IRPTEN83   : 2;            /*!< Interrupt enable for GPIO 83                                              */
      __IOM uint32_t OUTCFG83   : 2;            /*!< Pin IO mode selection for GPIO pin 83                                     */
      __IOM uint32_t DS83       : 2;            /*!< Drive strength selection for GPIO 83                                      */
      __IOM uint32_t SR83       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG83  : 3;            /*!< Pullup/Pulldown configuration for GPIO 83                                 */
      __IOM uint32_t NCESRC83   : 6;            /*!< IOMSTR/MSPI N Chip Select 83, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL83   : 1;            /*!< Polarity select for NCE for GPIO 83                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN83     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN83     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG83_b;
  } ;

  union {
    __IOM uint32_t PINCFG84;                    /*!< Controls the operation of GPIO pin 84.                                    */

    struct {
      __IOM uint32_t FNCSEL84   : 4;            /*!< Function select for GPIO pin 84                                           */
      __IOM uint32_t INPEN84    : 1;            /*!< Input enable for GPIO 84                                                  */
      __IOM uint32_t RDZERO84   : 1;            /*!< Return 0 for read data on GPIO 84                                         */
      __IOM uint32_t IRPTEN84   : 2;            /*!< Interrupt enable for GPIO 84                                              */
      __IOM uint32_t OUTCFG84   : 2;            /*!< Pin IO mode selection for GPIO pin 84                                     */
      __IOM uint32_t DS84       : 2;            /*!< Drive strength selection for GPIO 84                                      */
      __IOM uint32_t SR84       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG84  : 3;            /*!< Pullup/Pulldown configuration for GPIO 84                                 */
      __IOM uint32_t NCESRC84   : 6;            /*!< IOMSTR/MSPI N Chip Select 84, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL84   : 1;            /*!< Polarity select for NCE for GPIO 84                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN84     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN84     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG84_b;
  } ;

  union {
    __IOM uint32_t PINCFG85;                    /*!< Controls the operation of GPIO pin 85.                                    */

    struct {
      __IOM uint32_t FNCSEL85   : 4;            /*!< Function select for GPIO pin 85                                           */
      __IOM uint32_t INPEN85    : 1;            /*!< Input enable for GPIO 85                                                  */
      __IOM uint32_t RDZERO85   : 1;            /*!< Return 0 for read data on GPIO 85                                         */
      __IOM uint32_t IRPTEN85   : 2;            /*!< Interrupt enable for GPIO 85                                              */
      __IOM uint32_t OUTCFG85   : 2;            /*!< Pin IO mode selection for GPIO pin 85                                     */
      __IOM uint32_t DS85       : 2;            /*!< Drive strength selection for GPIO 85                                      */
      __IOM uint32_t SR85       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG85  : 3;            /*!< Pullup/Pulldown configuration for GPIO 85                                 */
      __IOM uint32_t NCESRC85   : 6;            /*!< IOMSTR/MSPI N Chip Select 85, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL85   : 1;            /*!< Polarity select for NCE for GPIO 85                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN85     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN85     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG85_b;
  } ;

  union {
    __IOM uint32_t PINCFG86;                    /*!< Controls the operation of GPIO pin 86.                                    */

