AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4l_generic.h
    struct {
      __IOM uint32_t FNCSEL86   : 4;            /*!< Function select for GPIO pin 86                                           */
      __IOM uint32_t INPEN86    : 1;            /*!< Input enable for GPIO 86                                                  */
      __IOM uint32_t RDZERO86   : 1;            /*!< Return 0 for read data on GPIO 86                                         */
      __IOM uint32_t IRPTEN86   : 2;            /*!< Interrupt enable for GPIO 86                                              */
      __IOM uint32_t OUTCFG86   : 2;            /*!< Pin IO mode selection for GPIO pin 86                                     */
      __IOM uint32_t DS86       : 2;            /*!< Drive strength selection for GPIO 86                                      */
      __IOM uint32_t SR86       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG86  : 3;            /*!< Pullup/Pulldown configuration for GPIO 86                                 */
      __IOM uint32_t NCESRC86   : 6;            /*!< IOMSTR/MSPI N Chip Select 86, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL86   : 1;            /*!< Polarity select for NCE for GPIO 86                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN86     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN86     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG86_b;
  } ;

  union {
    __IOM uint32_t PINCFG87;                    /*!< Controls the operation of GPIO pin 87.                                    */

    struct {
      __IOM uint32_t FNCSEL87   : 4;            /*!< Function select for GPIO pin 87                                           */
      __IOM uint32_t INPEN87    : 1;            /*!< Input enable for GPIO 87                                                  */
      __IOM uint32_t RDZERO87   : 1;            /*!< Return 0 for read data on GPIO 87                                         */
      __IOM uint32_t IRPTEN87   : 2;            /*!< Interrupt enable for GPIO 87                                              */
      __IOM uint32_t OUTCFG87   : 2;            /*!< Pin IO mode selection for GPIO pin 87                                     */
      __IOM uint32_t DS87       : 2;            /*!< Drive strength selection for GPIO 87                                      */
      __IOM uint32_t SR87       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG87  : 3;            /*!< Pullup/Pulldown configuration for GPIO 87                                 */
      __IOM uint32_t NCESRC87   : 6;            /*!< IOMSTR/MSPI N Chip Select 87, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL87   : 1;            /*!< Polarity select for NCE for GPIO 87                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN87     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN87     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG87_b;
  } ;

  union {
    __IOM uint32_t PINCFG88;                    /*!< Controls the operation of GPIO pin 88.                                    */

    struct {
      __IOM uint32_t FNCSEL88   : 4;            /*!< Function select for GPIO pin 88                                           */
      __IOM uint32_t INPEN88    : 1;            /*!< Input enable for GPIO 88                                                  */
      __IOM uint32_t RDZERO88   : 1;            /*!< Return 0 for read data on GPIO 88                                         */
      __IOM uint32_t IRPTEN88   : 2;            /*!< Interrupt enable for GPIO 88                                              */
      __IOM uint32_t OUTCFG88   : 2;            /*!< Pin IO mode selection for GPIO pin 88                                     */
      __IOM uint32_t DS88       : 2;            /*!< Drive strength selection for GPIO 88                                      */
      __IOM uint32_t SR88       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG88  : 3;            /*!< Pullup/Pulldown configuration for GPIO 88                                 */
      __IOM uint32_t NCESRC88   : 6;            /*!< IOMSTR/MSPI N Chip Select 88, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL88   : 1;            /*!< Polarity select for NCE for GPIO 88                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN88     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN88     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG88_b;
  } ;

  union {
    __IOM uint32_t PINCFG89;                    /*!< Controls the operation of GPIO pin 89.                                    */

