AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4l_generic.h
    struct {
      __IOM uint32_t FNCSEL92   : 4;            /*!< Function select for GPIO pin 92                                           */
      __IOM uint32_t INPEN92    : 1;            /*!< Input enable for GPIO 92                                                  */
      __IOM uint32_t RDZERO92   : 1;            /*!< Return 0 for read data on GPIO 92                                         */
      __IOM uint32_t IRPTEN92   : 2;            /*!< Interrupt enable for GPIO 92                                              */
      __IOM uint32_t OUTCFG92   : 2;            /*!< Pin IO mode selection for GPIO pin 92                                     */
      __IOM uint32_t DS92       : 2;            /*!< Drive strength selection for GPIO 92                                      */
      __IOM uint32_t SR92       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG92  : 3;            /*!< Pullup/Pulldown configuration for GPIO 92                                 */
      __IOM uint32_t NCESRC92   : 6;            /*!< IOMSTR/MSPI N Chip Select 92, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL92   : 1;            /*!< Polarity select for NCE for GPIO 92                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN92     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN92     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG92_b;
  } ;

  union {
    __IOM uint32_t PINCFG93;                    /*!< Controls the operation of GPIO pin 93.                                    */

    struct {
      __IOM uint32_t FNCSEL93   : 4;            /*!< Function select for GPIO pin 93                                           */
      __IOM uint32_t INPEN93    : 1;            /*!< Input enable for GPIO 93                                                  */
      __IOM uint32_t RDZERO93   : 1;            /*!< Return 0 for read data on GPIO 93                                         */
      __IOM uint32_t IRPTEN93   : 2;            /*!< Interrupt enable for GPIO 93                                              */
      __IOM uint32_t OUTCFG93   : 2;            /*!< Pin IO mode selection for GPIO pin 93                                     */
      __IOM uint32_t DS93       : 2;            /*!< Drive strength selection for GPIO 93                                      */
      __IOM uint32_t SR93       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG93  : 3;            /*!< Pullup/Pulldown configuration for GPIO 93                                 */
      __IOM uint32_t NCESRC93   : 6;            /*!< IOMSTR/MSPI N Chip Select 93, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL93   : 1;            /*!< Polarity select for NCE for GPIO 93                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN93     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN93     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG93_b;
  } ;

  union {
    __IOM uint32_t PINCFG94;                    /*!< Controls the operation of GPIO pin 94.                                    */

    struct {
      __IOM uint32_t FNCSEL94   : 4;            /*!< Function select for GPIO pin 94                                           */
      __IOM uint32_t INPEN94    : 1;            /*!< Input enable for GPIO 94                                                  */
      __IOM uint32_t RDZERO94   : 1;            /*!< Return 0 for read data on GPIO 94                                         */
      __IOM uint32_t IRPTEN94   : 2;            /*!< Interrupt enable for GPIO 94                                              */
      __IOM uint32_t OUTCFG94   : 2;            /*!< Pin IO mode selection for GPIO pin 94                                     */
      __IOM uint32_t DS94       : 2;            /*!< Drive strength selection for GPIO 94                                      */
      __IOM uint32_t SR94       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG94  : 3;            /*!< Pullup/Pulldown configuration for GPIO 94                                 */
      __IOM uint32_t NCESRC94   : 6;            /*!< IOMSTR/MSPI N Chip Select 94, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL94   : 1;            /*!< Polarity select for NCE for GPIO 94                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN94     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN94     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG94_b;
  } ;

  union {
    __IOM uint32_t PINCFG95;                    /*!< Controls the operation of GPIO pin 95.                                    */

