AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4l_generic.h
    struct {
      __IOM uint32_t FNCSEL95   : 4;            /*!< Function select for GPIO pin 95                                           */
      __IOM uint32_t INPEN95    : 1;            /*!< Input enable for GPIO 95                                                  */
      __IOM uint32_t RDZERO95   : 1;            /*!< Return 0 for read data on GPIO 95                                         */
      __IOM uint32_t IRPTEN95   : 2;            /*!< Interrupt enable for GPIO 95                                              */
      __IOM uint32_t OUTCFG95   : 2;            /*!< Pin IO mode selection for GPIO pin 95                                     */
      __IOM uint32_t DS95       : 2;            /*!< Drive strength selection for GPIO 95                                      */
      __IOM uint32_t SR95       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG95  : 3;            /*!< Pullup/Pulldown configuration for GPIO 95                                 */
      __IOM uint32_t NCESRC95   : 6;            /*!< IOMSTR/MSPI N Chip Select 95, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL95   : 1;            /*!< Polarity select for NCE for GPIO 95                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN95     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN95     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG95_b;
  } ;

  union {
    __IOM uint32_t PINCFG96;                    /*!< Controls the operation of GPIO pin 96.                                    */

    struct {
      __IOM uint32_t FNCSEL96   : 4;            /*!< Function select for GPIO pin 96                                           */
      __IOM uint32_t INPEN96    : 1;            /*!< Input enable for GPIO 96                                                  */
      __IOM uint32_t RDZERO96   : 1;            /*!< Return 0 for read data on GPIO 96                                         */
      __IOM uint32_t IRPTEN96   : 2;            /*!< Interrupt enable for GPIO 96                                              */
      __IOM uint32_t OUTCFG96   : 2;            /*!< Pin IO mode selection for GPIO pin 96                                     */
      __IOM uint32_t DS96       : 2;            /*!< Drive strength selection for GPIO 96                                      */
      __IOM uint32_t SR96       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG96  : 3;            /*!< Pullup/Pulldown configuration for GPIO 96                                 */
      __IOM uint32_t NCESRC96   : 6;            /*!< IOMSTR/MSPI N Chip Select 96, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL96   : 1;            /*!< Polarity select for NCE for GPIO 96                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN96     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN96     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG96_b;
  } ;

  union {
    __IOM uint32_t PINCFG97;                    /*!< Controls the operation of GPIO pin 97.                                    */

    struct {
      __IOM uint32_t FNCSEL97   : 4;            /*!< Function select for GPIO pin 97                                           */
      __IOM uint32_t INPEN97    : 1;            /*!< Input enable for GPIO 97                                                  */
      __IOM uint32_t RDZERO97   : 1;            /*!< Return 0 for read data on GPIO 97                                         */
      __IOM uint32_t IRPTEN97   : 2;            /*!< Interrupt enable for GPIO 97                                              */
      __IOM uint32_t OUTCFG97   : 2;            /*!< Pin IO mode selection for GPIO pin 97                                     */
      __IOM uint32_t DS97       : 2;            /*!< Drive strength selection for GPIO 97                                      */
      __IOM uint32_t SR97       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG97  : 3;            /*!< Pullup/Pulldown configuration for GPIO 97                                 */
      __IOM uint32_t NCESRC97   : 6;            /*!< IOMSTR/MSPI N Chip Select 97, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL97   : 1;            /*!< Polarity select for NCE for GPIO 97                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN97     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN97     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG97_b;
  } ;

  union {
    __IOM uint32_t PINCFG98;                    /*!< Controls the operation of GPIO pin 98.                                    */

