AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4l_generic.h
    struct {
      __IOM uint32_t FNCSEL98   : 4;            /*!< Function select for GPIO pin 98                                           */
      __IOM uint32_t INPEN98    : 1;            /*!< Input enable for GPIO 98                                                  */
      __IOM uint32_t RDZERO98   : 1;            /*!< Return 0 for read data on GPIO 98                                         */
      __IOM uint32_t IRPTEN98   : 2;            /*!< Interrupt enable for GPIO 98                                              */
      __IOM uint32_t OUTCFG98   : 2;            /*!< Pin IO mode selection for GPIO pin 98                                     */
      __IOM uint32_t DS98       : 2;            /*!< Drive strength selection for GPIO 98                                      */
      __IOM uint32_t SR98       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG98  : 3;            /*!< Pullup/Pulldown configuration for GPIO 98                                 */
      __IOM uint32_t NCESRC98   : 6;            /*!< IOMSTR/MSPI N Chip Select 98, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL98   : 1;            /*!< Polarity select for NCE for GPIO 98                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN98     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN98     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG98_b;
  } ;

  union {
    __IOM uint32_t PINCFG99;                    /*!< Controls the operation of GPIO pin 99.                                    */

    struct {
      __IOM uint32_t FNCSEL99   : 4;            /*!< Function select for GPIO pin 99                                           */
      __IOM uint32_t INPEN99    : 1;            /*!< Input enable for GPIO 99                                                  */
      __IOM uint32_t RDZERO99   : 1;            /*!< Return 0 for read data on GPIO 99                                         */
      __IOM uint32_t IRPTEN99   : 2;            /*!< Interrupt enable for GPIO 99                                              */
      __IOM uint32_t OUTCFG99   : 2;            /*!< Pin IO mode selection for GPIO pin 99                                     */
      __IOM uint32_t DS99       : 2;            /*!< Drive strength selection for GPIO 99                                      */
      __IOM uint32_t SR99       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG99  : 3;            /*!< Pullup/Pulldown configuration for GPIO 99                                 */
      __IOM uint32_t NCESRC99   : 6;            /*!< IOMSTR/MSPI N Chip Select 99, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL99   : 1;            /*!< Polarity select for NCE for GPIO 99                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN99     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN99     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG99_b;
  } ;

  union {
    __IOM uint32_t PINCFG100;                   /*!< Controls the operation of GPIO pin 100.                                   */

    struct {
      __IOM uint32_t FNCSEL100  : 4;            /*!< Function select for GPIO pin 100                                          */
      __IOM uint32_t INPEN100   : 1;            /*!< Input enable for GPIO 100                                                 */
      __IOM uint32_t RDZERO100  : 1;            /*!< Return 0 for read data on GPIO 100                                        */
      __IOM uint32_t IRPTEN100  : 2;            /*!< Interrupt enable for GPIO 100                                             */
      __IOM uint32_t OUTCFG100  : 2;            /*!< Pin IO mode selection for GPIO pin 100                                    */
      __IOM uint32_t DS100      : 2;            /*!< Drive strength selection for GPIO 100                                     */
      __IOM uint32_t SR100      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG100 : 3;            /*!< Pullup/Pulldown configuration for GPIO 100                                */
      __IOM uint32_t NCESRC100  : 6;            /*!< IOMSTR/MSPI N Chip Select 100, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL100  : 1;            /*!< Polarity select for NCE for GPIO 100                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN100    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN100    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG100_b;
  } ;

  union {
    __IOM uint32_t PINCFG101;                   /*!< Controls the operation of GPIO pin 101.                                   */

