AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4l_generic.h
    struct {
      __IOM uint32_t FNCSEL110  : 4;            /*!< Function select for GPIO pin 110                                          */
      __IOM uint32_t INPEN110   : 1;            /*!< Input enable for GPIO 110                                                 */
      __IOM uint32_t RDZERO110  : 1;            /*!< Return 0 for read data on GPIO 110                                        */
      __IOM uint32_t IRPTEN110  : 2;            /*!< Interrupt enable for GPIO 110                                             */
      __IOM uint32_t OUTCFG110  : 2;            /*!< Pin IO mode selection for GPIO pin 110                                    */
            uint32_t            : 22;
    } PINCFG110_b;
  } ;

  union {
    __IOM uint32_t PINCFG111;                   /*!< Controls the operation of virtual GPIO pin 111.                           */

    struct {
      __IOM uint32_t FNCSEL111  : 4;            /*!< Function select for GPIO pin 111                                          */
      __IOM uint32_t INPEN111   : 1;            /*!< Input enable for GPIO 111                                                 */
      __IOM uint32_t RDZERO111  : 1;            /*!< Return 0 for read data on GPIO 111                                        */
      __IOM uint32_t IRPTEN111  : 2;            /*!< Interrupt enable for GPIO 111                                             */
      __IOM uint32_t OUTCFG111  : 2;            /*!< Pin IO mode selection for GPIO pin 111                                    */
            uint32_t            : 22;
    } PINCFG111_b;
  } ;

  union {
    __IOM uint32_t PINCFG112;                   /*!< Controls the operation of virtual GPIO pin 112.                           */

    struct {
      __IOM uint32_t FNCSEL112  : 4;            /*!< Function select for GPIO pin 112                                          */
      __IOM uint32_t INPEN112   : 1;            /*!< Input enable for GPIO 112                                                 */
      __IOM uint32_t RDZERO112  : 1;            /*!< Return 0 for read data on GPIO 112                                        */
      __IOM uint32_t IRPTEN112  : 2;            /*!< Interrupt enable for GPIO 112                                             */
      __IOM uint32_t OUTCFG112  : 2;            /*!< Pin IO mode selection for GPIO pin 112                                    */
            uint32_t            : 22;
    } PINCFG112_b;
  } ;

  union {
    __IOM uint32_t PINCFG113;                   /*!< Controls the operation of virtual GPIO pin 113.                           */

    struct {
      __IOM uint32_t FNCSEL113  : 4;            /*!< Function select for GPIO pin 113                                          */
      __IOM uint32_t INPEN113   : 1;            /*!< Input enable for GPIO 113                                                 */
      __IOM uint32_t RDZERO113  : 1;            /*!< Return 0 for read data on GPIO 113                                        */
      __IOM uint32_t IRPTEN113  : 2;            /*!< Interrupt enable for GPIO 113                                             */
      __IOM uint32_t OUTCFG113  : 2;            /*!< Pin IO mode selection for GPIO pin 113                                    */
            uint32_t            : 22;
    } PINCFG113_b;
  } ;

  union {
    __IOM uint32_t PINCFG114;                   /*!< Controls the operation of virtual GPIO pin 114.                           */

    struct {
      __IOM uint32_t FNCSEL114  : 4;            /*!< Function select for GPIO pin 114                                          */
      __IOM uint32_t INPEN114   : 1;            /*!< Input enable for GPIO 114                                                 */
      __IOM uint32_t RDZERO114  : 1;            /*!< Return 0 for read data on GPIO 114                                        */
      __IOM uint32_t IRPTEN114  : 2;            /*!< Interrupt enable for GPIO 114                                             */
      __IOM uint32_t OUTCFG114  : 2;            /*!< Pin IO mode selection for GPIO pin 114                                    */
            uint32_t            : 22;
    } PINCFG114_b;
  } ;

  union {
    __IOM uint32_t PINCFG115;                   /*!< Controls the operation of virtual GPIO pin 115.                           */

    struct {
      __IOM uint32_t FNCSEL115  : 4;            /*!< Function select for GPIO pin 115                                          */
      __IOM uint32_t INPEN115   : 1;            /*!< Input enable for GPIO 115                                                 */
      __IOM uint32_t RDZERO115  : 1;            /*!< Return 0 for read data on GPIO 115                                        */
      __IOM uint32_t IRPTEN115  : 2;            /*!< Interrupt enable for GPIO 115                                             */
      __IOM uint32_t OUTCFG115  : 2;            /*!< Pin IO mode selection for GPIO pin 115                                    */
            uint32_t            : 22;
    } PINCFG115_b;
  } ;

  union {
    __IOM uint32_t PINCFG116;                   /*!< Controls the operation of virtual GPIO pin 116.                           */

    struct {
      __IOM uint32_t FNCSEL116  : 4;            /*!< Function select for GPIO pin 116                                          */
      __IOM uint32_t INPEN116   : 1;            /*!< Input enable for GPIO 116                                                 */
      __IOM uint32_t RDZERO116  : 1;            /*!< Return 0 for read data on GPIO 116                                        */
      __IOM uint32_t IRPTEN116  : 2;            /*!< Interrupt enable for GPIO 116                                             */
      __IOM uint32_t OUTCFG116  : 2;            /*!< Pin IO mode selection for GPIO pin 116                                    */
            uint32_t            : 22;
    } PINCFG116_b;
  } ;

  union {
    __IOM uint32_t PINCFG117;                   /*!< Controls the operation of virtual GPIO pin 117.                           */

