AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4l_generic.h
    struct {
      __IOM uint32_t FNCSEL117  : 4;            /*!< Function select for GPIO pin 117                                          */
      __IOM uint32_t INPEN117   : 1;            /*!< Input enable for GPIO 117                                                 */
      __IOM uint32_t RDZERO117  : 1;            /*!< Return 0 for read data on GPIO 117                                        */
      __IOM uint32_t IRPTEN117  : 2;            /*!< Interrupt enable for GPIO 117                                             */
      __IOM uint32_t OUTCFG117  : 2;            /*!< Pin IO mode selection for GPIO pin 117                                    */
            uint32_t            : 22;
    } PINCFG117_b;
  } ;

  union {
    __IOM uint32_t PINCFG118;                   /*!< Controls the operation of virtual GPIO pin 118.                           */

    struct {
      __IOM uint32_t FNCSEL118  : 4;            /*!< Function select for GPIO pin 118                                          */
      __IOM uint32_t INPEN118   : 1;            /*!< Input enable for GPIO 118                                                 */
      __IOM uint32_t RDZERO118  : 1;            /*!< Return 0 for read data on GPIO 118                                        */
      __IOM uint32_t IRPTEN118  : 2;            /*!< Interrupt enable for GPIO 118                                             */
      __IOM uint32_t OUTCFG118  : 2;            /*!< Pin IO mode selection for GPIO pin 118                                    */
            uint32_t            : 22;
    } PINCFG118_b;
  } ;

  union {
    __IOM uint32_t PINCFG119;                   /*!< Controls the operation of virtual GPIO pin 119.                           */

    struct {
      __IOM uint32_t FNCSEL119  : 4;            /*!< Function select for GPIO pin 119                                          */
      __IOM uint32_t INPEN119   : 1;            /*!< Input enable for GPIO 119                                                 */
      __IOM uint32_t RDZERO119  : 1;            /*!< Return 0 for read data on GPIO 119                                        */
      __IOM uint32_t IRPTEN119  : 2;            /*!< Interrupt enable for GPIO 119                                             */
      __IOM uint32_t OUTCFG119  : 2;            /*!< Pin IO mode selection for GPIO pin 119                                    */
            uint32_t            : 22;
    } PINCFG119_b;
  } ;

  union {
    __IOM uint32_t PINCFG120;                   /*!< Controls the operation of virtual GPIO pin 120.                           */

    struct {
      __IOM uint32_t FNCSEL120  : 4;            /*!< Function select for GPIO pin 120                                          */
      __IOM uint32_t INPEN120   : 1;            /*!< Input enable for GPIO 120                                                 */
      __IOM uint32_t RDZERO120  : 1;            /*!< Return 0 for read data on GPIO 120                                        */
      __IOM uint32_t IRPTEN120  : 2;            /*!< Interrupt enable for GPIO 120                                             */
      __IOM uint32_t OUTCFG120  : 2;            /*!< Pin IO mode selection for GPIO pin 120                                    */
            uint32_t            : 22;
    } PINCFG120_b;
  } ;

  union {
    __IOM uint32_t PINCFG121;                   /*!< Controls the operation of virtual GPIO pin 121.                           */

    struct {
      __IOM uint32_t FNCSEL121  : 4;            /*!< Function select for GPIO pin 121                                          */
      __IOM uint32_t INPEN121   : 1;            /*!< Input enable for GPIO 121                                                 */
      __IOM uint32_t RDZERO121  : 1;            /*!< Return 0 for read data on GPIO 121                                        */
      __IOM uint32_t IRPTEN121  : 2;            /*!< Interrupt enable for GPIO 121                                             */
      __IOM uint32_t OUTCFG121  : 2;            /*!< Pin IO mode selection for GPIO pin 121                                    */
            uint32_t            : 22;
    } PINCFG121_b;
  } ;

  union {
    __IOM uint32_t PINCFG122;                   /*!< Controls the operation of virtual GPIO pin 122.                           */

    struct {
      __IOM uint32_t FNCSEL122  : 4;            /*!< Function select for GPIO pin 122                                          */
      __IOM uint32_t INPEN122   : 1;            /*!< Input enable for GPIO 122                                                 */
      __IOM uint32_t RDZERO122  : 1;            /*!< Return 0 for read data on GPIO 122                                        */
      __IOM uint32_t IRPTEN122  : 2;            /*!< Interrupt enable for GPIO 122                                             */
      __IOM uint32_t OUTCFG122  : 2;            /*!< Pin IO mode selection for GPIO pin 122                                    */
            uint32_t            : 22;
    } PINCFG122_b;
  } ;

  union {
    __IOM uint32_t PINCFG123;                   /*!< Controls the operation of virtual GPIO pin 123.                           */

    struct {
      __IOM uint32_t FNCSEL123  : 4;            /*!< Function select for GPIO pin 123                                          */
      __IOM uint32_t INPEN123   : 1;            /*!< Input enable for GPIO 123                                                 */
      __IOM uint32_t RDZERO123  : 1;            /*!< Return 0 for read data on GPIO 123                                        */
      __IOM uint32_t IRPTEN123  : 2;            /*!< Interrupt enable for GPIO 123                                             */
      __IOM uint32_t OUTCFG123  : 2;            /*!< Pin IO mode selection for GPIO pin 123                                    */
            uint32_t            : 22;
    } PINCFG123_b;
  } ;

  union {
    __IOM uint32_t PINCFG124;                   /*!< Controls the operation of virtual GPIO pin 124.                           */

