AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4l_generic.h
    struct {
      __IOM uint32_t FNCSEL124  : 4;            /*!< Function select for GPIO pin 124                                          */
      __IOM uint32_t INPEN124   : 1;            /*!< Input enable for GPIO 124                                                 */
      __IOM uint32_t RDZERO124  : 1;            /*!< Return 0 for read data on GPIO 124                                        */
      __IOM uint32_t IRPTEN124  : 2;            /*!< Interrupt enable for GPIO 124                                             */
      __IOM uint32_t OUTCFG124  : 2;            /*!< Pin IO mode selection for GPIO pin 124                                    */
            uint32_t            : 22;
    } PINCFG124_b;
  } ;

  union {
    __IOM uint32_t PINCFG125;                   /*!< Controls the operation of virtual GPIO pin 125.                           */

    struct {
      __IOM uint32_t FNCSEL125  : 4;            /*!< Function select for GPIO pin 125                                          */
      __IOM uint32_t INPEN125   : 1;            /*!< Input enable for GPIO 125                                                 */
      __IOM uint32_t RDZERO125  : 1;            /*!< Return 0 for read data on GPIO 125                                        */
      __IOM uint32_t IRPTEN125  : 2;            /*!< Interrupt enable for GPIO 125                                             */
      __IOM uint32_t OUTCFG125  : 2;            /*!< Pin IO mode selection for GPIO pin 125                                    */
            uint32_t            : 22;
    } PINCFG125_b;
  } ;

  union {
    __IOM uint32_t PINCFG126;                   /*!< Controls the operation of virtual GPIO pin 126.                           */

    struct {
      __IOM uint32_t FNCSEL126  : 4;            /*!< Function select for GPIO pin 126                                          */
      __IOM uint32_t INPEN126   : 1;            /*!< Input enable for GPIO 126                                                 */
      __IOM uint32_t RDZERO126  : 1;            /*!< Return 0 for read data on GPIO 126                                        */
      __IOM uint32_t IRPTEN126  : 2;            /*!< Interrupt enable for GPIO 126                                             */
      __IOM uint32_t OUTCFG126  : 2;            /*!< Pin IO mode selection for GPIO pin 126                                    */
            uint32_t            : 22;
    } PINCFG126_b;
  } ;

  union {
    __IOM uint32_t PINCFG127;                   /*!< Controls the operation of virtual GPIO pin 127.                           */

    struct {
      __IOM uint32_t FNCSEL127  : 4;            /*!< Function select for GPIO pin 127                                          */
      __IOM uint32_t INPEN127   : 1;            /*!< Input enable for GPIO 127                                                 */
      __IOM uint32_t RDZERO127  : 1;            /*!< Return 0 for read data on GPIO 127                                        */
      __IOM uint32_t IRPTEN127  : 2;            /*!< Interrupt enable for GPIO 127                                             */
      __IOM uint32_t OUTCFG127  : 2;            /*!< Pin IO mode selection for GPIO pin 127                                    */
            uint32_t            : 22;
    } PINCFG127_b;
  } ;

  union {
    __IOM uint32_t PADKEY;                      /*!< Lock state of the PINCFG and GPIO configuration registers. Write
                                                     a value of 0x73 to unlock write access to the PAD and GPIO.               */

    struct {
      __IOM uint32_t PADKEY     : 32;           /*!< Key register value.                                                       */
    } PADKEY_b;
  } ;

  union {
    __IOM uint32_t RD0;                         /*!< GPIO Input 0 (31-0)                                                       */

    struct {
      __IOM uint32_t RD0        : 32;           /*!< GPIO31-0 Reads pin state - read only. Returns the pad pin state
                                                     for pins 0-31 if the PINCFG's input enable (INPEN) is active
                                                     and RDZERO is inactive.                                                   */
    } RD0_b;
  } ;

  union {
    __IOM uint32_t RD1;                         /*!< GPIO Input 1 (63-32)                                                      */

    struct {
      __IOM uint32_t RD1        : 32;           /*!< GPIO63-32 Reads pin state - read only. Returns the pad pin state
                                                     for pins 0-31 if the PINCFG's input enable (INPEN) is active
                                                     and RDZERO is inactive.                                                   */
    } RD1_b;
  } ;

  union {
    __IOM uint32_t RD2;                         /*!< GPIO Input 2 (95-64)                                                      */

    struct {
      __IOM uint32_t RD2        : 32;           /*!< GPIO95-64 Reads pin state - read only. Returns the pad pin state
                                                     for pins 0-31 if the PINCFG's input enable (INPEN) is active
                                                     and RDZERO is inactive.                                                   */
    } RD2_b;
  } ;

  union {
    __IOM uint32_t RD3;                         /*!< GPIO Input 3 (127-96)                                                     */

    struct {
      __IOM uint32_t RD3        : 32;           /*!< GPIO127-96 Reads pin state - read only. Returns the pad pin
                                                     state for pins 0-31 if the PINCFG's input enable (INPEN)
                                                     is active and RDZERO is inactive.                                         */
    } RD3_b;
  } ;

  union {
    __IOM uint32_t WT0;                         /*!< GPIO Output 0 (31-0)                                                      */

