AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4l_generic.h
    struct {
      __IOM uint32_t WT0        : 32;           /*!< GPIO31-0 Reads or writes pin state. Writes of 1 bits set output
                                                     pad signal if the GPIO is enabled for output. Reads return
                                                     status, including sets/clears through the WTS and WTC registers.          */
    } WT0_b;
  } ;

  union {
    __IOM uint32_t WT1;                         /*!< GPIO Output 1 (63-32)                                                     */

    struct {
      __IOM uint32_t WT1        : 32;           /*!< GPIO63-32 Reads or writes pin state. Writes of 1 bits set output
                                                     pad signal if the GPIO is enabled for output. Reads return
                                                     status, including sets/clears through the WTS and WTC registers.          */
    } WT1_b;
  } ;

  union {
    __IOM uint32_t WT2;                         /*!< GPIO Output 2 (95-64)                                                     */

    struct {
      __IOM uint32_t WT2        : 32;           /*!< GPIO95-64 Reads or writes pin state. Writes of 1 bits set output
                                                     pad signal if the GPIO is enabled for output. Reads return
                                                     status, including sets/clears through the WTS and WTC registers.          */
    } WT2_b;
  } ;

  union {
    __IOM uint32_t WT3;                         /*!< GPIO Output 3 (127-96)                                                    */

    struct {
      __IOM uint32_t WT3        : 32;           /*!< GPIO127-96 Reads or writes pin state. Writes of 1 bits set output
                                                     pad signal if the GPIO is enabled for output. Reads return
                                                     status, including sets/clears through the WTS and WTC registers.          */
    } WT3_b;
  } ;

  union {
    __IOM uint32_t WTS0;                        /*!< GPIO Output Set 0 (31-0)                                                  */

    struct {
      __IOM uint32_t WTS0       : 32;           /*!< GPIO31-0 Sets pin state. Writing a 1 to any bit sets the corresponding
                                                     bit in the WT register if the GPIO is enabled for output.
                                                     Writing a value of 0 has no effect on the corresponding
                                                     bit in the WT register. Status reads should be made via
                                                     the WT Register.                                                          */
    } WTS0_b;
  } ;

  union {
    __IOM uint32_t WTS1;                        /*!< GPIO Output Set 1 (63-32)                                                 */

    struct {
      __IOM uint32_t WTS1       : 32;           /*!< GPIO63-32 Sets pin state. Writing a 1 to any bit sets the corresponding
                                                     bit in the WT register if the GPIO is enabled for output.
                                                     Writing a value of 0 has no effect on the corresponding
                                                     bit in the WT register. Status reads should be made via
                                                     the WT Register.                                                          */
    } WTS1_b;
  } ;

  union {
    __IOM uint32_t WTS2;                        /*!< GPIO Output Set 2 (95-64)                                                 */

    struct {
      __IOM uint32_t WTS2       : 32;           /*!< GPIO95-64 Sets pin state. Writing a 1 to any bit sets the corresponding
                                                     bit in the WT register if the GPIO is enabled for output.
                                                     Writing a value of 0 has no effect on the corresponding
                                                     bit in the WT register. Status reads should be made via
                                                     the WT Register.                                                          */
    } WTS2_b;
  } ;

  union {
    __IOM uint32_t WTS3;                        /*!< GPIO Output Set 3 (127-96)                                                */

    struct {
      __IOM uint32_t WTS3       : 32;           /*!< GPIO127-96 Sets pin state. Writing a 1 to any bit sets the corresponding
                                                     bit in the WT register if the GPIO is enabled for output.
                                                     Writing a value of 0 has no effect on the corresponding
                                                     bit in the WT register. Status reads should be made via
                                                     the WT Register.                                                          */
    } WTS3_b;
  } ;

  union {
    __IOM uint32_t WTC0;                        /*!< GPIO Output Clear 0 (31-0)                                                */

    struct {
      __IOM uint32_t WTC0       : 32;           /*!< GPIO31-0 Clears pin state. Writing a 1 to any bit clears the
                                                     corresponding bit in the WT register if the GPIO is enabled
                                                     for output. Writing a value of 0 has no effect on the corresponding
                                                     bit in the WT register. Status reads should be made via
                                                     the WT register.                                                          */
    } WTC0_b;
  } ;

  union {
    __IOM uint32_t WTC1;                        /*!< GPIO Output Clear 1 (63-32)                                               */

    struct {
      __IOM uint32_t WTC1       : 32;           /*!< GPIO63-32 Clears pin state. Writing a 1 to any bit clears the
                                                     corresponding bit in the WT register if the GPIO is enabled
                                                     for output. Writing a value of 0 has no effect on the corresponding
                                                     bit in the WT register. Status reads should be made via
                                                     the WT register.                                                          */
    } WTC1_b;
  } ;

  union {
    __IOM uint32_t WTC2;                        /*!< GPIO Output Clear 2 (95-64)                                               */

