AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4l_generic.h
    struct {
      __IOM uint32_t ENS3       : 32;           /*!< GPIO127-96 Sets pin tri-state output enables. Writing a 1 to
                                                     any bit sets the corresponding bit in the EN register.
                                                     Writing a value of 0 has no effect on the corresponding
                                                     bit in the EN register. Status reads should be made to
                                                     the EN Register.                                                          */
    } ENS3_b;
  } ;

  union {
    __IOM uint32_t ENC0;                        /*!< GPIO Enable Clear 0 (31-0)                                                */

    struct {
      __IOM uint32_t ENC0       : 32;           /*!< GPIO31-0 Clears pin tri-state output enables. Writing a 1 to
                                                     any bit clears the corresponding bit in the EN register.
                                                     Writing a value of 0 has no effect on the corresponding
                                                     bit in the EN register. Status reads should be made to
                                                     the EN Register.                                                          */
    } ENC0_b;
  } ;

  union {
    __IOM uint32_t ENC1;                        /*!< GPIO Enable Clear 1 (63-32)                                               */

    struct {
      __IOM uint32_t ENC1       : 32;           /*!< GPIO63-32 Clears pin tri-state output enables. Writing a 1 to
                                                     any bit clears the corresponding bit in the EN register.
                                                     Writing a value of 0 has no effect on the corresponding
                                                     bit in the EN register. Status reads should be made to
                                                     the EN Register.                                                          */
    } ENC1_b;
  } ;

  union {
    __IOM uint32_t ENC2;                        /*!< GPIO Enable Clear 2 (95-64)                                               */

    struct {
      __IOM uint32_t ENC2       : 32;           /*!< GPIO95-64 Clears pin tri-state output enables. Writing a 1 to
                                                     any bit clears the corresponding bit in the EN register.
                                                     Writing a value of 0 has no effect on the corresponding
                                                     bit in the EN register. Status reads should be made to
                                                     the EN Register.                                                          */
    } ENC2_b;
  } ;

  union {
    __IOM uint32_t ENC3;                        /*!< GPIO Enable Clear 3 (127-96)                                              */

    struct {
      __IOM uint32_t ENC3       : 32;           /*!< GPIO127-96 Clears pin tri-state output enables. Writing a 1
                                                     to any bit clears the corresponding bit in the EN register.
                                                     Writing a value of 0 has no effect on the corresponding
                                                     bit in the EN register. Status reads should be made to
                                                     the EN Register.                                                          */
    } ENC3_b;
  } ;

  union {
    __IOM uint32_t IOM0IRQ;                     /*!< IOM0 IRQ select for flow control.                                         */

    struct {
      __IOM uint32_t IOM0IRQ    : 7;            /*!< IOM0 IRQ pad select.                                                      */
            uint32_t            : 25;
    } IOM0IRQ_b;
  } ;

  union {
    __IOM uint32_t IOM1IRQ;                     /*!< IOM1 IRQ select for flow control.                                         */

    struct {
      __IOM uint32_t IOM1IRQ    : 7;            /*!< IOM1 IRQ pad select.                                                      */
            uint32_t            : 25;
    } IOM1IRQ_b;
  } ;

  union {
    __IOM uint32_t IOM2IRQ;                     /*!< IOM2 IRQ select for flow control.                                         */

    struct {
      __IOM uint32_t IOM2IRQ    : 7;            /*!< IOM2 IRQ pad select.                                                      */
            uint32_t            : 25;
    } IOM2IRQ_b;
  } ;

  union {
    __IOM uint32_t IOM3IRQ;                     /*!< IOM3 IRQ select for flow control.                                         */

    struct {
      __IOM uint32_t IOM3IRQ    : 7;            /*!< IOM3 IRQ pad select.                                                      */
            uint32_t            : 25;
    } IOM3IRQ_b;
  } ;

  union {
    __IOM uint32_t IOM4IRQ;                     /*!< IOM4 IRQ select for flow control.                                         */

    struct {
      __IOM uint32_t IOM4IRQ    : 7;            /*!< IOM4 IRQ pad select.                                                      */
            uint32_t            : 25;
    } IOM4IRQ_b;
  } ;

  union {
    __IOM uint32_t IOM5IRQ;                     /*!< IOM5 IRQ select for flow control.                                         */

    struct {
      __IOM uint32_t IOM5IRQ    : 7;            /*!< IOM5 IRQ pad select.                                                      */
            uint32_t            : 25;
    } IOM5IRQ_b;
  } ;

  union {
    __IOM uint32_t IOM6IRQ;                     /*!< IOM6 IRQ select for flow control.                                         */

    struct {
      __IOM uint32_t IOM6IRQ    : 7;            /*!< IOM6 IRQ pad select.                                                      */
            uint32_t            : 25;
    } IOM6IRQ_b;
  } ;

  union {
    __IOM uint32_t IOM7IRQ;                     /*!< IOM7 IRQ select for flow control.                                         */

