AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4l_generic.h
    struct {
      __IOM uint32_t IOM7IRQ    : 7;            /*!< IOM7 IRQ pad select.                                                      */
            uint32_t            : 25;
    } IOM7IRQ_b;
  } ;

  union {
    __IOM uint32_t SDIFCDWP;                    /*!< SDIF CD and WP Select.                                                    */

    struct {
      __IOM uint32_t SDIFCD     : 7;            /*!< SDIF CD pad select.                                                       */
            uint32_t            : 1;
      __IOM uint32_t SDIFWP     : 7;            /*!< SDIF WP pad select.                                                       */
            uint32_t            : 17;
    } SDIFCDWP_b;
  } ;

  union {
    __IOM uint32_t OBSDATA;                     /*!< GPIO Observation mode sample                                              */

    struct {
      __IOM uint32_t OBSDATA    : 16;           /*!< Sample of the data output on the GPIO observation port. May
                                                     have async sampling issues, as the data is not synronized
                                                     to the read operation. Intended for debug purposes only.                  */
            uint32_t            : 16;
    } OBSDATA_b;
  } ;

  union {
    __IOM uint32_t IEOBS0;                      /*!< Read only. Reflects the value of the input enable signals for
                                                     pads 31-0 sent to the pad.                                                */

    struct {
      __IOM uint32_t IEDATA0    : 32;           /*!< 1 indicates the input_en is active and the value of the pad
                                                     will be trasmitted to the internal logic within the device.               */
    } IEOBS0_b;
  } ;

  union {
    __IOM uint32_t IEOBS1;                      /*!< Read only. Reflects the value of the input enable signals for
                                                     pads 63-32 sent to the pad.                                               */

    struct {
      __IOM uint32_t IEDATA1    : 32;           /*!< 1 indicates the input_en is active and the value of the pad
                                                     will be trasmitted to the internal logic within the device.               */
    } IEOBS1_b;
  } ;

  union {
    __IOM uint32_t IEOBS2;                      /*!< Read only. Reflects the value of the input enable signals for
                                                     pads 95-64 sent to the pad.                                               */

    struct {
      __IOM uint32_t IEDATA2    : 32;           /*!< 1 indicates the input_en is active and the value of the pad
                                                     will be trasmitted to the internal logic within the device.               */
    } IEOBS2_b;
  } ;

  union {
    __IOM uint32_t IEOBS3;                      /*!< Read only. Reflects the value of the input enable signals for
                                                     pads 127-96 sent to the pad.                                              */

    struct {
      __IOM uint32_t IEDATA3    : 32;           /*!< 1 indicates the input_en is active and the value of the pad
                                                     will be trasmitted to the internal logic within the device.               */
    } IEOBS3_b;
  } ;

  union {
    __IOM uint32_t OEOBS0;                      /*!< Read only. Reflects the value of the output enable signals for
                                                     pads 31-0 sent to the pad.                                                */

    struct {
      __IOM uint32_t OEDATA0    : 32;           /*!< The signal is negative active, and a value of 0 indicates the
                                                     output_en_ is active and the MCU will be driving the pad.                 */
    } OEOBS0_b;
  } ;

  union {
    __IOM uint32_t OEOBS1;                      /*!< Read only. Reflects the value of the output enable signals for
                                                     pads 63-32 sent to the pad.                                               */

    struct {
      __IOM uint32_t OEDATA1    : 32;           /*!< The signal is negative active, and a value of 0 indicates the
                                                     output_en_ is active and the MCU will be driving the pad.                 */
    } OEOBS1_b;
  } ;

  union {
    __IOM uint32_t OEOBS2;                      /*!< Read only. Reflects the value of the output enable signals for
                                                     pads 95-64 sent to the pad.                                               */

    struct {
      __IOM uint32_t OEDATA2    : 32;           /*!< The signal is negative active, and a value of 0 indicates the
                                                     output_en_ is active and the MCU will be driving the pad.                 */
    } OEOBS2_b;
  } ;

  union {
    __IOM uint32_t OEOBS3;                      /*!< Read only. Reflects the value of the output enable signals for
                                                     pads 127-96 sent to the pad.                                              */

    struct {
      __IOM uint32_t OEDATA3    : 32;           /*!< The signal is negative active, and a value of 0 indicates the
                                                     output_en_ is active and the MCU will be driving the pad.                 */
    } OEOBS3_b;
  } ;
  __IM  uint32_t  RESERVED;

  union {
    __IOM uint32_t MCUN0INT0EN;                 /*!< Set bits in this register to allow this module to generate the
                                                     corresponding interrupt.                                                  */

    struct {
      __IOM uint32_t MCUN0GPIO0 : 1;            /*!< GPIO0 MCU N0-priority interrupt.                                          */
      __IOM uint32_t MCUN0GPIO1 : 1;            /*!< GPIO1 MCU N0-priority interrupt.                                          */
      __IOM uint32_t MCUN0GPIO2 : 1;            /*!< GPIO2 MCU N0-priority interrupt.                                          */
      __IOM uint32_t MCUN0GPIO3 : 1;            /*!< GPIO3 MCU N0-priority interrupt.                                          */
      __IOM uint32_t MCUN0GPIO4 : 1;            /*!< GPIO4 MCU N0-priority interrupt.                                          */
      __IOM uint32_t MCUN0GPIO5 : 1;            /*!< GPIO5 MCU N0-priority interrupt.                                          */
      __IOM uint32_t MCUN0GPIO6 : 1;            /*!< GPIO6 MCU N0-priority interrupt.                                          */
      __IOM uint32_t MCUN0GPIO7 : 1;            /*!< GPIO7 MCU N0-priority interrupt.                                          */
      __IOM uint32_t MCUN0GPIO8 : 1;            /*!< GPIO8 MCU N0-priority interrupt.                                          */
      __IOM uint32_t MCUN0GPIO9 : 1;            /*!< GPIO9 MCU N0-priority interrupt.                                          */
      __IOM uint32_t MCUN0GPIO10 : 1;           /*!< GPIO10 MCU N0-priority interrupt.                                         */
      __IOM uint32_t MCUN0GPIO11 : 1;           /*!< GPIO11 MCU N0-priority interrupt.                                         */
      __IOM uint32_t MCUN0GPIO12 : 1;           /*!< GPIO12 MCU N0-priority interrupt.                                         */
      __IOM uint32_t MCUN0GPIO13 : 1;           /*!< GPIO13 MCU N0-priority interrupt.                                         */
      __IOM uint32_t MCUN0GPIO14 : 1;           /*!< GPIO14 MCU N0-priority interrupt.                                         */
      __IOM uint32_t MCUN0GPIO15 : 1;           /*!< GPIO15 MCU N0-priority interrupt.                                         */
      __IOM uint32_t MCUN0GPIO16 : 1;           /*!< GPIO16 MCU N0-priority interrupt.                                         */
      __IOM uint32_t MCUN0GPIO17 : 1;           /*!< GPIO17 MCU N0-priority interrupt.                                         */
      __IOM uint32_t MCUN0GPIO18 : 1;           /*!< GPIO18 MCU N0-priority interrupt.                                         */
      __IOM uint32_t MCUN0GPIO19 : 1;           /*!< GPIO19 MCU N0-priority interrupt.                                         */
      __IOM uint32_t MCUN0GPIO20 : 1;           /*!< GPIO20 MCU N0-priority interrupt.                                         */
      __IOM uint32_t MCUN0GPIO21 : 1;           /*!< GPIO21 MCU N0-priority interrupt.                                         */
      __IOM uint32_t MCUN0GPIO22 : 1;           /*!< GPIO22 MCU N0-priority interrupt.                                         */
      __IOM uint32_t MCUN0GPIO23 : 1;           /*!< GPIO23 MCU N0-priority interrupt.                                         */
      __IOM uint32_t MCUN0GPIO24 : 1;           /*!< GPIO24 MCU N0-priority interrupt.                                         */
      __IOM uint32_t MCUN0GPIO25 : 1;           /*!< GPIO25 MCU N0-priority interrupt.                                         */
      __IOM uint32_t MCUN0GPIO26 : 1;           /*!< GPIO26 MCU N0-priority interrupt.                                         */
      __IOM uint32_t MCUN0GPIO27 : 1;           /*!< GPIO27 MCU N0-priority interrupt.                                         */
      __IOM uint32_t MCUN0GPIO28 : 1;           /*!< GPIO28 MCU N0-priority interrupt.                                         */
      __IOM uint32_t MCUN0GPIO29 : 1;           /*!< GPIO29 MCU N0-priority interrupt.                                         */
      __IOM uint32_t MCUN0GPIO30 : 1;           /*!< GPIO30 MCU N0-priority interrupt.                                         */
      __IOM uint32_t MCUN0GPIO31 : 1;           /*!< GPIO31 MCU N0-priority interrupt.                                         */
    } MCUN0INT0EN_b;
  } ;

  union {
    __IOM uint32_t MCUN0INT0STAT;               /*!< Read bits from this register to discover the cause of a recent
                                                     interrupt.                                                                */

