AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4l_generic.h
    struct {
      __IOM uint32_t MCUN1GPIO64 : 1;           /*!< GPIO64 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO65 : 1;           /*!< GPIO65 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO66 : 1;           /*!< GPIO66 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO67 : 1;           /*!< GPIO67 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO68 : 1;           /*!< GPIO68 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO69 : 1;           /*!< GPIO69 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO70 : 1;           /*!< GPIO70 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO71 : 1;           /*!< GPIO71 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO72 : 1;           /*!< GPIO72 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO73 : 1;           /*!< GPIO73 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO74 : 1;           /*!< GPIO74 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO75 : 1;           /*!< GPIO75 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO76 : 1;           /*!< GPIO76 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO77 : 1;           /*!< GPIO77 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO78 : 1;           /*!< GPIO78 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO79 : 1;           /*!< GPIO79 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO80 : 1;           /*!< GPIO80 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO81 : 1;           /*!< GPIO81 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO82 : 1;           /*!< GPIO82 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO83 : 1;           /*!< GPIO83 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO84 : 1;           /*!< GPIO84 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO85 : 1;           /*!< GPIO85 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO86 : 1;           /*!< GPIO86 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO87 : 1;           /*!< GPIO87 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO88 : 1;           /*!< GPIO88 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO89 : 1;           /*!< GPIO89 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO90 : 1;           /*!< GPIO90 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO91 : 1;           /*!< GPIO91 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO92 : 1;           /*!< GPIO92 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO93 : 1;           /*!< GPIO93 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO94 : 1;           /*!< GPIO94 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO95 : 1;           /*!< GPIO95 MCU N1-priority interrupt.                                         */
    } MCUN1INT2STAT_b;
  } ;

  union {
    __IOM uint32_t MCUN1INT2CLR;                /*!< Write a 1 to a bit in this register to clear the interrupt status
                                                     associated with that bit.                                                 */

    struct {
      __IOM uint32_t MCUN1GPIO64 : 1;           /*!< GPIO64 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO65 : 1;           /*!< GPIO65 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO66 : 1;           /*!< GPIO66 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO67 : 1;           /*!< GPIO67 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO68 : 1;           /*!< GPIO68 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO69 : 1;           /*!< GPIO69 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO70 : 1;           /*!< GPIO70 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO71 : 1;           /*!< GPIO71 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO72 : 1;           /*!< GPIO72 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO73 : 1;           /*!< GPIO73 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO74 : 1;           /*!< GPIO74 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO75 : 1;           /*!< GPIO75 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO76 : 1;           /*!< GPIO76 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO77 : 1;           /*!< GPIO77 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO78 : 1;           /*!< GPIO78 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO79 : 1;           /*!< GPIO79 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO80 : 1;           /*!< GPIO80 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO81 : 1;           /*!< GPIO81 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO82 : 1;           /*!< GPIO82 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO83 : 1;           /*!< GPIO83 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO84 : 1;           /*!< GPIO84 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO85 : 1;           /*!< GPIO85 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO86 : 1;           /*!< GPIO86 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO87 : 1;           /*!< GPIO87 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO88 : 1;           /*!< GPIO88 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO89 : 1;           /*!< GPIO89 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO90 : 1;           /*!< GPIO90 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO91 : 1;           /*!< GPIO91 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO92 : 1;           /*!< GPIO92 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO93 : 1;           /*!< GPIO93 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO94 : 1;           /*!< GPIO94 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO95 : 1;           /*!< GPIO95 MCU N1-priority interrupt.                                         */
    } MCUN1INT2CLR_b;
  } ;

  union {
    __IOM uint32_t MCUN1INT2SET;                /*!< Write a 1 to a bit in this register to instantly generate an
                                                     interrupt from this module. (Generally used for testing
                                                     purposes).                                                                */

