AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4l_generic.h
    struct {
      __IOM uint32_t DSP0N0GPIO96 : 1;          /*!< GPIO96 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO97 : 1;          /*!< GPIO97 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO98 : 1;          /*!< GPIO98 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO99 : 1;          /*!< GPIO99 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO100 : 1;         /*!< GPIO100 DSP0 N0-priority interrupt.                                       */
      __IOM uint32_t DSP0N0GPIO101 : 1;         /*!< GPIO101 DSP0 N0-priority interrupt.                                       */
      __IOM uint32_t DSP0N0GPIO102 : 1;         /*!< GPIO102 DSP0 N0-priority interrupt.                                       */
      __IOM uint32_t DSP0N0GPIO103 : 1;         /*!< GPIO103 DSP0 N0-priority interrupt.                                       */
      __IOM uint32_t DSP0N0GPIO104 : 1;         /*!< GPIO104 DSP0 N0-priority interrupt.                                       */
      __IOM uint32_t DSP0N0GPIO105 : 1;         /*!< GPIO105 DSP0 N0-priority interrupt.                                       */
      __IOM uint32_t DSP0N0GPIO106 : 1;         /*!< GPIO106 DSP0 N0-priority interrupt.                                       */
      __IOM uint32_t DSP0N0GPIO107 : 1;         /*!< GPIO107 DSP0 N0-priority interrupt.                                       */
      __IOM uint32_t DSP0N0GPIO108 : 1;         /*!< GPIO108 DSP0 N0-priority interrupt.                                       */
      __IOM uint32_t DSP0N0GPIO109 : 1;         /*!< GPIO109 DSP0 N0-priority interrupt.                                       */
      __IOM uint32_t DSP0N0GPIO110 : 1;         /*!< GPIO110 DSP0 N0-priority interrupt.                                       */
      __IOM uint32_t DSP0N0GPIO111 : 1;         /*!< GPIO111 DSP0 N0-priority interrupt.                                       */
      __IOM uint32_t DSP0N0GPIO112 : 1;         /*!< GPIO112 DSP0 N0-priority interrupt.                                       */
      __IOM uint32_t DSP0N0GPIO113 : 1;         /*!< GPIO113 DSP0 N0-priority interrupt.                                       */
      __IOM uint32_t DSP0N0GPIO114 : 1;         /*!< GPIO114 DSP0 N0-priority interrupt.                                       */
      __IOM uint32_t DSP0N0GPIO115 : 1;         /*!< GPIO115 DSP0 N0-priority interrupt.                                       */
      __IOM uint32_t DSP0N0GPIO116 : 1;         /*!< GPIO116 DSP0 N0-priority interrupt.                                       */
      __IOM uint32_t DSP0N0GPIO117 : 1;         /*!< GPIO117 DSP0 N0-priority interrupt.                                       */
      __IOM uint32_t DSP0N0GPIO118 : 1;         /*!< GPIO118 DSP0 N0-priority interrupt.                                       */
      __IOM uint32_t DSP0N0GPIO119 : 1;         /*!< GPIO119 DSP0 N0-priority interrupt.                                       */
      __IOM uint32_t DSP0N0GPIO120 : 1;         /*!< GPIO120 DSP0 N0-priority interrupt.                                       */
      __IOM uint32_t DSP0N0GPIO121 : 1;         /*!< GPIO121 DSP0 N0-priority interrupt.                                       */
      __IOM uint32_t DSP0N0GPIO122 : 1;         /*!< GPIO122 DSP0 N0-priority interrupt.                                       */
      __IOM uint32_t DSP0N0GPIO123 : 1;         /*!< GPIO123 DSP0 N0-priority interrupt.                                       */
      __IOM uint32_t DSP0N0GPIO124 : 1;         /*!< GPIO124 DSP0 N0-priority interrupt.                                       */
      __IOM uint32_t DSP0N0GPIO125 : 1;         /*!< GPIO125 DSP0 N0-priority interrupt.                                       */
      __IOM uint32_t DSP0N0GPIO126 : 1;         /*!< GPIO126 DSP0 N0-priority interrupt.                                       */
      __IOM uint32_t DSP0N0GPIO127 : 1;         /*!< GPIO127 DSP0 N0-priority interrupt.                                       */
    } DSP0N0INT3SET_b;
  } ;

  union {
    __IOM uint32_t DSP0N1INT0EN;                /*!< Set bits in this register to allow this module to generate the
                                                     corresponding interrupt.                                                  */

    struct {
      __IOM uint32_t DSP0N1GPIO0 : 1;           /*!< GPIO0 DSP0 N1-priority interrupt.                                         */
      __IOM uint32_t DSP0N1GPIO1 : 1;           /*!< GPIO1 DSP0 N1-priority interrupt.                                         */
      __IOM uint32_t DSP0N1GPIO2 : 1;           /*!< GPIO2 DSP0 N1-priority interrupt.                                         */
      __IOM uint32_t DSP0N1GPIO3 : 1;           /*!< GPIO3 DSP0 N1-priority interrupt.                                         */
      __IOM uint32_t DSP0N1GPIO4 : 1;           /*!< GPIO4 DSP0 N1-priority interrupt.                                         */
      __IOM uint32_t DSP0N1GPIO5 : 1;           /*!< GPIO5 DSP0 N1-priority interrupt.                                         */
      __IOM uint32_t DSP0N1GPIO6 : 1;           /*!< GPIO6 DSP0 N1-priority interrupt.                                         */
      __IOM uint32_t DSP0N1GPIO7 : 1;           /*!< GPIO7 DSP0 N1-priority interrupt.                                         */
      __IOM uint32_t DSP0N1GPIO8 : 1;           /*!< GPIO8 DSP0 N1-priority interrupt.                                         */
      __IOM uint32_t DSP0N1GPIO9 : 1;           /*!< GPIO9 DSP0 N1-priority interrupt.                                         */
      __IOM uint32_t DSP0N1GPIO10 : 1;          /*!< GPIO10 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO11 : 1;          /*!< GPIO11 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO12 : 1;          /*!< GPIO12 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO13 : 1;          /*!< GPIO13 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO14 : 1;          /*!< GPIO14 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO15 : 1;          /*!< GPIO15 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO16 : 1;          /*!< GPIO16 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO17 : 1;          /*!< GPIO17 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO18 : 1;          /*!< GPIO18 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO19 : 1;          /*!< GPIO19 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO20 : 1;          /*!< GPIO20 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO21 : 1;          /*!< GPIO21 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO22 : 1;          /*!< GPIO22 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO23 : 1;          /*!< GPIO23 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO24 : 1;          /*!< GPIO24 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO25 : 1;          /*!< GPIO25 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO26 : 1;          /*!< GPIO26 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO27 : 1;          /*!< GPIO27 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO28 : 1;          /*!< GPIO28 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO29 : 1;          /*!< GPIO29 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO30 : 1;          /*!< GPIO30 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO31 : 1;          /*!< GPIO31 DSP0 N1-priority interrupt.                                        */
    } DSP0N1INT0EN_b;
  } ;

  union {
    __IOM uint32_t DSP0N1INT0STAT;              /*!< Read bits from this register to discover the cause of a recent
                                                     interrupt.                                                                */

