AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4l_generic.h
    struct {
      __IOM uint32_t DSP0N1GPIO64 : 1;          /*!< GPIO64 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO65 : 1;          /*!< GPIO65 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO66 : 1;          /*!< GPIO66 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO67 : 1;          /*!< GPIO67 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO68 : 1;          /*!< GPIO68 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO69 : 1;          /*!< GPIO69 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO70 : 1;          /*!< GPIO70 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO71 : 1;          /*!< GPIO71 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO72 : 1;          /*!< GPIO72 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO73 : 1;          /*!< GPIO73 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO74 : 1;          /*!< GPIO74 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO75 : 1;          /*!< GPIO75 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO76 : 1;          /*!< GPIO76 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO77 : 1;          /*!< GPIO77 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO78 : 1;          /*!< GPIO78 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO79 : 1;          /*!< GPIO79 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO80 : 1;          /*!< GPIO80 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO81 : 1;          /*!< GPIO81 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO82 : 1;          /*!< GPIO82 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO83 : 1;          /*!< GPIO83 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO84 : 1;          /*!< GPIO84 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO85 : 1;          /*!< GPIO85 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO86 : 1;          /*!< GPIO86 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO87 : 1;          /*!< GPIO87 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO88 : 1;          /*!< GPIO88 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO89 : 1;          /*!< GPIO89 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO90 : 1;          /*!< GPIO90 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO91 : 1;          /*!< GPIO91 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO92 : 1;          /*!< GPIO92 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO93 : 1;          /*!< GPIO93 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO94 : 1;          /*!< GPIO94 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO95 : 1;          /*!< GPIO95 DSP0 N1-priority interrupt.                                        */
    } DSP0N1INT2STAT_b;
  } ;

  union {
    __IOM uint32_t DSP0N1INT2CLR;               /*!< Write a 1 to a bit in this register to clear the interrupt status
                                                     associated with that bit.                                                 */

    struct {
      __IOM uint32_t DSP0N1GPIO64 : 1;          /*!< GPIO64 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO65 : 1;          /*!< GPIO65 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO66 : 1;          /*!< GPIO66 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO67 : 1;          /*!< GPIO67 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO68 : 1;          /*!< GPIO68 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO69 : 1;          /*!< GPIO69 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO70 : 1;          /*!< GPIO70 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO71 : 1;          /*!< GPIO71 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO72 : 1;          /*!< GPIO72 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO73 : 1;          /*!< GPIO73 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO74 : 1;          /*!< GPIO74 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO75 : 1;          /*!< GPIO75 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO76 : 1;          /*!< GPIO76 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO77 : 1;          /*!< GPIO77 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO78 : 1;          /*!< GPIO78 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO79 : 1;          /*!< GPIO79 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO80 : 1;          /*!< GPIO80 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO81 : 1;          /*!< GPIO81 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO82 : 1;          /*!< GPIO82 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO83 : 1;          /*!< GPIO83 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO84 : 1;          /*!< GPIO84 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO85 : 1;          /*!< GPIO85 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO86 : 1;          /*!< GPIO86 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO87 : 1;          /*!< GPIO87 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO88 : 1;          /*!< GPIO88 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO89 : 1;          /*!< GPIO89 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO90 : 1;          /*!< GPIO90 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO91 : 1;          /*!< GPIO91 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO92 : 1;          /*!< GPIO92 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO93 : 1;          /*!< GPIO93 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO94 : 1;          /*!< GPIO94 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO95 : 1;          /*!< GPIO95 DSP0 N1-priority interrupt.                                        */
    } DSP0N1INT2CLR_b;
  } ;

  union {
    __IOM uint32_t DSP0N1INT2SET;               /*!< Write a 1 to a bit in this register to instantly generate an
                                                     interrupt from this module. (Generally used for testing
                                                     purposes).                                                                */

