AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4l_generic.h
    struct {
      __IOM uint32_t DSP0N1GPIO64 : 1;          /*!< GPIO64 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO65 : 1;          /*!< GPIO65 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO66 : 1;          /*!< GPIO66 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO67 : 1;          /*!< GPIO67 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO68 : 1;          /*!< GPIO68 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO69 : 1;          /*!< GPIO69 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO70 : 1;          /*!< GPIO70 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO71 : 1;          /*!< GPIO71 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO72 : 1;          /*!< GPIO72 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO73 : 1;          /*!< GPIO73 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO74 : 1;          /*!< GPIO74 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO75 : 1;          /*!< GPIO75 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO76 : 1;          /*!< GPIO76 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO77 : 1;          /*!< GPIO77 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO78 : 1;          /*!< GPIO78 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO79 : 1;          /*!< GPIO79 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO80 : 1;          /*!< GPIO80 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO81 : 1;          /*!< GPIO81 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO82 : 1;          /*!< GPIO82 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO83 : 1;          /*!< GPIO83 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO84 : 1;          /*!< GPIO84 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO85 : 1;          /*!< GPIO85 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO86 : 1;          /*!< GPIO86 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO87 : 1;          /*!< GPIO87 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO88 : 1;          /*!< GPIO88 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO89 : 1;          /*!< GPIO89 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO90 : 1;          /*!< GPIO90 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO91 : 1;          /*!< GPIO91 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO92 : 1;          /*!< GPIO92 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO93 : 1;          /*!< GPIO93 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO94 : 1;          /*!< GPIO94 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO95 : 1;          /*!< GPIO95 DSP0 N1-priority interrupt.                                        */
    } DSP0N1INT2SET_b;
  } ;

  union {
    __IOM uint32_t DSP0N1INT3EN;                /*!< Set bits in this register to allow this module to generate the
                                                     corresponding interrupt.                                                  */

    struct {
      __IOM uint32_t DSP0N1GPIO96 : 1;          /*!< GPIO96 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO97 : 1;          /*!< GPIO97 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO98 : 1;          /*!< GPIO98 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO99 : 1;          /*!< GPIO99 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO100 : 1;         /*!< GPIO100 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO101 : 1;         /*!< GPIO101 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO102 : 1;         /*!< GPIO102 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO103 : 1;         /*!< GPIO103 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO104 : 1;         /*!< GPIO104 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO105 : 1;         /*!< GPIO105 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO106 : 1;         /*!< GPIO106 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO107 : 1;         /*!< GPIO107 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO108 : 1;         /*!< GPIO108 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO109 : 1;         /*!< GPIO109 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO110 : 1;         /*!< GPIO110 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO111 : 1;         /*!< GPIO111 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO112 : 1;         /*!< GPIO112 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO113 : 1;         /*!< GPIO113 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO114 : 1;         /*!< GPIO114 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO115 : 1;         /*!< GPIO115 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO116 : 1;         /*!< GPIO116 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO117 : 1;         /*!< GPIO117 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO118 : 1;         /*!< GPIO118 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO119 : 1;         /*!< GPIO119 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO120 : 1;         /*!< GPIO120 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO121 : 1;         /*!< GPIO121 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO122 : 1;         /*!< GPIO122 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO123 : 1;         /*!< GPIO123 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO124 : 1;         /*!< GPIO124 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO125 : 1;         /*!< GPIO125 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO126 : 1;         /*!< GPIO126 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO127 : 1;         /*!< GPIO127 DSP0 N1-priority interrupt.                                       */
    } DSP0N1INT3EN_b;
  } ;

  union {
    __IOM uint32_t DSP0N1INT3STAT;              /*!< Read bits from this register to discover the cause of a recent
                                                     interrupt.                                                                */

