AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4l_generic.h
    struct {
      __IOM uint32_t DSP0N1GPIO96 : 1;          /*!< GPIO96 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO97 : 1;          /*!< GPIO97 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO98 : 1;          /*!< GPIO98 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO99 : 1;          /*!< GPIO99 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO100 : 1;         /*!< GPIO100 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO101 : 1;         /*!< GPIO101 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO102 : 1;         /*!< GPIO102 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO103 : 1;         /*!< GPIO103 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO104 : 1;         /*!< GPIO104 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO105 : 1;         /*!< GPIO105 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO106 : 1;         /*!< GPIO106 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO107 : 1;         /*!< GPIO107 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO108 : 1;         /*!< GPIO108 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO109 : 1;         /*!< GPIO109 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO110 : 1;         /*!< GPIO110 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO111 : 1;         /*!< GPIO111 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO112 : 1;         /*!< GPIO112 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO113 : 1;         /*!< GPIO113 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO114 : 1;         /*!< GPIO114 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO115 : 1;         /*!< GPIO115 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO116 : 1;         /*!< GPIO116 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO117 : 1;         /*!< GPIO117 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO118 : 1;         /*!< GPIO118 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO119 : 1;         /*!< GPIO119 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO120 : 1;         /*!< GPIO120 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO121 : 1;         /*!< GPIO121 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO122 : 1;         /*!< GPIO122 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO123 : 1;         /*!< GPIO123 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO124 : 1;         /*!< GPIO124 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO125 : 1;         /*!< GPIO125 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO126 : 1;         /*!< GPIO126 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO127 : 1;         /*!< GPIO127 DSP0 N1-priority interrupt.                                       */
    } DSP0N1INT3STAT_b;
  } ;

  union {
    __IOM uint32_t DSP0N1INT3CLR;               /*!< Write a 1 to a bit in this register to clear the interrupt status
                                                     associated with that bit.                                                 */

    struct {
      __IOM uint32_t DSP0N1GPIO96 : 1;          /*!< GPIO96 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO97 : 1;          /*!< GPIO97 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO98 : 1;          /*!< GPIO98 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO99 : 1;          /*!< GPIO99 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO100 : 1;         /*!< GPIO100 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO101 : 1;         /*!< GPIO101 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO102 : 1;         /*!< GPIO102 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO103 : 1;         /*!< GPIO103 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO104 : 1;         /*!< GPIO104 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO105 : 1;         /*!< GPIO105 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO106 : 1;         /*!< GPIO106 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO107 : 1;         /*!< GPIO107 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO108 : 1;         /*!< GPIO108 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO109 : 1;         /*!< GPIO109 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO110 : 1;         /*!< GPIO110 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO111 : 1;         /*!< GPIO111 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO112 : 1;         /*!< GPIO112 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO113 : 1;         /*!< GPIO113 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO114 : 1;         /*!< GPIO114 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO115 : 1;         /*!< GPIO115 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO116 : 1;         /*!< GPIO116 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO117 : 1;         /*!< GPIO117 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO118 : 1;         /*!< GPIO118 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO119 : 1;         /*!< GPIO119 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO120 : 1;         /*!< GPIO120 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO121 : 1;         /*!< GPIO121 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO122 : 1;         /*!< GPIO122 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO123 : 1;         /*!< GPIO123 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO124 : 1;         /*!< GPIO124 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO125 : 1;         /*!< GPIO125 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO126 : 1;         /*!< GPIO126 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO127 : 1;         /*!< GPIO127 DSP0 N1-priority interrupt.                                       */
    } DSP0N1INT3CLR_b;
  } ;

  union {
    __IOM uint32_t DSP0N1INT3SET;               /*!< Write a 1 to a bit in this register to instantly generate an
                                                     interrupt from this module. (Generally used for testing
                                                     purposes).                                                                */

