AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4l_generic.h
    struct {
      __IOM uint32_t DSP0N1GPIO96 : 1;          /*!< GPIO96 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO97 : 1;          /*!< GPIO97 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO98 : 1;          /*!< GPIO98 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO99 : 1;          /*!< GPIO99 DSP0 N1-priority interrupt.                                        */
      __IOM uint32_t DSP0N1GPIO100 : 1;         /*!< GPIO100 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO101 : 1;         /*!< GPIO101 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO102 : 1;         /*!< GPIO102 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO103 : 1;         /*!< GPIO103 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO104 : 1;         /*!< GPIO104 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO105 : 1;         /*!< GPIO105 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO106 : 1;         /*!< GPIO106 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO107 : 1;         /*!< GPIO107 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO108 : 1;         /*!< GPIO108 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO109 : 1;         /*!< GPIO109 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO110 : 1;         /*!< GPIO110 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO111 : 1;         /*!< GPIO111 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO112 : 1;         /*!< GPIO112 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO113 : 1;         /*!< GPIO113 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO114 : 1;         /*!< GPIO114 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO115 : 1;         /*!< GPIO115 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO116 : 1;         /*!< GPIO116 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO117 : 1;         /*!< GPIO117 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO118 : 1;         /*!< GPIO118 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO119 : 1;         /*!< GPIO119 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO120 : 1;         /*!< GPIO120 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO121 : 1;         /*!< GPIO121 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO122 : 1;         /*!< GPIO122 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO123 : 1;         /*!< GPIO123 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO124 : 1;         /*!< GPIO124 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO125 : 1;         /*!< GPIO125 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO126 : 1;         /*!< GPIO126 DSP0 N1-priority interrupt.                                       */
      __IOM uint32_t DSP0N1GPIO127 : 1;         /*!< GPIO127 DSP0 N1-priority interrupt.                                       */
    } DSP0N1INT3SET_b;
  } ;

  union {
    __IOM uint32_t DSP1N0INT0EN;                /*!< Set bits in this register to allow this module to generate the
                                                     corresponding interrupt.                                                  */

    struct {
      __IOM uint32_t DSP1N0GPIO0 : 1;           /*!< GPIO0 DSP1 N0-priority interrupt.                                         */
      __IOM uint32_t DSP1N0GPIO1 : 1;           /*!< GPIO1 DSP1 N0-priority interrupt.                                         */
      __IOM uint32_t DSP1N0GPIO2 : 1;           /*!< GPIO2 DSP1 N0-priority interrupt.                                         */
      __IOM uint32_t DSP1N0GPIO3 : 1;           /*!< GPIO3 DSP1 N0-priority interrupt.                                         */
      __IOM uint32_t DSP1N0GPIO4 : 1;           /*!< GPIO4 DSP1 N0-priority interrupt.                                         */
      __IOM uint32_t DSP1N0GPIO5 : 1;           /*!< GPIO5 DSP1 N0-priority interrupt.                                         */
      __IOM uint32_t DSP1N0GPIO6 : 1;           /*!< GPIO6 DSP1 N0-priority interrupt.                                         */
      __IOM uint32_t DSP1N0GPIO7 : 1;           /*!< GPIO7 DSP1 N0-priority interrupt.                                         */
      __IOM uint32_t DSP1N0GPIO8 : 1;           /*!< GPIO8 DSP1 N0-priority interrupt.                                         */
      __IOM uint32_t DSP1N0GPIO9 : 1;           /*!< GPIO9 DSP1 N0-priority interrupt.                                         */
      __IOM uint32_t DSP1N0GPIO10 : 1;          /*!< GPIO10 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO11 : 1;          /*!< GPIO11 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO12 : 1;          /*!< GPIO12 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO13 : 1;          /*!< GPIO13 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO14 : 1;          /*!< GPIO14 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO15 : 1;          /*!< GPIO15 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO16 : 1;          /*!< GPIO16 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO17 : 1;          /*!< GPIO17 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO18 : 1;          /*!< GPIO18 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO19 : 1;          /*!< GPIO19 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO20 : 1;          /*!< GPIO20 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO21 : 1;          /*!< GPIO21 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO22 : 1;          /*!< GPIO22 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO23 : 1;          /*!< GPIO23 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO24 : 1;          /*!< GPIO24 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO25 : 1;          /*!< GPIO25 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO26 : 1;          /*!< GPIO26 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO27 : 1;          /*!< GPIO27 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO28 : 1;          /*!< GPIO28 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO29 : 1;          /*!< GPIO29 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO30 : 1;          /*!< GPIO30 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO31 : 1;          /*!< GPIO31 DSP1 N0-priority interrupt.                                        */
    } DSP1N0INT0EN_b;
  } ;

  union {
    __IOM uint32_t DSP1N0INT0STAT;              /*!< Read bits from this register to discover the cause of a recent
                                                     interrupt.                                                                */

