AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4l_generic.h
    struct {
      __IOM uint32_t DSP1N1GPIO0 : 1;           /*!< GPIO0 DSP1 N1-priority interrupt.                                         */
      __IOM uint32_t DSP1N1GPIO1 : 1;           /*!< GPIO1 DSP1 N1-priority interrupt.                                         */
      __IOM uint32_t DSP1N1GPIO2 : 1;           /*!< GPIO2 DSP1 N1-priority interrupt.                                         */
      __IOM uint32_t DSP1N1GPIO3 : 1;           /*!< GPIO3 DSP1 N1-priority interrupt.                                         */
      __IOM uint32_t DSP1N1GPIO4 : 1;           /*!< GPIO4 DSP1 N1-priority interrupt.                                         */
      __IOM uint32_t DSP1N1GPIO5 : 1;           /*!< GPIO5 DSP1 N1-priority interrupt.                                         */
      __IOM uint32_t DSP1N1GPIO6 : 1;           /*!< GPIO6 DSP1 N1-priority interrupt.                                         */
      __IOM uint32_t DSP1N1GPIO7 : 1;           /*!< GPIO7 DSP1 N1-priority interrupt.                                         */
      __IOM uint32_t DSP1N1GPIO8 : 1;           /*!< GPIO8 DSP1 N1-priority interrupt.                                         */
      __IOM uint32_t DSP1N1GPIO9 : 1;           /*!< GPIO9 DSP1 N1-priority interrupt.                                         */
      __IOM uint32_t DSP1N1GPIO10 : 1;          /*!< GPIO10 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO11 : 1;          /*!< GPIO11 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO12 : 1;          /*!< GPIO12 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO13 : 1;          /*!< GPIO13 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO14 : 1;          /*!< GPIO14 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO15 : 1;          /*!< GPIO15 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO16 : 1;          /*!< GPIO16 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO17 : 1;          /*!< GPIO17 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO18 : 1;          /*!< GPIO18 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO19 : 1;          /*!< GPIO19 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO20 : 1;          /*!< GPIO20 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO21 : 1;          /*!< GPIO21 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO22 : 1;          /*!< GPIO22 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO23 : 1;          /*!< GPIO23 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO24 : 1;          /*!< GPIO24 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO25 : 1;          /*!< GPIO25 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO26 : 1;          /*!< GPIO26 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO27 : 1;          /*!< GPIO27 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO28 : 1;          /*!< GPIO28 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO29 : 1;          /*!< GPIO29 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO30 : 1;          /*!< GPIO30 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO31 : 1;          /*!< GPIO31 DSP1 N1-priority interrupt.                                        */
    } DSP1N1INT0STAT_b;
  } ;

  union {
    __IOM uint32_t DSP1N1INT0CLR;               /*!< Write a 1 to a bit in this register to clear the interrupt status
                                                     associated with that bit.                                                 */

    struct {
      __IOM uint32_t DSP1N1GPIO0 : 1;           /*!< GPIO0 DSP1 N1-priority interrupt.                                         */
      __IOM uint32_t DSP1N1GPIO1 : 1;           /*!< GPIO1 DSP1 N1-priority interrupt.                                         */
      __IOM uint32_t DSP1N1GPIO2 : 1;           /*!< GPIO2 DSP1 N1-priority interrupt.                                         */
      __IOM uint32_t DSP1N1GPIO3 : 1;           /*!< GPIO3 DSP1 N1-priority interrupt.                                         */
      __IOM uint32_t DSP1N1GPIO4 : 1;           /*!< GPIO4 DSP1 N1-priority interrupt.                                         */
      __IOM uint32_t DSP1N1GPIO5 : 1;           /*!< GPIO5 DSP1 N1-priority interrupt.                                         */
      __IOM uint32_t DSP1N1GPIO6 : 1;           /*!< GPIO6 DSP1 N1-priority interrupt.                                         */
      __IOM uint32_t DSP1N1GPIO7 : 1;           /*!< GPIO7 DSP1 N1-priority interrupt.                                         */
      __IOM uint32_t DSP1N1GPIO8 : 1;           /*!< GPIO8 DSP1 N1-priority interrupt.                                         */
      __IOM uint32_t DSP1N1GPIO9 : 1;           /*!< GPIO9 DSP1 N1-priority interrupt.                                         */
      __IOM uint32_t DSP1N1GPIO10 : 1;          /*!< GPIO10 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO11 : 1;          /*!< GPIO11 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO12 : 1;          /*!< GPIO12 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO13 : 1;          /*!< GPIO13 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO14 : 1;          /*!< GPIO14 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO15 : 1;          /*!< GPIO15 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO16 : 1;          /*!< GPIO16 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO17 : 1;          /*!< GPIO17 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO18 : 1;          /*!< GPIO18 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO19 : 1;          /*!< GPIO19 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO20 : 1;          /*!< GPIO20 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO21 : 1;          /*!< GPIO21 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO22 : 1;          /*!< GPIO22 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO23 : 1;          /*!< GPIO23 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO24 : 1;          /*!< GPIO24 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO25 : 1;          /*!< GPIO25 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO26 : 1;          /*!< GPIO26 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO27 : 1;          /*!< GPIO27 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO28 : 1;          /*!< GPIO28 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO29 : 1;          /*!< GPIO29 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO30 : 1;          /*!< GPIO30 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO31 : 1;          /*!< GPIO31 DSP1 N1-priority interrupt.                                        */
    } DSP1N1INT0CLR_b;
  } ;

  union {
    __IOM uint32_t DSP1N1INT0SET;               /*!< Write a 1 to a bit in this register to instantly generate an
                                                     interrupt from this module. (Generally used for testing
                                                     purposes).                                                                */

