AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4l_generic.h
    struct {
      __IOM uint32_t DSP1N1GPIO32 : 1;          /*!< GPIO32 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO33 : 1;          /*!< GPIO33 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO34 : 1;          /*!< GPIO34 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO35 : 1;          /*!< GPIO35 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO36 : 1;          /*!< GPIO36 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO37 : 1;          /*!< GPIO37 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO38 : 1;          /*!< GPIO38 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO39 : 1;          /*!< GPIO39 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO40 : 1;          /*!< GPIO40 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO41 : 1;          /*!< GPIO41 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO42 : 1;          /*!< GPIO42 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO43 : 1;          /*!< GPIO43 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO44 : 1;          /*!< GPIO44 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO45 : 1;          /*!< GPIO45 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO46 : 1;          /*!< GPIO46 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO47 : 1;          /*!< GPIO47 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO48 : 1;          /*!< GPIO48 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO49 : 1;          /*!< GPIO49 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO50 : 1;          /*!< GPIO50 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO51 : 1;          /*!< GPIO51 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO52 : 1;          /*!< GPIO52 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO53 : 1;          /*!< GPIO53 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO54 : 1;          /*!< GPIO54 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO55 : 1;          /*!< GPIO55 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO56 : 1;          /*!< GPIO56 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO57 : 1;          /*!< GPIO57 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO58 : 1;          /*!< GPIO58 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO59 : 1;          /*!< GPIO59 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO60 : 1;          /*!< GPIO60 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO61 : 1;          /*!< GPIO61 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO62 : 1;          /*!< GPIO62 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO63 : 1;          /*!< GPIO63 DSP1 N1-priority interrupt.                                        */
    } DSP1N1INT1SET_b;
  } ;

  union {
    __IOM uint32_t DSP1N1INT2EN;                /*!< Set bits in this register to allow this module to generate the
                                                     corresponding interrupt.                                                  */

    struct {
      __IOM uint32_t DSP1N1GPIO64 : 1;          /*!< GPIO64 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO65 : 1;          /*!< GPIO65 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO66 : 1;          /*!< GPIO66 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO67 : 1;          /*!< GPIO67 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO68 : 1;          /*!< GPIO68 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO69 : 1;          /*!< GPIO69 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO70 : 1;          /*!< GPIO70 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO71 : 1;          /*!< GPIO71 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO72 : 1;          /*!< GPIO72 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO73 : 1;          /*!< GPIO73 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO74 : 1;          /*!< GPIO74 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO75 : 1;          /*!< GPIO75 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO76 : 1;          /*!< GPIO76 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO77 : 1;          /*!< GPIO77 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO78 : 1;          /*!< GPIO78 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO79 : 1;          /*!< GPIO79 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO80 : 1;          /*!< GPIO80 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO81 : 1;          /*!< GPIO81 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO82 : 1;          /*!< GPIO82 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO83 : 1;          /*!< GPIO83 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO84 : 1;          /*!< GPIO84 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO85 : 1;          /*!< GPIO85 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO86 : 1;          /*!< GPIO86 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO87 : 1;          /*!< GPIO87 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO88 : 1;          /*!< GPIO88 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO89 : 1;          /*!< GPIO89 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO90 : 1;          /*!< GPIO90 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO91 : 1;          /*!< GPIO91 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO92 : 1;          /*!< GPIO92 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO93 : 1;          /*!< GPIO93 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO94 : 1;          /*!< GPIO94 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO95 : 1;          /*!< GPIO95 DSP1 N1-priority interrupt.                                        */
    } DSP1N1INT2EN_b;
  } ;

  union {
    __IOM uint32_t DSP1N1INT2STAT;              /*!< Read bits from this register to discover the cause of a recent
                                                     interrupt.                                                                */

