AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4l_generic.h
    struct {
      __IOM uint32_t SIZE       : 32;           /*!< Size of the transmit FIFO in units of I2S samples. Read only
                                                     value.                                                                    */
    } TXFIFOSIZE_b;
  } ;

  union {
    __IOM uint32_t TXLOWERLIMIT;                /*!< Minimum number of samples have been reached in the transmit
                                                     FIFO.                                                                     */

    struct {
      __IOM uint32_t SIZE       : 32;           /*!< When the number of sample in the TX FIFO goes below this value,
                                                     the interrupt TX_FFi bit is asserted.                                     */
    } TXLOWERLIMIT_b;
  } ;
  __IM  uint32_t  RESERVED1[3];

  union {
    __IOM uint32_t I2SDATACFG;                  /*!< Specifies the data format of I2S sub frames                               */

    struct {
      __IOM uint32_t SSZ1       : 3;            /*!< Receive audio sample length for phase 1. 0: 8b, 2: 16b, 4: 24b,
                                                     5: 32b, 1,3,6,7: Reserved                                                 */
      __IOM uint32_t JUST       : 1;            /*!< Audio sample justification. 0: Left-justified, 1: Right-justified         */
            uint32_t            : 1;
      __IOM uint32_t WDLEN1     : 3;            /*!< Receive channel length in bits for phase 1. 0: 8b, 2: 16b, 4:
                                                     24b, 5: 32b, 1,3,6,7: Reserved                                            */
      __IOM uint32_t FRLEN1     : 7;            /*!< Number of channels in phase 1; 0: 1 Channel in phase 2, .. 0x7:
                                                     8 channels in phase 1                                                     */
            uint32_t            : 1;
      __IOM uint32_t SSZ2       : 3;            /*!< Receive audio sample length for phase 2. 0: 8b, 2: 16b, 4: 24b,
                                                     5: 32b, 1,3,6,7: Reserved                                                 */
      __IOM uint32_t DATADLY    : 2;            /*!< Receive data delay bit count. Valid values are 0-2, 3 is reserved.        */
      __IOM uint32_t WDLEN2     : 3;            /*!< Receive channel length in bits for phase 2. 0: 8b, 2: 16b, 4:
                                                     24b, 5: 32b, 1,3,6,7: Reserved                                            */
      __IOM uint32_t FRLEN2     : 7;            /*!< Number of channels in phase 2; 0: 1 Channel in phase 2, .. 0x7:
                                                     8 channels in phase 2                                                     */
      __IOM uint32_t PH         : 1;            /*!< Read Phase Bit. 0: Single Phase frame; 1: Dual-Phase frame.               */
    } I2SDATACFG_b;
  } ;

  union {
    __IOM uint32_t I2SIOCFG;                    /*!< Specified polarity and clock configuration of the I2S IPB clocks
                                                     and IO signals                                                            */

    struct {
      __IOM uint32_t OEN        : 1;            /*!< Output enable for SDATA output                                            */
            uint32_t            : 3;
      __IOM uint32_t FPER       : 12;           /*!< Frame period in units of sclk. Period is FPER + 1 sclks in length.
                                                     0: 1 sclk, 0x3F: 64 sclks                                                 */
      __IOM uint32_t FSP        : 1;            /*!< Polarity of fsync/lr_clk signal. 0: Active high. 1: Active low            */
      __IOM uint32_t PRTX       : 1;            /*!< Transmit clock edge polarity bit. 0: sdata is transmitted starting
                                                     from the falling edge of sclk. 1: sdata is transmitted
                                                     starting from the rising edge of sclk.                                    */
      __IOM uint32_t MSL        : 1;            /*!< Master/Slave clock configuration. 0: External clock(sclk and
                                                     lr_clk provided externally). 1: Internal clock (sclk and
                                                     lr_clk sourced internally).                                               */
      __IOM uint32_t PRx        : 1;            /*!< Receive clock edge polarity bit. 0: sdata is sampled on the
                                                     rising edge of sclk. 1: sdata is sampled on the falling
                                                     edge of sclk.                                                             */
      __IOM uint32_t FWID       : 8;            /*!< period of fsync/lr_clk in units of sclks                                  */
            uint32_t            : 4;
    } I2SIOCFG_b;
  } ;

  union {
    __IOM uint32_t I2SCTL;                      /*!< Specified polarity and clock configuration of the I2S IPB clocks
                                                     and IO signals                                                            */

    struct {
      __IOM uint32_t TXEN       : 1;            /*!< Transmit enable signal. 1 will enable the transmission of serial
                                                     audio. For Full duplex operation, RXEN and TXEN MUST be
                                                     set in a single register write access, or the Slave FSM
                                                     may ignore one of the bit-field read-modify-write accesses.
                                                     TXRST and RXRST must be cleared in advance.                               */
      __IOM uint32_t TXRST      : 1;            /*!< Transmit reset signal. 1 will reset the TX side registers and
                                                     flush the TX FIFO.                                                        */
            uint32_t            : 2;
      __IOM uint32_t RXEN       : 1;            /*!< Receive enable control. 1: Enables capture of serial audio,
                                                     starting with first channel. 0: No receive data captured.
                                                     For Full duplex operation, RXEN and TXEN MUST be set in
                                                     a single register write access, or the Slave FSM may ignore
                                                     one of the bit-field read-modify-write accesses. TXRST
                                                     and RXRST must be cleared in advance.                                     */
      __IOM uint32_t RXRST      : 1;            /*!< Active high receiver reset signal. 1: Flush the RX FIFO                   */
            uint32_t            : 25;
      __IOM uint32_t I2SVAL     : 1;            /*!< I2S validity bit mode. 1: RX data stored only when validity
                                                     mask condition is asserted. 0: No validity mask conditions
                                                     checking is done.                                                         */
    } I2SCTL_b;
  } ;

  union {
    __IOM uint32_t IPBIRPT;                     /*!< Additional mask and status registers for the IPB core.                    */

