AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4l_generic.h
    struct {
      __IOM uint32_t IPB        : 1;            /*!< Interrupt from I2S module                                                 */
      __IOM uint32_t RXREQCNT   : 1;            /*!< The I2S module has completed RXREQCNT number of DMA transfers
                                                     of size 8 samples. This interrupt allows servicing of buffers
                                                     at a programmable location within the overall DMA transfer.               */
      __IOM uint32_t TXREQCNT   : 1;            /*!< The I2S module has asserted the dma read request, based on TX
                                                     fifo level.                                                               */
      __IOM uint32_t TXDMACPL   : 1;            /*!< A TX dma operation has completed                                          */
      __IOM uint32_t RXDMACPL   : 1;            /*!< A RX dma operation has completed                                          */
            uint32_t            : 27;
    } INTSET_b;
  } ;
  __IM  uint32_t  RESERVED6[60];

  union {
    __IOM uint32_t I2SDBG;                      /*!< Debug control                                                             */

    struct {
      __IOM uint32_t DBGEN      : 1;            /*!< Debug Enable. Setting bit will enable the update of data within
                                                     this register, otherwise it is clock gated for power savings              */
      __IOM uint32_t MCLKON     : 1;            /*!< MCLK debug clock control. Enable MCLK to be active when this
                                                     bit is '1'. Otherwise, the clock is controlled with gating
                                                     from the logic as needed.                                                 */
      __IOM uint32_t APBCLKON   : 1;            /*!< APBCLK debug clock control. Enable APB_CLK to be active when
                                                     this bit is '1'. Otherwise, the clock is controlled with
                                                     gating from the logic as needed.                                          */
      __IOM uint32_t DBGDATA    : 29;           /*!< Debug control for various options. DBGDATA[1:0] is used to select
                                                     between different debug data available in the DBG0 and
                                                     DBG1 registers.                                                           */
    } I2SDBG_b;
  } ;
} I2S0_Type;                                    /*!< Size = 1028 (0x404)                                                       */



/* =========================================================================================================================== */
/* ================                                           IOM0                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief IO Peripheral Master (IOM0)
  */

typedef struct {                                /*!< IOM0 Structure                                                            */

  union {
    __IOM uint32_t FIFO;                        /*!< Provides direct random access to both input and output fifos.
                                                     The state of the FIFO is not distured by reading these
                                                     locations (ie no POP will be done). FIFO0 is accessible
                                                     from addresses 0x0 - 0x1C, and is used for data outuput
                                                     from the IOM to external devices. These FIFO locations
                                                     can be read and written directly.FIFO locations 0x20 -
                                                     0x3C provide read only access to the input fifo. These
                                                     FIFO locations cannot be directly written by the MCU, and
                                                     are updated only by the internal hardware. Writes to the
                                                     FIFO0 will take effect immediately. The currently FIFO
                                                     pointersin register FIFOLOC indicate the current offset
                                                     into each FIFO0 for the read and write operations.Access
                                                     to the FIFOs can only be done in word increments; Byte
                                                     access and writes are not supported.For push and pop style
                                                     access to FIFO0 can be done using the FIFOPOP and FIFOPUSH
                                                     registers below.                                                          */

    struct {
      __IOM uint32_t FIFO       : 32;           /*!< FIFO direct access. Only locations 0 - 3F will return valid
                                                     information.                                                              */
    } FIFO_b;
  } ;
  __IM  uint32_t  RESERVED[63];

  union {
    __IOM uint32_t FIFOPTR;                     /*!< Provides the current valid byte count of data within the FIFO
                                                     as seen from the internal state machines. FIFO0 is dedicated
                                                     to outgoing transactions and FIFO1 is dedicated to incoming
                                                     transactions. All counts are specified in units of bytes.                 */

    struct {
      __IOM uint32_t FIFO0SIZ   : 8;            /*!< The number of valid data bytes currently in the FIFO 0 (written
                                                     by MCU, read by interface)                                                */
      __IOM uint32_t FIFO0REM   : 8;            /*!< The number of remaining data bytes slots currently in FIFO 0
                                                     (written by MCU, read by interface)                                       */
      __IOM uint32_t FIFO1SIZ   : 8;            /*!< The number of valid data bytes currently in FIFO 1 (written
                                                     by interface, read by MCU)                                                */
      __IOM uint32_t FIFO1REM   : 8;            /*!< The number of remaining data bytes slots currently in FIFO 1
                                                     (written by interface, read by MCU)                                       */
    } FIFOPTR_b;
  } ;

  union {
    __IOM uint32_t FIFOTHR;                     /*!< Sets the threshold values for incoming and outgoing transactions.
                                                     The threshold values are used to assert the interrupt if
                                                     enabled, and also used during DMA to set the transfer size
                                                     as a result of DMATHR trigger.The WTHR is used to indicate
                                                     when there are more than WTHR bytes of open fifo locations
                                                     available in the outgoing FIFO (FIFO0). The intended use
                                                     to invoke an interrupt or DMA transfer that will refill
                                                     the FIFO with a byte count up to this value.The RTHR is
                                                     used to indicate when there are more than RTHR bytes in
                                                     the incoming FIFO (FIFO1) and a data transfer of this size
                                                     can be supported, either through direct POP of the FIFO,
                                                     or through DMA.The value of both RTHR and WTHR are also
                                                     used to set the data transfer size of DMA operations if
                                                     DMATHR trigger is enabled.                                                */

