AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4l_generic.h
    struct {
      __IOM uint32_t FIFOWPTR   : 4;            /*!< Current FIFO write pointer. Value is the index into the outgoing
                                                     FIFO (FIFO0), which is used during write operations to
                                                     external devices.                                                         */
            uint32_t            : 4;
      __IOM uint32_t FIFORPTR   : 4;            /*!< Current FIFO read pointer. Used to index into the incoming FIFO
                                                     (FIFO1), which is used to store read data returned from
                                                     external devices during a read operation.                                 */
            uint32_t            : 20;
    } FIFOLOC_b;
  } ;

  union {
    __IOM uint32_t CLKCFG;                      /*!< Provides clock related controls used internal to the BLEIF module,
                                                     and enablement of 32KHz clock to the BLE Core module. The
                                                     internal clock sourced is selected via the FSEL and can
                                                     be further divided by 3 using the DIV3 control.This register
                                                     is also used to enable the clock, which must be done prior
                                                     to performing any IO transactions.                                        */

    struct {
      __IOM uint32_t IOCLKEN    : 1;            /*!< Enable for the interface clock. Must be enabled prior to executing
                                                     any IO operations.                                                        */
            uint32_t            : 7;
      __IOM uint32_t FSEL       : 3;            /*!< Select the input clock frequency.                                         */
      __IOM uint32_t DIV3       : 1;            /*!< Enable divide by 3 of the source IOCLK. Division by 3 is done
                                                     before the DIVEN programmable divider, and if enabledwill
                                                     provide the divided by 3 clock as the source to the programmable
                                                     divider.                                                                  */
      __IOM uint32_t DIVEN      : 1;            /*!< Enable clock division by TOTPER and LOWPER                                */
            uint32_t            : 3;
      __IOM uint32_t LOWPER     : 8;            /*!< Clock low clock count minus 1. This provides the number of clocks
                                                     the divided clock will be low when the DIVEN = 1.Only applicable
                                                     when DIVEN = 1.                                                           */
      __IOM uint32_t TOTPER     : 8;            /*!< Clock total clock count minus 1. This provides the total period
                                                     of the divided clock -1 when the DIVEN is active. Thesource
                                                     clock is selected by FSEL. Only applicable when DIVEN =
                                                     1.                                                                        */
    } CLKCFG_b;
  } ;

  union {
    __IOM uint32_t SUBMODCTRL;                  /*!< Provides enable for each submodule. Only a sigle submodule can
                                                     be enabled at one time.                                                   */

    struct {
      __IOM uint32_t SMOD0EN    : 1;            /*!< Submodule 0 enable (1) or disable (0)                                     */
      __IOM uint32_t SMOD0TYPE  : 3;            /*!< Submodule 0 module type. This is the SPI Master interface.                */
      __IOM uint32_t SMOD1EN    : 1;            /*!< Submodule 1 enable (1) or disable (0)                                     */
      __IOM uint32_t SMOD1TYPE  : 3;            /*!< Submodule 1 module type. This is the I2C Master interface                 */
      __IOM uint32_t SMOD2EN    : 1;            /*!< Submodule 2 enable (1) or disable (0)                                     */
      __IOM uint32_t SMOD2TYPE  : 3;            /*!< Submodule 2 module type. This is the I2S Master/Slave interface           */
            uint32_t            : 20;
    } SUBMODCTRL_b;
  } ;

  union {
    __IOM uint32_t CMD;                         /*!< Writes to this register will start an IO transaction, as well
                                                     as set various parameters for the command itself. Reads
                                                     will return the command value written to the CMD register.To
                                                     read the number of bytes that have yet to be transferred,
                                                     refer to the CTSIZE field within the CMDSTAT register.                    */

    struct {
      __IOM uint32_t CMD        : 4;            /*!< Command for submodule.                                                    */
      __IOM uint32_t OFFSETCNT  : 3;            /*!< Number of offset bytes to use for the command - 0, 1, 2, 3,
                                                     4, 5 are valid selections. The second (byte 1),third (byte
                                                     2), and forth (byte 3) are read from the OFFSETHI register,
                                                     and the low order byte is pulled from this register in
                                                     the OFFSETLO field.Offset bytes are transmitted highest
                                                     byte first. EG if offsetcnt == 4, OFFSETHI[23:16] will
                                                     be transmitted first, then OFFSETHI[15:8], then OFFSETHI[7:0]
                                                     then OFFSETLO.If offsetcnt == 5, OFFSETHI[31:24] will be
                                                     transmitted, then OFFSETHI[23:0], then OFFSETLO.If offsetcnt
                                                     == 4, OFFSETHI[23:16] will be transmitted, then OFFSETHI[15:0],
                                                     then OFFSETLO.If offsetcnt == 3, OFFSETHI[15:8] will be
                                                     transmitted, then OFFSETHI[7:0], then OFFSETLO.If offsetcnt
                                                     == 2, OFFSETHI[7:0] will be transmitted, then OFFSETLO.If
                                                     offsetcnt == 1, only OFFSETLO will be transmitted.Offset
                                                     bytes are always transmitted MSB first, regardless of the
                                                     value of the LSB control bit within the module configuration.             */
      __IOM uint32_t CONT       : 1;            /*!< Contine to hold the bus after the current transaction if set
                                                     to a 1 with a new command issued.                                         */
      __IOM uint32_t TSIZE      : 12;           /*!< Defines the transaction size in bytes. The offset transfer is
                                                     not included in this size.                                                */
      __IOM uint32_t CMDSEL     : 2;            /*!< Command Specific selection information. Not used in Master I2C.
                                                     Used as CEn select for Master SPI transactions                            */
            uint32_t            : 2;
      __IOM uint32_t OFFSETLO   : 8;            /*!< This register holds the low order byte of offset to be used
                                                     in the transaction. The number of offset bytes to use is
                                                     set with bits 1:0 of the command.                                         */
    } CMD_b;
  } ;

  union {
    __IOM uint32_t DCXCTRL;                     /*!< Enables transmission of DCX signal with SPI transactions and
                                                     selects which CE signals will be used to transmit the DCX
                                                     signal.                                                                   */

