AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4l_generic.h
    struct {
      __IOM uint32_t DCXSEL     : 4;            /*!< Selects the CE channel used to convey the DCX function. The
                                                     select is bitwise encoded, with bit 0 = 1 enabling CE0
                                                     for DCX transmission, bit 1 = 1 enableing CE1 for DCX transmission,
                                                     etc. If the CE used for the SPI transaction is set, it
                                                     will be ignored and used as the transaction CE instead.
                                                     Multiple CE channels can be selected at once. To enable
                                                     the DCX signal to be transmitted out of the chip, the corresponding
                                                     pin mux function must be enabled in the GPIO logic as well.               */
      __IOM uint32_t DCXEN      : 1;            /*!< Global enable of the DCX function. Setting to 1 will enable
                                                     the generation of the DCX signal, which will assert when
                                                     sending the offset bytes of the SPI transaction.                          */
            uint32_t            : 27;
    } DCXCTRL_b;
  } ;

  union {
    __IOM uint32_t OFFSETHI;                    /*!< High order bytes of offset for IO transaction                             */

    struct {
      __IOM uint32_t OFFSETHI   : 32;           /*!< Holds the high order bytes of the byte addressing/offset field
                                                     to use with IO commands. The number of offset bytes to
                                                     use is specified in the command register                                  */
    } OFFSETHI_b;
  } ;

  union {
    __IOM uint32_t CMDSTAT;                     /*!< Provides staus on the execution of the command currently in
                                                     progress. The fields in this register will reflect the
                                                     real time status of the internal state machines and data
                                                     transfers within the IOM.These are read only fields and
                                                     writes to the registers are ignored.                                      */

    struct {
      __IOM uint32_t CCMD       : 5;            /*!< current command that is being executed                                    */
      __IOM uint32_t CMDSTAT    : 3;            /*!< The current status of the command execution.                              */
      __IOM uint32_t CTSIZE     : 12;           /*!< The current number of bytes still to be transferred with this
                                                     command. This field will count down to zero.                              */
            uint32_t            : 12;
    } CMDSTAT_b;
  } ;
  __IM  uint32_t  RESERVED1[52];

  union {
    __IOM uint32_t INTEN;                       /*!< Set bits in this register to allow this module to generate the
                                                     corresponding interrupt.                                                  */

    struct {
      __IOM uint32_t CMDCMP     : 1;            /*!< Command Complete interrupt. Asserted when the current operation
                                                     has completed. For repeated commands, this will only be
                                                     asserted when the final repeated command is completed.                    */
      __IOM uint32_t THR        : 1;            /*!< FIFO Threshold interrupt. For write operations, asserted when
                                                     the number of free bytes in the write FIFO equals or exceeds
                                                     the WTHR field.For read operations, asserted when the number
                                                     of valid bytes in the read FIFO equals of exceeds the value
                                                     set in the RTHR field.                                                    */
      __IOM uint32_t FUNDFL     : 1;            /*!< Read FIFO Underflow interrupt. This occurs when software tries
                                                     to pop from an empty fifo.                                                */
      __IOM uint32_t FOVFL      : 1;            /*!< Write FIFO Overflow interrupt. This occurs when software tries
                                                     to write to a full fifo. The current operation does not
                                                     stop.                                                                     */
      __IOM uint32_t NAK        : 1;            /*!< I2C NAK interrupt. Asserted when an unexpected NAK has been
                                                     received on the I2C bus.                                                  */
      __IOM uint32_t IACC       : 1;            /*!< illegal FIFO access interrupt. Asserted when there is a overflow
                                                     or underflow event                                                        */
      __IOM uint32_t ICMD       : 1;            /*!< illegal command interrupt. Asserted when a command is written
                                                     when an active command is in progress.                                    */
      __IOM uint32_t START      : 1;            /*!< START command interrupt. Asserted when another master on the
                                                     bus has signaled a START command.                                         */
      __IOM uint32_t STOP       : 1;            /*!< STOP command interrupt. Asserted when another master on the
                                                     bus has signaled a STOP command.                                          */
      __IOM uint32_t ARB        : 1;            /*!< Arbitration loss interrupt. Asserted when arbitration is enabled
                                                     and has been lost to another master on the bus.                           */
      __IOM uint32_t DCMP       : 1;            /*!< DMA Complete. Processing of the DMA operation has completed
                                                     and the DMA submodule is returned into the idle state                     */
      __IOM uint32_t DERR       : 1;            /*!< DMA Error encountered during the processing of the DMA command.
                                                     The DMA error could occur when the memory access specified
                                                     in the DMA operation is not available or incorrectly specified.           */
      __IOM uint32_t CQPAUSED   : 1;            /*!< Command queue is paused due to an active event enabled in the
                                                     PAUSEEN register. The interrupt is posted when the event
                                                     is enabled within the PAUSEEN register, the mask is active
                                                     in the CQIRQMASK field and the event occurs.                              */
      __IOM uint32_t CQUPD      : 1;            /*!< CQ write operation performed a register write with the register
                                                     address bit 0 set to 1. The low address bits in the CQ
                                                     address fields are unused and bit 0 can be used to trigger
                                                     an interrupt to indicate when this register write is performed
                                                     by the CQ operation.                                                      */
      __IOM uint32_t CQERR      : 1;            /*!< Error during command queue operations                                     */
            uint32_t            : 17;
    } INTEN_b;
  } ;

  union {
    __IOM uint32_t INTSTAT;                     /*!< Read bits from this register to discover the cause of a recent
                                                     interrupt.                                                                */

