AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4l_generic.h
    struct {
      __IOM uint32_t FSIZE      : 1;            /*!< FIFO Size interrupt.                                                      */
      __IOM uint32_t FOVFL      : 1;            /*!< FIFO Overflow interrupt.                                                  */
      __IOM uint32_t FUNDFL     : 1;            /*!< FIFO Underflow interrupt.                                                 */
      __IOM uint32_t FRDERR     : 1;            /*!< FIFO Read Error interrupt.                                                */
      __IOM uint32_t GENAD      : 1;            /*!< I2C General Address interrupt.                                            */
      __IOM uint32_t IOINTW     : 1;            /*!< IO Write interrupt.                                                       */
      __IOM uint32_t XCMPRF     : 1;            /*!< Transfer complete interrupt, read from FIFO space.                        */
      __IOM uint32_t XCMPRR     : 1;            /*!< Transfer complete interrupt, read from register space.                    */
      __IOM uint32_t XCMPWF     : 1;            /*!< Transfer complete interrupt, write to FIFO space.                         */
      __IOM uint32_t XCMPWR     : 1;            /*!< Transfer complete interrupt, write to register space.                     */
            uint32_t            : 22;
    } INTSTAT_b;
  } ;

  union {
    __IOM uint32_t INTCLR;                      /*!< Write a 1 to a bit in this register to clear the interrupt status
                                                     associated with that bit.                                                 */

    struct {
      __IOM uint32_t FSIZE      : 1;            /*!< FIFO Size interrupt.                                                      */
      __IOM uint32_t FOVFL      : 1;            /*!< FIFO Overflow interrupt.                                                  */
      __IOM uint32_t FUNDFL     : 1;            /*!< FIFO Underflow interrupt.                                                 */
      __IOM uint32_t FRDERR     : 1;            /*!< FIFO Read Error interrupt.                                                */
      __IOM uint32_t GENAD      : 1;            /*!< I2C General Address interrupt.                                            */
      __IOM uint32_t IOINTW     : 1;            /*!< IO Write interrupt.                                                       */
      __IOM uint32_t XCMPRF     : 1;            /*!< Transfer complete interrupt, read from FIFO space.                        */
      __IOM uint32_t XCMPRR     : 1;            /*!< Transfer complete interrupt, read from register space.                    */
      __IOM uint32_t XCMPWF     : 1;            /*!< Transfer complete interrupt, write to FIFO space.                         */
      __IOM uint32_t XCMPWR     : 1;            /*!< Transfer complete interrupt, write to register space.                     */
            uint32_t            : 22;
    } INTCLR_b;
  } ;

  union {
    __IOM uint32_t INTSET;                      /*!< Write a 1 to a bit in this register to instantly generate an
                                                     interrupt from this module. (Generally used for testing
                                                     purposes).                                                                */

    struct {
      __IOM uint32_t FSIZE      : 1;            /*!< FIFO Size interrupt.                                                      */
      __IOM uint32_t FOVFL      : 1;            /*!< FIFO Overflow interrupt.                                                  */
      __IOM uint32_t FUNDFL     : 1;            /*!< FIFO Underflow interrupt.                                                 */
      __IOM uint32_t FRDERR     : 1;            /*!< FIFO Read Error interrupt.                                                */
      __IOM uint32_t GENAD      : 1;            /*!< I2C General Address interrupt.                                            */
      __IOM uint32_t IOINTW     : 1;            /*!< IO Write interrupt.                                                       */
      __IOM uint32_t XCMPRF     : 1;            /*!< Transfer complete interrupt, read from FIFO space.                        */
      __IOM uint32_t XCMPRR     : 1;            /*!< Transfer complete interrupt, read from register space.                    */
      __IOM uint32_t XCMPWF     : 1;            /*!< Transfer complete interrupt, write to FIFO space.                         */
      __IOM uint32_t XCMPWR     : 1;            /*!< Transfer complete interrupt, write to register space.                     */
            uint32_t            : 22;
    } INTSET_b;
  } ;

  union {
    __IOM uint32_t REGACCINTEN;                 /*!< Set bits in this register to allow this module to generate the
                                                     corresponding interrupt.                                                  */

    struct {
      __IOM uint32_t REGACC     : 32;           /*!< Register access interrupts.                                               */
    } REGACCINTEN_b;
  } ;

  union {
    __IOM uint32_t REGACCINTSTAT;               /*!< Read bits from this register to discover the cause of a recent
                                                     interrupt.                                                                */

    struct {
      __IOM uint32_t REGACC     : 32;           /*!< Register access interrupts.                                               */
    } REGACCINTSTAT_b;
  } ;

  union {
    __IOM uint32_t REGACCINTCLR;                /*!< Write a 1 to a bit in this register to clear the interrupt status
                                                     associated with that bit.                                                 */

    struct {
      __IOM uint32_t REGACC     : 32;           /*!< Register access interrupts.                                               */
    } REGACCINTCLR_b;
  } ;

  union {
    __IOM uint32_t REGACCINTSET;                /*!< Write a 1 to a bit in this register to instantly generate an
                                                     interrupt from this module. (Generally used for testing
                                                     purposes).                                                                */

