AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4l_generic.h
    struct {
      __IOM uint32_t REGACC     : 32;           /*!< Register access interrupts.                                               */
    } REGACCINTSET_b;
  } ;
} IOSLAVE_Type;                                 /*!< Size = 544 (0x220)                                                        */



/* =========================================================================================================================== */
/* ================                                          MCUCTRL                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief MCU Miscellaneous Control Logic (MCUCTRL)
  */

typedef struct {                                /*!< MCUCTRL Structure                                                         */

  union {
    __IOM uint32_t CHIPPN;                      /*!< Chip Information                                                          */

    struct {
            uint32_t            : 1;
      __IOM uint32_t TEMP       : 2;            /*!< Temperature.                                                              */
      __IOM uint32_t PINS       : 3;            /*!< Number of pins for this package.                                          */
      __IOM uint32_t PKG        : 2;            /*!< Package type.                                                             */
      __IOM uint32_t REVMIN     : 4;            /*!< Minor revision.                                                           */
      __IOM uint32_t REVMAJ     : 4;            /*!< Major revision.                                                           */
      __IOM uint32_t SRAMSIZE   : 4;            /*!< SRAM size.                                                                */
      __IOM uint32_t MRAMSIZE   : 4;            /*!< MRAM size.                                                                */
      __IOM uint32_t PN         : 8;            /*!< Apollo family device type.                                                */
    } CHIPPN_b;
  } ;

  union {
    __IOM uint32_t CHIPID0;                     /*!< Unique Chip ID 0                                                          */

    struct {
      __IOM uint32_t CHIPID0    : 32;           /*!< Unique chip ID 0.                                                         */
    } CHIPID0_b;
  } ;

  union {
    __IOM uint32_t CHIPID1;                     /*!< Unique Chip ID 1                                                          */

    struct {
      __IOM uint32_t CHIPID1    : 32;           /*!< Unique chip ID 1.                                                         */
    } CHIPID1_b;
  } ;

  union {
    __IOM uint32_t CHIPREV;                     /*!< Chip Revision                                                             */

    struct {
      __IOM uint32_t REVMIN     : 4;            /*!< Minor Revision ID.                                                        */
      __IOM uint32_t REVMAJ     : 4;            /*!< Major Revision ID.                                                        */
      __IOM uint32_t SIPART     : 12;           /*!< Silicon Part ID                                                           */
            uint32_t            : 12;
    } CHIPREV_b;
  } ;

  union {
    __IOM uint32_t VENDORID;                    /*!< Unique Vendor ID                                                          */

    struct {
      __IOM uint32_t VENDORID   : 32;           /*!< Unique Vendor ID                                                          */
    } VENDORID_b;
  } ;

  union {
    __IOM uint32_t SKU;                         /*!< Unique Chip SKU                                                           */

    struct {
      __IOM uint32_t SKUSRAMSIZE : 2;           /*!< SRAM SKU dictates the available memory for MCU. All of the MCU
                                                     TCM (384KB) and System SRAM (2MB) available by default.
                                                     Memory SU disabled                                                        */
      __IOM uint32_t SKUMRAMSIZE : 2;           /*!< MRAM size SKU. All of 2MB Available by default. Memory SU disabled        */
      __IOM uint32_t SKUDSP     : 2;            /*!< DSP availability SKU setting. 384K available by default. Memory
                                                     SU disabled                                                               */
      __IOM uint32_t SKUTURBOSPOT : 1;          /*!< High performance mode for MCU and DSPs.                                   */
      __IOM uint32_t SKUMIPIDSI : 1;            /*!< MIPI DSI available                                                        */
      __IOM uint32_t SKUGFX     : 1;            /*!< GFX available                                                             */
      __IOM uint32_t SKUUSB     : 1;            /*!< USB available                                                             */
      __IOM uint32_t SKUSECURESPOT : 1;         /*!< Secure boot feature                                                       */
            uint32_t            : 21;
    } SKU_b;
  } ;
  __IM  uint32_t  RESERVED[2];

  union {
    __IOM uint32_t DEBUGGER;                    /*!< Debugger Control                                                          */

    struct {
      __IOM uint32_t LOCKOUT    : 32;           /*!< Lockout of debugger (SWD).                                                */
    } DEBUGGER_b;
  } ;
  __IM  uint32_t  RESERVED1;

  union {
    __IOM uint32_t ACRG;                        /*!< Active Current Reference Generator Control                                */

    struct {
      __IOM uint32_t ACRGSWE    : 1;            /*!< Software enablement for ACRG register. A value of 1 will allow
                                                     writes to the register                                                    */
      __IOM uint32_t ACRGPWD    : 1;            /*!< Power down the ACRG.                                                      */
      __IOM uint32_t ACRGIBIASSEL : 1;          /*!< Set the ACRG ibias. Note: the SWE mux select in PWRSEQ2SWE must
                                                     be set for this to take effect. The inversion of this register
                                                     is driven to analog.                                                      */
      __IOM uint32_t ACRGTRIM   : 5;            /*!< ACRG Trim value                                                           */
            uint32_t            : 24;
    } ACRG_b;
  } ;
  __IM  uint32_t  RESERVED2[6];

  union {
    __IOM uint32_t VREFGEN2;                    /*!< Voltage Reference Generator 2 Control                                     */

