AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4l_generic.h
    struct {
      __IOM uint32_t TVRGTEMPCOTRIM : 5;        /*!< Calibrated Voltage Reference Generator tc trim (bottom transistor)        */
      __IOM uint32_t TVRGPWD    : 1;            /*!< Power Down, Calibrated Voltage Reference Generator.                       */
      __IOM uint32_t TVRGCURRENTTRIM : 1;       /*!< Calibrated voltage reference current trim.                                */
      __IOM uint32_t TVRGVREFTRIM : 7;          /*!< Calibrated voltage reference 580m trim                                    */
      __IOM uint32_t TVRG2TEMPCOTRIM : 5;       /*!< Calibrated Voltage Reference Generator tc trim (bottom transistor)        */
      __IOM uint32_t TVRG2PWD   : 1;            /*!< Power Down, Calibrated Voltage Reference Generator.                       */
      __IOM uint32_t TVRG2CURRENTTRIM : 1;      /*!< Calibrated voltage reference current trim.                                */
      __IOM uint32_t TVRG2VREFTRIM : 7;         /*!< Calibrated voltage reference 580m trim                                    */
      __IOM uint32_t TVRGSELVREF : 1;           /*!< TVRG SEL VREF                                                             */
      __IOM uint32_t TVRG2SELVREF : 1;          /*!< TVRG2 SEL VREF                                                            */
            uint32_t            : 2;
    } VREFGEN2_b;
  } ;
  __IM  uint32_t  RESERVED3[6];

  union {
    __IOM uint32_t VRCTRL;                      /*!< Overrides for Voltage Regulators Controls                                 */

    struct {
      __IOM uint32_t CORELDOOVER : 1;           /*!< Override control for CORE LDO signals                                     */
      __IOM uint32_t CORELDOPDNB : 1;           /*!< CORE LDO PDNB control. Override for PWRCTRL going to analog
                                                     when CORELDOOVER = 1                                                      */
      __IOM uint32_t CORELDOACTIVEEARLY : 1;    /*!< CORE LDO EARLY ACTIVE control. Override for PWRCTRL going to
                                                     analog when CORELDOOVER = 1                                               */
      __IOM uint32_t CORELDOACTIVE : 1;         /*!< CORE LDO ACTIVE control. Override for PWRCTRL going to analog
                                                     when CORELDOOVER = 1                                                      */
      __IOM uint32_t CORELDOCOLDSTARTEN : 1;    /*!< CORE LDO COLDSTART EN control. This is a shadow backed register
                                                     and no need to set CORELDOOVER.                                           */
      __IOM uint32_t MEMLDOOVER : 1;            /*!< Override control for MEM LDO signals                                      */
      __IOM uint32_t MEMLDOPDNB : 1;            /*!< MEM LDO PDNB control. Override signal for PWRCTRL going to analog
                                                     when MEMLDOOVER = 1                                                       */
      __IOM uint32_t MEMLDOACTIVEEARLY : 1;     /*!< MEM LDO EARLY ACTIVE control. Override for PWRCTRL going to
                                                     analog when MEMLDOOVER = 1                                                */
      __IOM uint32_t MEMLDOACTIVE : 1;          /*!< MEM LDO ACTIVE control. Override for PWRCTRL going to analog
                                                     when MEMLDOOVER = 1                                                       */
      __IOM uint32_t MEMLDOCOLDSTARTEN : 1;     /*!< MEM LDO COLDSTART EN control. This is a shadow backed register
                                                     and no need to set MEMLDOOVER.                                            */
      __IOM uint32_t MEMLPLDOOVER : 1;          /*!< Override control for MEM LP LDO signals                                   */
      __IOM uint32_t MEMLPLDOPDNB : 1;          /*!< MEM LP LDO PDNB control. Override for PWRCTRL going to analog
                                                     when MEMLPLDOOVER = 1                                                     */
      __IOM uint32_t MEMLPLDOACTIVE : 1;        /*!< MEM LP LDO ACTVIVE control. Override for PWRCTRL going to analog
                                                     when MEMLPLDOOVER = 1                                                     */
      __IOM uint32_t ANALDOOVER : 1;            /*!< Override control for ANALDO signals                                       */
      __IOM uint32_t ANALDOPDNB : 1;            /*!< ANALDO PDNB control. Override for PWRCTRL going to analog when
                                                     ANALDOOVER = 1                                                            */
      __IOM uint32_t ANALDOACTIVE : 1;          /*!< ANALDO LDO ACTIVE control. Override for PWRCTRL going to analog
                                                     when ANALDOOVER = 1                                                       */
      __IOM uint32_t SIMOBUCKOVER : 1;          /*!< Override control for SIMO BUCK signals                                    */
      __IOM uint32_t SIMOBUCKPDNB : 1;          /*!< SIMO BUCK PDNB control. Override for PWRCTRL going to analog
                                                     when SIMOBUCKOVER = 1                                                     */
      __IOM uint32_t SIMOBUCKRSTB : 1;          /*!< SIMO BUCK RSTB control. Override for PWRCTRL going to analog
                                                     when SIMOBUCKOVER = 1                                                     */
      __IOM uint32_t SIMOBUCKACTIVE : 1;        /*!< SIMO BUCK ACTIVE control. Override for PWRCTRL going to analog
                                                     when SIMOBUCKOVER = 1                                                     */
            uint32_t            : 12;
    } VRCTRL_b;
  } ;
  __IM  uint32_t  RESERVED4[7];

  union {
    __IOM uint32_t LDOREG1;                     /*!< CORELDO trims Reg                                                         */

