AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4l_generic.h
    struct {
      __IOM uint32_t BODLRDE    : 1;            /*!< Disable Unregulated 1.8V Brown-out reset.                                 */
      __IOM uint32_t BODCREN    : 1;            /*!< Disable VDDC Brown Out reset.                                             */
      __IOM uint32_t BODFREN    : 1;            /*!< Disable VDDF Brown Out reset.                                             */
      __IOM uint32_t BODSREN    : 1;            /*!< Disable VDDS Brown Out reset.                                             */
      __IOM uint32_t BODCLVREN  : 1;            /*!< Disable VDDC_LV Brown Out reset.                                          */
            uint32_t            : 27;
    } BODISABLE_b;
  } ;
  __IM  uint32_t  RESERVED12[2];

  union {
    __IOM uint32_t BOOTLOADER;                  /*!< Bootloader and secure boot functions                                      */

    struct {
      __IOM uint32_t BOOTLOADERLOW : 1;         /*!< Determines whether the bootloader code is visible at address
                                                     0x00000000 or not. Resets to 1, write 1 to clear.                         */
      __IOM uint32_t SBRLOCK    : 1;            /*!< Secure boot ROM lock. Always resets to 1, write 1 to clear.
                                                     Enables system visibility to bootloader until set.                        */
      __IOM uint32_t PROTLOCK   : 1;            /*!< This field controls access to OEM keybank and restricts further
                                                     application of NVM protections via the FLASHWPROTn and
                                                     FLASHRPROTn registers. On read, 0 indicates locked, 1 indicates
                                                     unlocked. Write 1 to clear the field (assert the lock).
                                                     Default value of the hardware is 1 (unlocked), but the
                                                     default value is also affected by INFOC_SECURITY->PLONEXIT.
                                                     If PLONEXIT is set, PROTLOCK is asserted by SBL and the
                                                     OEM application will see the value as 0 (locked).                         */
      __IOM uint32_t SBLLOCK    : 1;            /*!< Secure boot loader lock. Always resets to 1, write 1 to clear.
                                                     Enables system visibility to bootloader until set.                        */
            uint32_t            : 22;
      __IOM uint32_t SECBOOTFEATURE : 2;        /*!< Indicates whether the secure boot feature is enabled.                     */
      __IOM uint32_t SECBOOT    : 2;            /*!< Indicates whether the secure boot on cold reset is enabled                */
      __IOM uint32_t SECBOOTONRST : 2;          /*!< Indicates whether the secure boot on warm reset is enabled                */
    } BOOTLOADER_b;
  } ;

  union {
    __IOM uint32_t SHADOWVALID;                 /*!< Register to indicate whether the shadow registers have been
                                                     successfully loaded from the Flash Information Space.                     */

    struct {
      __IOM uint32_t VALID      : 1;            /*!< Indicates whether the shadow registers contain valid data from
                                                     the Flash Information Space.                                              */
      __IOM uint32_t BLDSLEEP   : 1;            /*!< Indicates whether the bootloader should sleep or deep sleep
                                                     if no image loaded.                                                       */
      __IOM uint32_t INFO0VALID : 1;            /*!< Indicates whether info0 contains valid data                               */
            uint32_t            : 29;
    } SHADOWVALID_b;
  } ;

  union {
    __IOM uint32_t SCRATCH0;                    /*!< This register reserved for Ambiq INTERNAL use only. Do not modify.        */

    struct {
      __IOM uint32_t SCRATCH0   : 32;           /*!< Scratch register 0.                                                       */
    } SCRATCH0_b;
  } ;

  union {
    __IOM uint32_t SCRATCH1;                    /*!< This register reserved for Ambiq INTERNAL use only. Do not modify.        */

    struct {
      __IOM uint32_t SCRATCH1   : 32;           /*!< Scratch register 1.                                                       */
    } SCRATCH1_b;
  } ;
  __IM  uint32_t  RESERVED13[14];

  union {
    __IOM uint32_t DBGR1;                       /*!< Read-only debug 1                                                         */

    struct {
      __IOM uint32_t ONETO8     : 32;           /*!< Read-only register for communication validation                           */
    } DBGR1_b;
  } ;

  union {
    __IOM uint32_t DBGR2;                       /*!< Read-only debug 2                                                         */

    struct {
      __IOM uint32_t COOLCODE   : 32;           /*!< Read-only register for communication validation                           */
    } DBGR2_b;
  } ;
  __IM  uint32_t  RESERVED14[6];

  union {
    __IOM uint32_t PMUENABLE;                   /*!< Control bit to enable/disable the PMU                                     */

    struct {
      __IOM uint32_t ENABLE     : 1;            /*!< PMU Enable Control bit. When set, the MCU's PMU will place the
                                                     MCU into the lowest power consuming Deep Sleep mode upon
                                                     execution of a WFI instruction (dependent on the setting
                                                     of the SLEEPDEEP bit in the ARM SCR register). When cleared,
                                                     regardless of the requested sleep mode, the PMU will not
                                                     enter the lowest power Deep Sleep mode, instead entering
                                                     the Sleep mode.                                                           */
            uint32_t            : 31;
    } PMUENABLE_b;
  } ;
  __IM  uint32_t  RESERVED15[11];

  union {
    __IOM uint32_t DBGCTRL;                     /*!< Debug subsystem Control. Determines the debug components enable
                                                     and clk frequency.                                                        */

