AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4l_generic.h
    struct {
      __IOM uint32_t CM4TPIUENABLE : 1;         /*!< TPIU Enable field. When set, the ARM M4 TPIU is enabled and
                                                     data can be streamed out trace data from ARM ITM and ETM
                                                     modules through either SWO or TRACEDATA ports                             */
      __IOM uint32_t CM4CLKSEL  : 3;            /*!< This field selects the frequency of the ARM M4 TPIU port.                 */
            uint32_t            : 4;
      __IOM uint32_t DBGETBENABLE : 1;          /*!< Debug subsystem ETB enable to store the trace data.                       */
      __IOM uint32_t DBGETMTRACEEN : 1;         /*!< Debug subsystem ETM trace enable                                          */
      __IOM uint32_t DBGDSP0TRACEEN : 1;        /*!< Debug subsystem DSP0 trace enable                                         */
      __IOM uint32_t DBGDSP1TRACEEN : 1;        /*!< Debug subsystem DSP1 trace enable                                         */
      __IOM uint32_t DBGTSCLKSEL : 3;           /*!< This field selects the frequency of the ARM M4 dbg ts port.               */
            uint32_t            : 1;
      __IOM uint32_t DBGDSP0OCDHALTONRST : 1;   /*!< Debug subsystem DSP0 OCD Halt on Reset                                    */
      __IOM uint32_t DBGDSP1OCDHALTONRST : 1;   /*!< Debug subsystem DSP1 OCD Halt on Reset                                    */
            uint32_t            : 14;
    } DBGCTRL_b;
  } ;
  __IM  uint32_t  RESERVED16[4];

  union {
    __IOM uint32_t OTAPOINTER;                  /*!< OTA (Over the Air) Update Pointer/Status. Reset only by POA               */

    struct {
      __IOM uint32_t OTAVALID   : 1;            /*!< Indicates that an OTA update is valid                                     */
      __IOM uint32_t OTASBLUPDATE : 1;          /*!< Indicates that the sbl_init has been updated                              */
      __IOM uint32_t OTAPOINTER : 30;           /*!< Flash page pointer with updated OTA image                                 */
    } OTAPOINTER_b;
  } ;
  __IM  uint32_t  RESERVED17[6];

  union {
    __IOM uint32_t APBDMACTRL;                  /*!< DMA Control Register. Determines misc settings for DMA operation          */

    struct {
      __IOM uint32_t DMAENABLE  : 1;            /*!< Enable the DMA controller. When disabled, DMA requests will
                                                     be ignored by the controller                                              */
      __IOM uint32_t DECODEABORT : 1;           /*!< APB Decode Abort. When set, the APB bridge will issue a data
                                                     abort (bus fault) on transactions to peripherals that are
                                                     powered down. When set to 0, writes are quietly discarded
                                                     and reads return 0.                                                       */
            uint32_t            : 6;
      __IOM uint32_t HYSTERESIS : 8;            /*!< This field determines how long the DMA engine of apb/disp/gfx
                                                     will remain active during deep sleep before shutting down
                                                     and returning the system to full deep sleep. Values are
                                                     based on a 94KHz clock and are roughly 10us increments
                                                     for a range of ~10us to 2.55ms                                            */
            uint32_t            : 16;
    } APBDMACTRL_b;
  } ;
  __IM  uint32_t  RESERVED18[45];

  union {
    __IOM uint32_t KEXTCLKSEL;                  /*!< Locks the state of the EXTCLKSEL register from writes. This
                                                     is done to prevent errant writes to the register, as this
                                                     could cause the chip to halt. Write a value of 0x53 to
                                                     unlock write access to the EXTCLKSEL register. Once unlocked,
                                                     the register will read back a 1 to undicate this is unlocked.
                                                     Writing the register with any other value other than 0x53
                                                     will enable the lock.                                                     */

    struct {
      __IOM uint32_t KEXTCLKSEL : 32;           /*!< Key register value.                                                       */
    } KEXTCLKSEL_b;
  } ;

  union {
    __IOM uint32_t SIMOBUCK0;                   /*!< This WRITE_ONLY register controls various buck parameters. It
                                                     will read back as 0x00000000.                                             */

    struct {
      __IOM uint32_t VDDCRXCOMPEN : 1;          /*!< Enable the VDDC rail.                                                     */
      __IOM uint32_t VDDFRXCOMPEN : 1;          /*!< Enable the VDDS rail.                                                     */
      __IOM uint32_t VDDSRXCOMPEN : 1;          /*!< Enable the VDDS rail.                                                     */
      __IOM uint32_t VDDCLVRXCOMPEN : 1;        /*!< Enable the VDDC LV rail.                                                  */
      __IOM uint32_t TONTOFFNODEGLITCH : 1;     /*!< Enable the ton and toff signals no deglitch output.                       */
            uint32_t            : 27;
    } SIMOBUCK0_b;
  } ;

  union {
    __IOM uint32_t SIMOBUCK1;                   /*!< 1. Control the even division of 3 clocks: refresh, low power
                                                     and TONCLK. 2. Control gap bewteen secondary switches.
                                                     3. Debug features: control the amount of time TONCLK is
                                                     on, and the time before snubber asserts for each buck sequence.
                                                     4. Enable or disable the observation bus. 5. Select the
                                                     buck sequence operation mode. 6. Control delay between
                                                     primary Pmos and Nmos transitions.                                        */

