AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4l_generic.h
    struct {
            uint32_t            : 6;
      __IOM uint32_t RXCLKACTTRIM : 5;          /*!< This divides the 5 MHz refresh clock. Even divides are supported
                                                     only. This value represents the division amount minus 1.                  */
            uint32_t            : 11;
      __IOM uint32_t TONCLKTRIM : 4;            /*!< This divides the 100 MHz ton clock. Even divides are supported
                                                     only. This value represents the division amount minus 1.                  */
            uint32_t            : 6;
    } SIMOBUCK1_b;
  } ;

  union {
    __IOM uint32_t SIMOBUCK2;                   /*!< SIMO Buck Muxed VDDC Active Sequence Trim Control                         */

    struct {
            uint32_t            : 11;
      __IOM uint32_t VDDCACTHIGHTONTRIM : 4;    /*!< VDDC active high ton trim control for Buck sequence.                      */
            uint32_t            : 9;
      __IOM uint32_t VDDCACTLOWTONTRIM : 5;     /*!< VDDC active high ton trim control for Buck sequence.                      */
            uint32_t            : 3;
    } SIMOBUCK2_b;
  } ;

  union {
    __IOM uint32_t SIMOBUCK3;                   /*!< SIMO Buck Muxed VDDC low power Sequence Trim Control                      */

    struct {
            uint32_t            : 13;
      __IOM uint32_t VDDCLPHIGHTONTRIM : 4;     /*!< VDDC LP high ton trim control for Buck sequence.                          */
            uint32_t            : 9;
      __IOM uint32_t VDDCLPLOWTONTRIM : 4;      /*!< VDDC LP low ton trim control for Buck sequence.                           */
            uint32_t            : 2;
    } SIMOBUCK3_b;
  } ;
  __IM  uint32_t  RESERVED19[2];

  union {
    __IOM uint32_t SIMOBUCK6;                   /*!< SIMO Buck Muxed VDDF Active Sequence Trim Control                         */

    struct {
            uint32_t            : 17;
      __IOM uint32_t VDDFACTHIGHTONTRIM : 4;    /*!< VDDF active high ton trim control for Buck sequence.                      */
            uint32_t            : 11;
    } SIMOBUCK6_b;
  } ;

  union {
    __IOM uint32_t SIMOBUCK7;                   /*!< SIMO Buck Muxed VDDF active Sequence Trim Control                         */

    struct {
            uint32_t            : 8;
      __IOM uint32_t VDDFACTLOWTONTRIM : 5;     /*!< VDDF active low ton trim control for Buck sequence.                       */
            uint32_t            : 5;
      __IOM uint32_t ZXCOMPZXTRIM : 5;          /*!< Zxcomp trim. Feedthrough to analog.                                       */
            uint32_t            : 9;
    } SIMOBUCK7_b;
  } ;

  union {
    __IOM uint32_t SIMOBUCK8;                   /*!< SIMO Buck Muxed VDDF Low Power Sequence Trim Control                      */

    struct {
            uint32_t            : 9;
      __IOM uint32_t VDDFLPHIGHTONTRIM : 4;     /*!< VDDF low power high ton trim control for Buck sequence.                   */
            uint32_t            : 9;
      __IOM uint32_t VDDFLPLOWTONTRIM : 4;      /*!< VDDF low power low ton trim control for Buck sequence.                    */
            uint32_t            : 6;
    } SIMOBUCK8_b;
  } ;

  union {
    __IOM uint32_t SIMOBUCK9;                   /*!< SIMO Buck Muxed VDDS Active Sequence Trim Control                         */

    struct {
            uint32_t            : 17;
      __IOM uint32_t VDDSACTHIGHTONTRIM : 4;    /*!< VDDS active high ton trim control for Buck sequence.                      */
            uint32_t            : 1;
      __IOM uint32_t VDDSACTLOWTONTRIM : 5;     /*!< VDDS active low ton trim control for Buck sequence.                       */
            uint32_t            : 5;
    } SIMOBUCK9_b;
  } ;
  __IM  uint32_t  RESERVED20[2];

  union {
    __IOM uint32_t SIMOBUCK12;                  /*!< SIMO Buck Compare, Brown out, Active, Low power Trim Control              */

    struct {
            uint32_t            : 20;
      __IOM uint32_t ACTTRIMVDDF : 6;           /*!< Active VDDF trim.                                                         */
      __IOM uint32_t LPTRIMVDDF : 6;            /*!< Low power VDDF trim.                                                      */
    } SIMOBUCK12_b;
  } ;

  union {
    __IOM uint32_t SIMOBUCK13;                  /*!< SIMO Buck Compare, Brown out, Active, Low power Trim Control              */

    struct {
            uint32_t            : 20;
      __IOM uint32_t ACTTRIMVDDS : 6;           /*!< Active VDDS trim.                                                         */
      __IOM uint32_t LPTRIMVDDS : 6;            /*!< Low power VDDS trim.                                                      */
    } SIMOBUCK13_b;
  } ;
  __IM  uint32_t  RESERVED21;

  union {
    __IOM uint32_t SIMOBUCK15;                  /*!< SIMO Buck Compare, Brown out, Active and Low power Trim Control           */

    struct {
            uint32_t            : 24;
      __IOM uint32_t ZXCOMPOFFSETTRIM : 5;      /*!< Zxcomp offset trim. Feedthrough to analog.                                */
            uint32_t            : 2;
      __IOM uint32_t TRIMLATCHOVER : 1;         /*!< Override / Bypass the simobuck trim latch to enable on-the-fly
                                                     trimming for VDDF and VDDS active and LP trims                            */
    } SIMOBUCK15_b;
  } ;

  union {
    __IOM uint32_t PWRSW0;                      /*!< PWRSW Control 0                                                           */

    struct {
      __IOM uint32_t PWRSWVDDCPUDYNSEL : 2;     /*!< override value for pwrsw_vddcpu_dynsel                                    */
      __IOM uint32_t PWRSWVDDCPUPGN : 1;        /*!< override value for pwrsw_vddcpu_pgn                                       */
      __IOM uint32_t PWRSWVDDCPUOVERRIDE : 1;   /*!< override enable for pwrsw_vddcpu_dynsel and pgn                           */
      __IOM uint32_t PWRSWVDDCAORDYNSEL : 2;    /*!< override value for pwrsw_vddcaor_dynsel                                   */
      __IOM uint32_t PWRSWVDDCAOROVERRIDE : 1;  /*!< override enable for pwrsw_vddcaor_dynsel                                  */
      __IOM uint32_t PWRSWVDDDSP0DYNSEL : 2;    /*!< override value for pwrsw_vdddsp0_dynsel                                   */
      __IOM uint32_t PWRSWVDDDSP0PGN : 1;       /*!< override value for pwrsw_vdddsp0_pgn                                      */
      __IOM uint32_t PWRSWVDDDSP0OVERRIDE : 1;  /*!< override enable for pwrsw_vdddsp0_dynsel and pgn                          */
      __IOM uint32_t PWRSWVDDDSP1DYNSEL : 2;    /*!< override value for pwrsw_vdddsp1_dynsel                                   */
      __IOM uint32_t PWRSWVDDDSP1PGN : 1;       /*!< override value for pwrsw_vdddsp1_pgn                                      */
      __IOM uint32_t PWRSWVDDDSP1OVERRIDE : 1;  /*!< override enable for pwrsw_vdddsp1_dynsel and pgn                          */
      __IOM uint32_t PWRSWVDDMCPUDYNSEL : 1;    /*!< override value for pwrsw_vddmcpu_dynsel                                   */
      __IOM uint32_t PWRSWVDDMCPUSTATSEL : 1;   /*!< VDDMCPU power switch static select                                        */
      __IOM uint32_t PWRSWVDDMCPUOVERRIDE : 1;  /*!< override enable for pwrsw_vddmcpu_dynsel                                  */
      __IOM uint32_t PWRSWVDDMDSP0DYNSEL : 1;   /*!< override value for pwrsw_vddmdsp0_dynsel                                  */
      __IOM uint32_t PWRSWVDDMDSP0STATSEL : 1;  /*!< VDDMDSP0 power switch static select                                       */
      __IOM uint32_t PWRSWVDDMDSP0OVERRIDE : 1; /*!< override enable for pwrsw_vddmdsp0_dynsel                                 */
      __IOM uint32_t PWRSWVDDMDSP1DYNSEL : 1;   /*!< override value for pwrsw_vddmdsp1_dynsel                                  */
      __IOM uint32_t PWRSWVDDMDSP1STATSEL : 1;  /*!< VDDMDSP1 power switch static select                                       */
      __IOM uint32_t PWRSWVDDMDSP1OVERRIDE : 1; /*!< override enable for pwrsw_vddmdsp1_dynsel                                 */
      __IOM uint32_t PWRSWVDDMLDYNSEL : 1;      /*!< override value for pwrsw_vddml_dynsel                                     */
      __IOM uint32_t PWRSWVDDMLSTATSEL : 1;     /*!< VDDML power switch static select                                          */
      __IOM uint32_t PWRSWVDDMLOVERRIDE : 1;    /*!< override enable for pwrsw_vddml_dynsel                                    */
      __IOM uint32_t PWRSWVDDRCPUDYNSEL : 2;    /*!< override value for pwrsw_vddrcpu_dynsel                                   */
      __IOM uint32_t PWRSWVDDRCPUPGN : 1;       /*!< override value for pwrsw_vddrcpu_pgn                                      */
      __IOM uint32_t PWRSWVDDRCPUSTATSEL : 1;   /*!< VDDRCPU power switch static select                                        */
      __IOM uint32_t PWRSWVDDRCPUOVERRIDE : 1;  /*!< override enable for pwrsw_vddrcpu_dynsel and pgn                          */
    } PWRSW0_b;
  } ;

  union {
    __IOM uint32_t PWRSW1;                      /*!< PWRSW Control 1                                                           */

