AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4l_generic.h
    struct {
      __IOM uint32_t PWRSWVDDRDSP0DYNSEL : 2;   /*!< override value for pwrsw_vddrdsp0_dynsel                                  */
      __IOM uint32_t PWRSWVDDRDSP0PGN : 1;      /*!< override value for pwrsw_vddrdsp0_pgn                                     */
      __IOM uint32_t PWRSWVDDRDSP0STATSEL : 1;  /*!< VDDRDSP0 power switch static select                                       */
      __IOM uint32_t PWRSWVDDRDSP0OVERRIDE : 1; /*!< override enable for pwrsw_vddrdsp0_dynsel and pgn                         */
      __IOM uint32_t PWRSWVDDRDSP1DYNSEL : 2;   /*!< override value for pwrsw_vddrdsp1_dynsel                                  */
      __IOM uint32_t PWRSWVDDRDSP1PGN : 1;      /*!< override value for pwrsw_vddrdsp1_pgn                                     */
      __IOM uint32_t PWRSWVDDRDSP1STATSEL : 1;  /*!< VDDRDSP1 power switch static select                                       */
      __IOM uint32_t PWRSWVDDRDSP1OVERRIDE : 1; /*!< override enable for pwrsw_vddrdsp1_dynsel and pgn                         */
      __IOM uint32_t PWRSWVDDRLDYNSEL : 1;      /*!< override value for pwrsw_vddrl_dynsel                                     */
      __IOM uint32_t PWRSWVDDRLPGN : 1;         /*!< override value for pwrsw_vddrl_pgn                                        */
      __IOM uint32_t PWRSWVDDRLSTATSEL : 1;     /*!< VDDRL power switch static select                                          */
      __IOM uint32_t PWRSWVDDRLOVERRIDE : 1;    /*!< override enable for pwrsw_vddrl_dynsel and pgn                            */
      __IOM uint32_t PWRSWVDDRMDYNSEL : 1;      /*!< override value for pwrsw_vddrm_dynsel                                     */
      __IOM uint32_t PWRSWVDDRMPGN : 1;         /*!< override value for pwrsw_vddrm_pgn                                        */
      __IOM uint32_t PWRSWVDDRMSTATSEL : 1;     /*!< VDDRM power switch static select                                          */
      __IOM uint32_t PWRSWVDDRMOVERRIDE : 1;    /*!< override enable for pwrsw_vddrm_dynsel and pgn                            */
      __IOM uint32_t PWRSWVDDLPGN : 1;          /*!< override value for pwrsw_vddl_pgn                                         */
      __IOM uint32_t PWRSWVDDLOVERRIDE : 1;     /*!< override enable for pwrsw_vddl_pgn                                        */
      __IOM uint32_t PWRSWCOMPPDNB : 1;         /*!< pwrsw_comp_pdnb                                                           */
      __IOM uint32_t PWRSWOVRDRVEN : 1;         /*!< pwrsw_ovrdrv_en                                                           */
      __IOM uint32_t DIGPWRSWOVRDRVEN : 1;      /*!< digpwrsw_ovrdrv_en                                                        */
      __IOM uint32_t DIGPWRSWOVRDRVSEL : 2;     /*!< digpwrsw_ovrdrv_sel                                                       */
      __IOM uint32_t USEVDDF4VDDRCPUINHP : 1;   /*!< Setting this bit selects VDDF for VDDRCPU in when MCU is in
                                                     HP mode. This is valid for only normal operational mode
                                                     (i.e without overrides).                                                  */
      __IOM uint32_t FORCEVDDRMVDDS : 1;        /*!< Setting this bit selects VDDS for VDDRM when Flash is off. This
                                                     is valid for only normal operational mode (i.e. without
                                                     overrides).                                                               */
      __IOM uint32_t FORCEVDDRMOFF : 1;         /*!< Setting this bit forces VDDRM to be open when Flash is off.
                                                     This is valid for only normal operational mode (i.e. without
                                                     overrides).                                                               */
      __IOM uint32_t SHORTVDDCVDDCLVOREN : 1;   /*!< pwrsw short override select for vddc/vddclv                               */
      __IOM uint32_t SHORTVDDCVDDCLVORVAL : 1;  /*!< pwrsw short override value for vddc/vddclv                                */
      __IOM uint32_t SHORTVDDFVDDSOREN : 1;     /*!< pwrsw short override select for vddf/vdds                                 */
      __IOM uint32_t SHORTVDDFVDDSORVAL : 1;    /*!< pwrsw short override value for vddf/vdds                                  */
    } PWRSW1_b;
  } ;
  __IM  uint32_t  RESERVED22;

  union {
    __IOM uint32_t USBRSTCTRL;                  /*!< USB Reset Startup Control                                                 */

    struct {
      __IOM uint32_t USBRSTENABLE : 1;          /*!< This bit enables this register control. If set to '1', the reset
                                                     release bits will be active. If set to '0', this register
                                                     is not controlling the USB override bits.                                 */
      __IOM uint32_t USBPORRSTRELEASE : 1;      /*!< Set this bit to '1' after USB power domain is up. This will
                                                     release the reset override condition                                      */
      __IOM uint32_t USBUTMIRSTRELEASE : 1;     /*!< Set this bit to '1' after USB power domain is up. This will
                                                     release the reset override condition                                      */
            uint32_t            : 29;
    } USBRSTCTRL_b;
  } ;
  __IM  uint32_t  RESERVED23[7];

  union {
    __IOM uint32_t FLASHWPROT0;                 /*!< These bits write-protect flash in 16KB chunks.                            */

    struct {
      __IOM uint32_t FW0BITS    : 32;           /*!< Write protect flash 0x00000000 - 0x0007FFFF. Each bit provides
                                                     write protection for 16KB chunks of flash data space. Bits
                                                     are cleared by writing a 1 to the bit. When read, 0 indicates
                                                     the region is protected. Bits are sticky (can be set when
                                                     PROTLOCK is 1, but only cleared by reset)                                 */
    } FLASHWPROT0_b;
  } ;

  union {
    __IOM uint32_t FLASHWPROT1;                 /*!< These bits write-protect flash in 16KB chunks.                            */

