AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4l_generic.h
    struct {
      __IOM uint32_t AUDADCPWR0 : 8;            /*!< ADC Reference Buffer Power Enable delay in 64 ADC CLK increments
                                                     for ADC_CLKSEL = 0x1, 32 ADC CLOCK increments for ADC_CLKSEL
                                                     = 0x2.                                                                    */
      __IOM uint32_t AUDADCPWR1 : 8;            /*!< ADC Reference Keeper enable delay in 16 ADC CLK increments for
                                                     ADC_CLKSEL = 0x1, 8 ADC CLOCK increments for ADC_CLKSEL
                                                     = 0x2.                                                                    */
            uint32_t            : 16;
    } AUDADCPWRDLY_b;
  } ;
  __IM  uint32_t  RESERVED27[2];

  union {
    __IOM uint32_t SDIOCTRL;                    /*!< SDIO/eMMC Control                                                         */

    struct {
      __IOM uint32_t SDIOSYSCLKEN : 1;          /*!< SDIO system clock enable.                                                 */
      __IOM uint32_t SDIOXINCLKEN : 1;          /*!< SDIO serial clock source enable.                                          */
      __IOM uint32_t SDIOITAPCHGWIN : 1;        /*!< This is used to gate the output of the Tap Delay lines so as
                                                     to avoid glithches being propagated into the Core. This
                                                     signal should be asserted few clocks before the itapdlysel
                                                     changes and should be asserted for few clocks after.                      */
      __IOM uint32_t SDIOITAPDLYENA : 1;        /*!< Used to enable selective Tap delay line on the Looped back SD
                                                     Clock (rxclk_in). This signal along with the itapdlysel[4:0]
                                                     selects the the amount of delay to be inserted on the line.
                                                     When Tuning is enabled (for SDR104 and optionally for SDR50),
                                                     this signal is ignored and internalcontrols are used instead.
                                                     This should not be asserted when operating in DS mode.                    */
      __IOM uint32_t SDIOITAPDLYSEL : 5;        /*!< Selects one of the 32 Taps on the rxclk_in line. This is effective
                                                     only when itapdlyena is asserted and Tuning is not enabled.               */
      __IOM uint32_t SDIOOTAPDLYENA : 1;        /*!< Used to enable the selective Tap delay on the sdcard_clk so
                                                     as to generate the delayed sdcard_clk. This is used to
                                                     latch the CMD/DAT outputs to generate delay on them w.r.t
                                                     CLK going out. This signal along with otapdlysel[3:0] selects
                                                     the amount of delay to be inserted on the Clock line. This
                                                     signal should not be asserted when operating in DS mode.                  */
      __IOM uint32_t SDIOOTAPDLYSEL : 4;        /*!< Selects one of the 16 Taps on the sdcard_clk. This is effective
                                                     only when otapdlyena is asserted.                                         */
      __IOM uint32_t SDIOASYNCWKUPENA : 1;      /*!< SDIO asynchronous wakeup mode. 0: Synchronous wakeup mode, 1:
                                                     Asynchronous wakeup mode                                                  */
      __IOM uint32_t SDIOXINCLKSEL : 2;         /*!< Select clock source for SDIO xin_clk.                                     */
      __IOM uint32_t SDIOCMDOPENDRAINEN : 1;    /*!< SDIO CMD line configured as open-drian. 0: Push-pull mode, 1:
                                                     Open-drain mode                                                           */
      __IOM uint32_t SDIODATOPENDRAINEN : 1;    /*!< SDIO DAT line configured as open-drian. 0: Push-pull mode, 1:
                                                     Open-drain mode                                                           */
            uint32_t            : 13;
    } SDIOCTRL_b;
  } ;

  union {
    __IOM uint32_t PDMCTRL;                     /*!< PDM Control                                                               */

    struct {
      __IOM uint32_t PDMGLOBALEN : 1;           /*!< PDM global enable to allow all PDMs to have synchronized interface
                                                     clocks and FIFO sampling.                                                 */
            uint32_t            : 31;
    } PDMCTRL_b;
  } ;
} MCUCTRL_Type;                                 /*!< Size = 1112 (0x458)                                                       */



/* =========================================================================================================================== */
/* ================                                           MSPI0                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Multi-bit SPI Master (MSPI0)
  */

typedef struct {                                /*!< MSPI0 Structure                                                           */

  union {
    __IOM uint32_t CTRL;                        /*!< This register is used to enable individual PIO based transactions
                                                     to a device on the bus. The CFG register must be programmed
                                                     properly for the transfer, and the ADDR and INSTR registers
                                                     should be programmed if the SENDI and SENDA fields are
                                                     enabled.                                                                  */

