AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4l_generic.h
    struct {
      __IOM uint32_t DEVCFG0    : 5;            /*!< Flash configuration for XIP and AUTO DMA operations. Controls
                                                     value for SER (Slave Enable) for XIP operations and address
                                                     generation for DMA/XIP modes. Also used to configure SPIFRF
                                                     (frame format).                                                           */
      __IOM uint32_t ASIZE0     : 2;            /*!< Address Size. Address bytes to send from ADDR register                    */
      __IOM uint32_t ISIZE0     : 1;            /*!< Instruction Size                                                          */
      __IOM uint32_t TURNAROUND0 : 6;           /*!< Number of turnaound cycles (for TX->RX transitions). Qualified
                                                     by ENTURN bit field.                                                      */
      __IOM uint32_t CPHA0      : 1;            /*!< Serial clock phase.                                                       */
      __IOM uint32_t CPOL0      : 1;            /*!< Serial clock polarity.                                                    */
      __IOM uint32_t CLKDIV0    : 6;            /*!< Clock Divider. Allows dividing 96 MHz base clock by integer
                                                     multiples. Enumerations are provided for common frequency,
                                                     but any integer divide from 96 MHz is allowed. Odd divide
                                                     ratios will result in a 33/66 percent duty cycle with a
                                                     long low clock pulse (to allow longer round-trip for read
                                                     data).                                                                    */
      __IOM uint32_t RXCAP0     : 1;            /*!< Controls RX data capture phase. A setting of 0 (NORMAL) captures
                                                     read data at the normal capture point relative to the internal
                                                     clock launch point. However, to accomodate chip/pad/board
                                                     delays, a setting of RXCAP of 1 is expected to be used
                                                     to align the capture point with the return data window.
                                                     This bit is used in conjunction with RXNEG to provide 4
                                                     unique capture points, all about 10ns apart.                              */
      __IOM uint32_t RXNEG0     : 1;            /*!< Adjusts the RX capture phase to the negedge of the 48MHz internal
                                                     clock (~10ns early). For normal operation, it is expected
                                                     that RXNEG will be set to 0.                                              */
      __IOM uint32_t TXNEG0     : 1;            /*!< Launches TX data a half clock cycle (~10ns) early. This should
                                                     normally be programmed to zero (NORMAL).                                  */
      __IOM uint32_t SEPIO0     : 1;            /*!< Separate IO configuration. This bit should be set when the target
                                                     device has separate MOSI and MISO pins. Respective IN/OUT
                                                     bits below should be set to map pins.                                     */
      __IOM uint32_t WRITELATENCY0 : 6;         /*!< Number of write Latency cycles. Qualified by ENTURN bit field.            */
    } DEV0CFG_b;
  } ;

  union {
    __IOM uint32_t DEV0DDR;                     /*!< Timing configuration bits for DDR operation of the MSPI module.           */

    struct {
      __IOM uint32_t EMULATEDDR0 : 1;           /*!< Drive external clock at 1/2 rate to emulate DDR mode                      */
      __IOM uint32_t QUADDDR0   : 1;            /*!< Deprecated. No effect on RevC.                                            */
      __IOM uint32_t ENABLEDQS0 : 1;            /*!< In EMULATEDDR mode, enable DQS for read capture                           */
      __IOM uint32_t DQSSYNCNEG0 : 1;           /*!< Use negative edge of clock for DDR data sync                              */
      __IOM uint32_t ENABLEFINEDELAY0 : 1;      /*!< Enables use of delay line to provide fine control over traditional
                                                     RX capture clock.                                                         */
      __IOM uint32_t TXDQSDELAY0 : 5;           /*!< This acts as an offset to the computed value (should be set
                                                     to 0 by default)                                                          */
      __IOM uint32_t RXDQSDELAY0 : 5;           /*!< This acts as an offset to the computed value (should be set
                                                     to 0 by default)                                                          */
      __IOM uint32_t RXDQSDELAYNEG0 : 5;        /*!< This acts as an offset to the computed value (should be set
                                                     to 0 by default) of falling edge.                                         */
      __IOM uint32_t RXDQSDELAYNEGEN0 : 1;      /*!< When 1, RXDQSDELAYNEG is used for falling edge of the clock.              */
      __IOM uint32_t RXDQSDELAYHI0 : 5;         /*!< This acts as an offset to the computed value (should be set
                                                     to 0 by default) for 2nd DQS on HEX mode.                                 */
      __IOM uint32_t RXDQSDELAYNEGHI0 : 5;      /*!< This acts as an offset to the computed value (should be set
                                                     to 0 by default) of falling edge for 2nd DQS on HEX mode.                 */
      __IOM uint32_t RXDQSDELAYHIEN0 : 1;       /*!< When 1, RXDQSDELAYHI and RXDQSDELAYNEGHI is used for falling
                                                     edge of the clock.                                                        */
    } DEV0DDR_b;
  } ;

  union {
    __IOM uint32_t DEV0CFG1;                    /*!< Timing and mode configuration bits for the MSPI module.                   */

