AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4l_generic.h
    struct {
      __IOM uint32_t DMATIMELIMIT0 : 12;        /*!< DMA time limit. Can be used to limit the transaction time on
                                                     the MSPI bus. The count is in ~100 ns increments for the
                                                     96 MHz clock input. A value of 0 disables the counter.                    */
      __IOM uint32_t DMABOUND0  : 4;            /*!< DMA Address boundary                                                      */
            uint32_t            : 16;
    } DEV0BOUNDARY_b;
  } ;

  union {
    __IOM uint32_t DEV0SCRAMBLING;              /*!< Enables data scrambling for the specified range external flash
                                                     addresses. Scrambling does not impact flash access performance.           */

    struct {
      __IOM uint32_t SCRSTART0  : 10;           /*!< Scrambling region start address [25:16] (64K block granularity).
                                                     The START block is the FIRST block included in the scrambled
                                                     address range.                                                            */
            uint32_t            : 6;
      __IOM uint32_t SCREND0    : 10;           /*!< Scrambling region end address [25:16] (64K block granularity).
                                                     The END block is the LAST block included in the scrambled
                                                     address range.                                                            */
            uint32_t            : 5;
      __IOM uint32_t SCRENABLE0 : 1;            /*!< Enables Data Scrambling Region. When 1 reads and writes to the
                                                     range will be scrambled. When 0, data will be read/written
                                                     unmodified. Address range is specified in 64K granularity
                                                     and the START/END ranges are included within the range.                   */
    } DEV0SCRAMBLING_b;
  } ;

  union {
    __IOM uint32_t DEV0XIPMISC;                 /*!< Miscellaneous XIP control registers for AXI logic                         */

    struct {
      __IOM uint32_t CEBREAK0   : 12;           /*!< CEBREAK0 field description needed.                                        */
      __IOM uint32_t XIPODD0    : 1;            /*!< Convert odd starting address to word-aligned starting address
                                                     with byte-enables for holes. For example, an AXI transaction
                                                     with wstrb of 0x0600 results in mspi transaction of addr=8
                                                     and BE=0b1001 ( active low ).                                             */
      __IOM uint32_t BEPOL0     : 1;            /*!< byte mask polarity to MSPI xfer                                           */
      __IOM uint32_t BEON0      : 1;            /*!< Byte enable always on for all lanes                                       */
      __IOM uint32_t XIPBOUNDARY0 : 1;          /*!< Deprecated. No effect on RevC.                                            */
            uint32_t            : 5;
      __IOM uint32_t APNDODD0   : 1;            /*!< Append dummy byte to odd number of write                                  */
            uint32_t            : 10;
    } DEV0XIPMISC_b;
  } ;
  __IM  uint32_t  RESERVED3[23];

  union {
    __IOM uint32_t DMACFG;                      /*!< DMA Configuration                                                         */

    struct {
      __IOM uint32_t DMAEN      : 2;            /*!< DMA Enable. Setting this bit to EN will start the DMA operation           */
      __IOM uint32_t DMADIR     : 1;            /*!< Direction                                                                 */
      __IOM uint32_t DMADEV     : 1;            /*!< DMA Device Select                                                         */
      __IOM uint32_t DMAPRI     : 2;            /*!< Sets the Priority of the DMA request                                      */
            uint32_t            : 11;
      __IOM uint32_t DMATXEMPT  : 1;            /*!< For DMA_M2P, only start when DMA fifo is not empty.                       */
      __IOM uint32_t DMAPWROFF  : 1;            /*!< Power off MSPI domain upon completion of DMA operation.                   */
            uint32_t            : 13;
    } DMACFG_b;
  } ;

  union {
    __IOM uint32_t DMASTAT;                     /*!< DMA Status                                                                */

    struct {
      __IOM uint32_t DMATIP     : 1;            /*!< DMA Transfer In Progress indicator. 1 will indicate that a DMA
                                                     transfer is active. The DMA transfer may be waiting on
                                                     data, transferring data, or waiting for priority. All of
                                                     these will be indicated with a 1. A 0 will indicate that
                                                     the DMA is fully complete and no further transactions will
                                                     be done.                                                                  */
      __IOM uint32_t DMACPL     : 1;            /*!< DMA Transfer Complete. This signals the end of the DMA operation.         */
      __IOM uint32_t DMAERR     : 1;            /*!< DMA Error. This active high bit signals that an error was encountered
                                                     during the DMA operation.                                                 */
      __IOM uint32_t SCRERR     : 1;            /*!< Scrambling Access Alignment Error. This active high bit signals
                                                     that a scrambling operation was specified for a non-word
                                                     aligned DEVADDR.                                                          */
            uint32_t            : 28;
    } DMASTAT_b;
  } ;

  union {
    __IOM uint32_t DMATARGADDR;                 /*!< DMA Target Address                                                        */

