AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4l_generic.h
    struct {
      __IOM uint32_t CMDCMP     : 1;            /*!< Transfer complete. Note that DMA and CQ operations are layered,
                                                     so CMDCMP, DCMP, and CQ* can all be signaled simultaneously.              */
      __IOM uint32_t TXE        : 1;            /*!< Transmit FIFO empty.                                                      */
      __IOM uint32_t TXO        : 1;            /*!< Transmit FIFO Overflow (only occurs when SW writes to a full
                                                     FIFO).                                                                    */
      __IOM uint32_t RXU        : 1;            /*!< Receive FIFO underflow (only occurs when SW reads from an empty
                                                     FIFO)                                                                     */
      __IOM uint32_t RXO        : 1;            /*!< Receive FIFO overflow (cannot happen in MSPI design -- MSPI
                                                     bus pins will stall)                                                      */
      __IOM uint32_t RXF        : 1;            /*!< Receive FIFO full                                                         */
      __IOM uint32_t DCMP       : 1;            /*!< DMA Complete Interrupt                                                    */
      __IOM uint32_t DERR       : 1;            /*!< DMA Error Interrupt                                                       */
      __IOM uint32_t CQCMP      : 1;            /*!< Command Queue Complete Interrupt                                          */
      __IOM uint32_t CQUPD      : 1;            /*!< Command Queue Update Interrupt. Issued whenever the CQ performs
                                                     an operation where address bit[0] is set. Useful for triggering
                                                     CURIDX interrupts.                                                        */
      __IOM uint32_t CQPAUSED   : 1;            /*!< Command Queue is Paused.                                                  */
      __IOM uint32_t CQERR      : 1;            /*!< Command Queue Error Interrupt                                             */
      __IOM uint32_t SCRERR     : 1;            /*!< Scrambling Alignment Error. Scrambling operations must be aligned
                                                     to word (4-byte) start address.                                           */
      __IOM uint32_t APBDMAERR  : 1;            /*!< MSPI is dma target as well as dma source, which may result in
                                                     deadlock.                                                                 */
            uint32_t            : 18;
    } INTSET_b;
  } ;
  __IM  uint32_t  RESERVED5[36];

  union {
    __IOM uint32_t CQCFG;                       /*!< This register controls Command Queuing (CQ) operations in a
                                                     manner similar to the DMACFG register.                                    */

    struct {
      __IOM uint32_t CQEN       : 1;            /*!< Command queue enable. When set, will enable the processing of
                                                     the command queue                                                         */
      __IOM uint32_t CQPRI      : 1;            /*!< Sets the Priority of the command queue DMA request                        */
      __IOM uint32_t CQPWROFF   : 1;            /*!< Power off MSPI domain upon completion of DMA operation.                   */
      __IOM uint32_t CQAUTOCLEARMASK : 1;       /*!< Enable clear of CQMASK after each pause operation. This may
                                                     be useful when using software flags to pause CQ.                          */
      __IOM uint32_t CQPAUSEOP  : 1;            /*!< CQPAUSEOP register description needed.                                    */
            uint32_t            : 27;
    } CQCFG_b;
  } ;
  __IM  uint32_t  RESERVED6;

  union {
    __IOM uint32_t CQADDR;                      /*!< Location of the command queue in SRAM or flash memory. This
                                                     register will increment as CQ operations commence. Software
                                                     should only write CQADDR when CQEN is disabled, however
                                                     the command queue script itself may update CQADDR in order
                                                     to perform queue management functions (like resetting the
                                                     pointers)                                                                 */

    struct {
      __IOM uint32_t CQADDR     : 29;           /*!< Address of command queue buffer in SRAM or flash. The buffer
                                                     address must be aligned to a word boundary.                               */
            uint32_t            : 3;
    } CQADDR_b;
  } ;

  union {
    __IOM uint32_t CQSTAT;                      /*!< Command Queue Status                                                      */

    struct {
      __IOM uint32_t CQTIP      : 1;            /*!< Command queue Transfer In Progress indicator. 1 will indicate
                                                     that a CQ transfer is active and this will remain active
                                                     even when paused waiting for external event.                              */
      __IOM uint32_t CQCPL      : 1;            /*!< Command queue operation Complete. This signals the end of the
                                                     command queue operation.                                                  */
      __IOM uint32_t CQERR      : 1;            /*!< Command queue processing Error. This active high bit signals
                                                     that an error was encountered during the CQ operation.                    */
      __IOM uint32_t CQPAUSED   : 1;            /*!< Command queue is currently paused status.                                 */
            uint32_t            : 28;
    } CQSTAT_b;
  } ;

  union {
    __IOM uint32_t CQFLAGS;                     /*!< Command Queue Flags                                                       */

