AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4l_generic.h
    struct {
      __IOM uint32_t CQFLAGS    : 16;           /*!< Current flag status (read-only). Bits [7:0] are software controllable
                                                     and bits [15:8] are hardware status.                                      */
            uint32_t            : 16;
    } CQFLAGS_b;
  } ;

  union {
    __IOM uint32_t CQSETCLEAR;                  /*!< Command Queue Flag Set/Clear                                              */

    struct {
      __IOM uint32_t CQFSET     : 8;            /*!< Set CQFlag status bits. Set has priority over clear if both
                                                     are high.                                                                 */
      __IOM uint32_t CQFTOGGLE  : 8;            /*!< Toggle CQFlag status bits                                                 */
      __IOM uint32_t CQFCLR     : 8;            /*!< Clear CQFlag status bits.                                                 */
            uint32_t            : 8;
    } CQSETCLEAR_b;
  } ;

  union {
    __IOM uint32_t CQPAUSE;                     /*!< Command Queue Pause Mask                                                  */

    struct {
      __IOM uint32_t CQMASK     : 16;           /*!< CQ will pause processing when ALL specified events are satisfied
                                                     -- i.e. when (CQMASK and CQPAUSE)==CQMASK.                                */
            uint32_t            : 16;
    } CQPAUSE_b;
  } ;
  __IM  uint32_t  RESERVED7;

  union {
    __IOM uint32_t CQCURIDX;                    /*!< This register can be used in conjunction with the CQENDIDX register
                                                     to manage the command queue. Typically software will initialize
                                                     the CQCURIDX and CQENDIDX to the same value, which will
                                                     cause the CQ to be paused when enabled. Software may then
                                                     add entries to the command queue (in SRAM) and update CQENDIDX.
                                                     The command queue operations will then increment CQCURIDX
                                                     as it processes operations. Once CQCURIDX==CQENDIDX, the
                                                     command queue hardware will automatically pause since no
                                                     additional operations have been appended to the queue.                    */

    struct {
      __IOM uint32_t CQCURIDX   : 8;            /*!< Can be used to indicate the current position of the command
                                                     queue by having CQ operations write this field. A CQ hardware
                                                     status flag indicates when CURIDX and ENDIDX are not equal,
                                                     allowing SW to pause the CQ processing until the end index
                                                     is updated.                                                               */
            uint32_t            : 24;
    } CQCURIDX_b;
  } ;

  union {
    __IOM uint32_t CQENDIDX;                    /*!< Command Queue End Index                                                   */

    struct {
      __IOM uint32_t CQENDIDX   : 8;            /*!< Can be used to indicate the end position of the command queue.
                                                     A CQ hardware status bit indices when CURIDX != ENDIDX
                                                     so that the CQ can be paused when it reaches the end pointer.             */
            uint32_t            : 24;
    } CQENDIDX_b;
  } ;
  __IM  uint32_t  RESERVED8[18];

  union {
    __IOM uint32_t STATXIPDMA;                  /*!< Debug XIP DMA State                                                       */

    struct {
      __IOM uint32_t FLD32      : 32;           /*!< XIP/DMA module debug                                                      */
    } STATXIPDMA_b;
  } ;
} MSPI0_Type;                                   /*!< Size = 788 (0x314)                                                        */



/* =========================================================================================================================== */
/* ================                                           PDM0                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief PDM Audio (PDM0)
  */

typedef struct {                                /*!< PDM0 Structure                                                            */

  union {
    __IOM uint32_t CTRL;                        /*!< PDM Control                                                               */

    struct {
      __IOM uint32_t CLKEN      : 1;            /*!< PDM Clock enable.If multiple clocks are enabled, priority is
                                                     HFRC2, HF XTAL, HFRC.                                                     */
      __IOM uint32_t CLKSEL     : 2;            /*!< PDM Master Clock select (24.576MHz).0: HFRC2_192MHz div8 with
                                                     HFAdj21: XTAL_HS Byapss2: HFRC_96MHz div4                                 */
            uint32_t            : 1;
      __IOM uint32_t RSTB       : 1;            /*!< Reset IP core. 0 puts the core in reset; 1 takes the core out
                                                     of reset.                                                                 */
      __IOM uint32_t PCMPACK    : 1;            /*!< Enable PCM packing. Only 24-bit unpacked mode supported.                  */
      __IOM uint32_t EN         : 1;            /*!< PDM enable register                                                       */
            uint32_t            : 25;
    } CTRL_b;
  } ;

  union {
    __IOM uint32_t CORECFG0;                    /*!< PDM to PCM Core Configuration                                             */

