AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4l_generic.h
    struct {
      __IOM uint32_t TOTCOUNT   : 20;           /*!< Total Transfer Count. The transfer count must be a multiple
                                                     of the THR setting to avoid DMA overruns.                                 */
            uint32_t            : 12;
    } DMATOTCOUNT_b;
  } ;
} PDM0_Type;                                    /*!< Size = 596 (0x254)                                                        */



/* =========================================================================================================================== */
/* ================                                          PWRCTRL                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief PWR Controller Register Bank (PWRCTRL)
  */

typedef struct {                                /*!< PWRCTRL Structure                                                         */

  union {
    __IOM uint32_t MCUPERFREQ;                  /*!< This register provides the performance mode knobs for MCU. S/w
                                                     should write the *PERFREQ field to desired mode and wait
                                                     for the *PERFACK and check for the *PERFSTATUS. Some times
                                                     system may not allow certain modes but *PERFACK should
                                                     always follow *PERFREQ change.                                            */

    struct {
      __IOM uint32_t MCUPERFREQ : 2;            /*!< MCU Performance mode request                                              */
      __IOM uint32_t MCUPERFACK : 1;            /*!< Indicates the MCU performance status indicated in STATUS register
                                                     is valid.                                                                 */
      __IOM uint32_t MCUPERFSTATUS : 2;         /*!< MCU Performance mode request                                              */
            uint32_t            : 27;
    } MCUPERFREQ_b;
  } ;

  union {
    __IOM uint32_t DEVPWREN;                    /*!< This enables various peripherals power domains.                           */

    struct {
      __IOM uint32_t PWRENIOS   : 1;            /*!< Power up IO Slave                                                         */
      __IOM uint32_t PWRENIOM0  : 1;            /*!< Power up IO Master 0                                                      */
      __IOM uint32_t PWRENIOM1  : 1;            /*!< Power up IO Master 1                                                      */
      __IOM uint32_t PWRENIOM2  : 1;            /*!< Power up IO Master 2                                                      */
      __IOM uint32_t PWRENIOM3  : 1;            /*!< Power up IO Master 3                                                      */
      __IOM uint32_t PWRENIOM4  : 1;            /*!< Power up IO Master 4                                                      */
      __IOM uint32_t PWRENIOM5  : 1;            /*!< Power up IO Master 5                                                      */
      __IOM uint32_t PWRENIOM6  : 1;            /*!< Power up IO Master 6                                                      */
      __IOM uint32_t PWRENIOM7  : 1;            /*!< Power up IO Master 7                                                      */
      __IOM uint32_t PWRENUART0 : 1;            /*!< Power up UART Controller 0                                                */
      __IOM uint32_t PWRENUART1 : 1;            /*!< Power up UART Controller 1                                                */
      __IOM uint32_t PWRENUART2 : 1;            /*!< Power up UART Controller 2                                                */
      __IOM uint32_t PWRENUART3 : 1;            /*!< Power up UART Controller 3                                                */
      __IOM uint32_t PWRENADC   : 1;            /*!< Power up ADC Digital Controller                                           */
      __IOM uint32_t PWRENMSPI0 : 1;            /*!< Power up MSPI Controller0                                                 */
      __IOM uint32_t PWRENMSPI1 : 1;            /*!< Power up MSPI Controller1                                                 */
      __IOM uint32_t PWRENMSPI2 : 1;            /*!< Power up MSPI Controller2                                                 */
      __IOM uint32_t PWRENGFX   : 1;            /*!< Power up GFX controller                                                   */
            uint32_t            : 2;
      __IOM uint32_t PWRENCRYPTO : 1;           /*!< Power up CRYPTO module                                                    */
      __IOM uint32_t PWRENSDIO  : 1;            /*!< Power up SDIO controller                                                  */
            uint32_t            : 2;
      __IOM uint32_t PWRENDBG   : 1;            /*!< Powerup DBG power domain                                                  */
            uint32_t            : 7;
    } DEVPWREN_b;
  } ;

  union {
    __IOM uint32_t DEVPWRSTATUS;                /*!< This provides the power status for the peripheral device domains
                                                     controlled through DEVPWREN register. Value of 1 means
                                                     the device is powred up and ready to be used and 0 means
                                                     its not powered up.                                                       */

    struct {
      __IOM uint32_t PWRSTIOS   : 1;            /*!< Power status IO Slave                                                     */
      __IOM uint32_t PWRSTIOM0  : 1;            /*!< Power status IO Master 0                                                  */
      __IOM uint32_t PWRSTIOM1  : 1;            /*!< Power status IO Master 1                                                  */
      __IOM uint32_t PWRSTIOM2  : 1;            /*!< Power status IO Master 2                                                  */
      __IOM uint32_t PWRSTIOM3  : 1;            /*!< Power status IO Master 3                                                  */
      __IOM uint32_t PWRSTIOM4  : 1;            /*!< Power status IO Master 4                                                  */
      __IOM uint32_t PWRSTIOM5  : 1;            /*!< Power Status IO Master 5                                                  */
      __IOM uint32_t PWRSTIOM6  : 1;            /*!< Power Status IO Master 6                                                  */
      __IOM uint32_t PWRSTIOM7  : 1;            /*!< Power Status IO Master 7                                                  */
      __IOM uint32_t PWRSTUART0 : 1;            /*!< Power Status UART Controller 0                                            */
      __IOM uint32_t PWRSTUART1 : 1;            /*!< Power Status UART Controller 1                                            */
      __IOM uint32_t PWRSTUART2 : 1;            /*!< Power Status UART Controller 2                                            */
      __IOM uint32_t PWRSTUART3 : 1;            /*!< Power Status UART Controller 3                                            */
      __IOM uint32_t PWRSTADC   : 1;            /*!< Power Status ADC Digital Controller                                       */
      __IOM uint32_t PWRSTMSPI0 : 1;            /*!< Power Status MSPI Controller0                                             */
      __IOM uint32_t PWRSTMSPI1 : 1;            /*!< Power Status MSPI Controller1                                             */
      __IOM uint32_t PWRSTMSPI2 : 1;            /*!< Power Status MSPI Controller2                                             */
      __IOM uint32_t PWRSTGFX   : 1;            /*!< Power Status GFX controller                                               */
            uint32_t            : 2;
      __IOM uint32_t PWRSTCRYPTO : 1;           /*!< Power Status CRYPTO module                                                */
      __IOM uint32_t PWRSTSDIO  : 1;            /*!< Power Status SDIO controller                                              */
            uint32_t            : 2;
      __IOM uint32_t PWRSTDBG   : 1;            /*!< Power Status DBG subsystem                                                */
            uint32_t            : 7;
    } DEVPWRSTATUS_b;
  } ;

  union {
    __IOM uint32_t AUDSSPWREN;                  /*!< This enables various power domains in audio subsystem.                    */

