AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4l_generic.h
    struct {
      __IOM uint32_t PWRENAUDREC : 1;           /*!< Power up Audio Record                                                     */
      __IOM uint32_t PWRENAUDPB : 1;            /*!< Power up Audio Playback                                                   */
      __IOM uint32_t PWRENPDM0  : 1;            /*!< Power up audio subsystem PDM0 domain                                      */
            uint32_t            : 3;
      __IOM uint32_t PWRENI2S0  : 1;            /*!< Power up audio subsystem I2S0 domain                                      */
      __IOM uint32_t PWRENI2S1  : 1;            /*!< Power up audio subsystem legacy I2S1 domain. I2S1 domain must
                                                     be disabled. I2S1 is not available in Apoll4L.                            */
            uint32_t            : 24;
    } AUDSSPWREN_b;
  } ;

  union {
    __IOM uint32_t AUDSSPWRSTATUS;              /*!< This provides the power status for the peripheral domains controlled
                                                     through AUDSSPWREN register. Value of 1 means the device
                                                     is powred up and ready to be used and 0 means its not powered
                                                     up.                                                                       */

    struct {
      __IOM uint32_t PWRSTAUDREC : 1;           /*!< Power Status Audio Record block                                           */
      __IOM uint32_t PWRSTAUDPB : 1;            /*!< Power Status Audio Playback block                                         */
      __IOM uint32_t PWRSTPDM0  : 1;            /*!< Power Status audio subsystem PDM0 domain                                  */
            uint32_t            : 3;
      __IOM uint32_t PWRSTI2S0  : 1;            /*!< Power Status audio subsystem I2S0 domain                                  */
      __IOM uint32_t PWRSTI2S1  : 1;            /*!< Power Status audio subsystem legacy I2S1 domain. I2S1 is not
                                                     available in Apoll4L.                                                     */
            uint32_t            : 24;
    } AUDSSPWRSTATUS_b;
  } ;

  union {
    __IOM uint32_t MEMPWREN;                    /*!< This register enables the individual banks for the memories.
                                                     When set, power will be enabled to the banks. This register
                                                     works in conjunction with the MEMRETCFG register. If this
                                                     register is not set, then power will always be disabled
                                                     to the memory bank.                                                       */

    struct {
      __IOM uint32_t PWRENDTCM  : 3;            /*!< Power up DTCM                                                             */
      __IOM uint32_t PWRENNVM0  : 1;            /*!< Power up NVM0                                                             */
      __IOM uint32_t PWRENCACHEB0 : 1;          /*!< Power up Cache Bank 0. This works in conjunction with Cache
                                                     enable from flash_cache module. To power up cache bank0,
                                                     cache has to be enabled and this bit has to be set.                       */
      __IOM uint32_t PWRENCACHEB2 : 1;          /*!< Power up Cache Bank 2. This works in conjunction with Cache
                                                     enable from flash_cache module. To power up cache bank2,
                                                     cache has to be enabled and this bit has to be set.                       */
            uint32_t            : 26;
    } MEMPWREN_b;
  } ;

  union {
    __IOM uint32_t MEMPWRSTATUS;                /*!< It provides the power status for all the memory banks including-
                                                     caches, nvm (0 and 1) and all the SRAM groups. The status
                                                     here should reflect the enable provided by the MEMPWREN
                                                     register. There may be a lag time between setting the bits
                                                     in MEMPWREN register and MEMPWRSTATUS register, due to
                                                     the need to cycle the power gate and isolation seqeunces
                                                     to the memory banks.                                                      */

    struct {
      __IOM uint32_t PWRSTDTCM  : 3;            /*!< Power status for DTCM. Each bit corresponds to one of the TCMs.
                                                     bit0=DTCM0_0, bit1=DTCM0_1, bit2=DTCM1.                                   */
      __IOM uint32_t PWRSTNVM0  : 1;            /*!< This bit is 1 if power is supplied to NVM 0                               */
      __IOM uint32_t PWRSTCACHEB0 : 1;          /*!< This bit is 1 if power is supplied to Cache Bank 0                        */
      __IOM uint32_t PWRSTCACHEB2 : 1;          /*!< This bit is 1 if power is supplied to Cache Bank 2                        */
            uint32_t            : 26;
    } MEMPWRSTATUS_b;
  } ;

  union {
    __IOM uint32_t MEMRETCFG;                   /*!< This controls the power down of the SRAM banks in deep sleep
                                                     mode. If this is set, then the power for that SRAM bank
                                                     will be gated when the core goes into deep sleep. Upon
                                                     wake, the data within the SRAMs will be erased. If this
                                                     is not set, retention voltage will be applied to the SRAM
                                                     bank when the core goes into deep sleep. Upon wake, the
                                                     data within the SRAMs are retained. Do not set this if
                                                     the SRAM bank is used as the target for DMA transfer while
                                                     CPU in deepsleep.                                                         */

