AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4l_generic.h
    struct {
      __IOM uint32_t DTCMPWDSLP : 3;            /*!< power down DTCM in deep sleep                                             */
      __IOM uint32_t NVM0PWDSLP : 1;            /*!< Powerdown NVM0 in deep sleep                                              */
      __IOM uint32_t CACHEPWDSLP : 1;           /*!< power down cache in deep sleep                                            */
            uint32_t            : 27;
    } MEMRETCFG_b;
  } ;

  union {
    __IOM uint32_t SYSPWRSTATUS;                /*!< Power ON Status for domains that are not part of devpwrstatus
                                                     or mempwrstatus                                                           */

    struct {
      __IOM uint32_t PWRSTMCUL  : 1;            /*!< Power Domain status for MCUL                                              */
      __IOM uint32_t PWRSTMCUH  : 1;            /*!< Power Domain status for MCUH                                              */
      __IOM uint32_t PWRSTDSP0H : 1;            /*!< Power Domain status for DSP0H                                             */
      __IOM uint32_t PWRSTDSP1H : 1;            /*!< Power Domain status for DSP1H                                             */
            uint32_t            : 25;
      __IOM uint32_t CORESLEEP  : 1;            /*!< Indicates MCU entered SLEEP state since it was last cleared.
                                                     Write 1 to to clear it.                                                   */
      __IOM uint32_t COREDEEPSLEEP : 1;         /*!< Indicates MCU entered DEEPSLEEP state since it was last cleared.
                                                     Write 1 to to clear it.                                                   */
      __IOM uint32_t SYSDEEPSLEEP : 1;          /*!< Indicates all device domains powered down and MCU entered DEEPSLEEP
                                                     state since it was last cleared. Write 1 to to clear it.                  */
    } SYSPWRSTATUS_b;
  } ;

  union {
    __IOM uint32_t SSRAMPWREN;                  /*!< This register enables the individual banks for the memories.
                                                     When set, power will be enabled to the banks. This register
                                                     works in conjunction with the SSRAMRETCFG register. If
                                                     this register is not set, then power will always be disabled
                                                     to the memory bank.                                                       */

    struct {
      __IOM uint32_t PWRENSSRAM : 2;            /*!< Power up SRAM groups                                                      */
            uint32_t            : 30;
    } SSRAMPWREN_b;
  } ;

  union {
    __IOM uint32_t SSRAMPWRST;                  /*!< It provides the power status for shared sram banks. The status
                                                     here should reflect the enable provided by the SSRAMPWREN
                                                     register.                                                                 */

    struct {
      __IOM uint32_t SSRAMPWRST : 2;            /*!< Each bit corresponds to one 1M SSRAM group. Power Status- 1:ON,
                                                     0:OFF See SSRAMPWREN PWRENSSRAM for bit mapping. For example,
                                                     a value of 2 in this field would mean that SSRAM1 is powered
                                                     up and SSRAM0 is powered down.                                            */
            uint32_t            : 30;
    } SSRAMPWRST_b;
  } ;

  union {
    __IOM uint32_t SSRAMRETCFG;                 /*!< This controls the power down of the Shared SRAM banks in deep
                                                     sleep mode. If this is set, then the power for that SRAM
                                                     bank will be gated when the core goes into deep sleep.
                                                     Upon wake, the data within the SRAMs will be erased. If
                                                     this is not set, retention voltage will be applied to the
                                                     SRAM bank when none of the CPU agents are in powered up
                                                     and active mode. Do not set this if the SRAM bank is used
                                                     as the target for DMA transfer while CPU in deepsleep.                    */

    struct {
      __IOM uint32_t SSRAMPWDSLP : 2;           /*!< Selects which shared SRAM banks are powered down in deep sleep
                                                     mode, causing the contents of the bank to be lost.                        */
      __IOM uint32_t SSRAMACTMCU : 2;           /*!< Keep the memory domain active based on MCU state. Each bit corresponds
                                                     to a domain. 1: Keep SRAM active 0: Wakeup on demand (i.e.
                                                     when MCU is powered up)                                                   */
      __IOM uint32_t SSRAMACTDSP : 2;           /*!< Keep the memory domain active based on DSP state. Each bit corresponds
                                                     to a domain. 1: Keep SRAM active 0: Powerup on demand (i.e.
                                                     when DSP is powered up)                                                   */
      __IOM uint32_t SSRAMACTGFX : 2;           /*!< Keep the memory domain active based on GFX state. Each bit corresponds
                                                     to a domain. 1: Keep SRAM active 0: Powerup on demand (i.e.
                                                     when GFX is powered up)                                                   */
      __IOM uint32_t SSRAMACTDISP : 2;          /*!< Keep the memory domain active based on DISP state. Each bit
                                                     corresponds to a domain. 1: Keep SRAM active 0: Powerup
                                                     on demand (i.e. when DISP is powered up)                                  */
            uint32_t            : 22;
    } SSRAMRETCFG_b;
  } ;

  union {
    __IOM uint32_t DEVPWREVENTEN;               /*!< This register controls which feature trigger will result in
                                                     an event to the CPU. It includes all the power on status
                                                     for the core domains. If any bits are set, then if the
                                                     domain is turned on, it will result in an event to the
                                                     ARM core.                                                                 */

