AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4l_generic.h
    struct {
      __IOM uint32_t MCULEVEN   : 1;            /*!< Control MCUL power-on status event                                        */
      __IOM uint32_t MCUHEVEN   : 1;            /*!< Control MCUH power-on status event                                        */
      __IOM uint32_t HCPAEVEN   : 1;            /*!< Control HCPA power-on status event                                        */
      __IOM uint32_t HCPBEVEN   : 1;            /*!< Control HCPB power-on status event                                        */
      __IOM uint32_t HCPCEVEN   : 1;            /*!< Control HCPC power-on status event                                        */
      __IOM uint32_t ADCEVEN    : 1;            /*!< Control ADC power-on status event                                         */
      __IOM uint32_t MSPIEVEN   : 1;            /*!< Control MSPI power-on status event                                        */
      __IOM uint32_t AUDEVEN    : 1;            /*!< Control AUD power-on status event                                         */
            uint32_t            : 24;
    } DEVPWREVENTEN_b;
  } ;

  union {
    __IOM uint32_t MEMPWREVENTEN;               /*!< This register controls which power enable for the memories will
                                                     result in an event to the CPU. It includes all the power
                                                     on status for the memory domains. If any bits are set,
                                                     then if the domain is turned on, it will result in an event
                                                     to the ARM core.                                                          */

    struct {
      __IOM uint32_t DTCMEN     : 3;            /*!< Enable DTCM power-on status event                                         */
      __IOM uint32_t NVM0EN     : 1;            /*!< Control NVM power-on status event                                         */
      __IOM uint32_t CACHEB0EN  : 1;            /*!< Control CACHE BANK 0 power-on status event                                */
      __IOM uint32_t CACHEB2EN  : 1;            /*!< Control CACHEB2 power-on status event                                     */
            uint32_t            : 26;
    } MEMPWREVENTEN_b;
  } ;
  __IM  uint32_t  RESERVED[2];

  union {
    __IOM uint32_t MMSOVERRIDE;                 /*!< Power domain behavior overrides related to MMS ( Multimedia
                                                     System ).                                                                 */

    struct {
      __IOM uint32_t MMSOVRMCULDISP : 1;        /*!< MMS override for MCUL on by PD_DISP setting.                              */
      __IOM uint32_t MMSOVRMCULGFX : 1;         /*!< MMS override for MCUL on by PD_GFX setting.                               */
      __IOM uint32_t MMSOVRSSRAMDISP : 1;       /*!< MMS override for SSRAM power state by PD_DISP power setting.              */
      __IOM uint32_t MMSOVRSSRAMGFX : 1;        /*!< MMS override for SSRAM power state by PD_GFX power setting.               */
      __IOM uint32_t MMSOVRDSPRAMRETDISP : 2;   /*!< If set, retention equation doesn't consider DISP. Each bit corresponds
                                                     to a domain.                                                              */
      __IOM uint32_t MMSOVRDSPRAMRETGFX : 2;    /*!< If set, retention equation doesn't consider GFX. Each bit corresponds
                                                     to a domain.                                                              */
      __IOM uint32_t MMSOVRSSRAMRETDISP : 2;    /*!< If set, retention equation doesn't consider DISP. Each bit corresponds
                                                     to a domain.                                                              */
      __IOM uint32_t MMSOVRSSRAMRETGFX : 2;     /*!< If set, retention equation doesn't consider GFX. Each bit corresponds
                                                     to a domain.                                                              */
            uint32_t            : 20;
    } MMSOVERRIDE_b;
  } ;
  __IM  uint32_t  RESERVED1[3];

  union {
    __IOM uint32_t DSP0PWRCTRL;                 /*!< Power and RST controls for DSP0                                           */

    struct {
      __IOM uint32_t DSP0PCMRSTDLY : 4;         /*!< PCM Reset delay in number of 24MHz clocks.                                */
      __IOM uint32_t DSP0PCMRSTOR : 1;          /*!< PCM Reset override. If this is disabled, then h/w will handle
                                                     the de-assertion of pcm reset.                                            */
            uint32_t            : 27;
    } DSP0PWRCTRL_b;
  } ;

  union {
    __IOM uint32_t DSP0PERFREQ;                 /*!< This register provides the performance mode knobs for DSP0.
                                                     S/w should write the *PERFREQ field to desired mode and
                                                     wait for the *PERFACK and check for the *PERFSTATUS. Some
                                                     times system may not allow certain modes but *PERFACK should
                                                     always follow *PERFREQ change.                                            */

    struct {
      __IOM uint32_t DSP0PERFREQ : 2;           /*!< DSP0 Performance mode request                                             */
      __IOM uint32_t DSP0PERFACK : 1;           /*!< Indicates the DSP0 performance status indicated in STATUS register
                                                     is valid.                                                                 */
      __IOM uint32_t DSP0PERFSTATUS : 2;        /*!< DSP0 Performance mode request                                             */
            uint32_t            : 27;
    } DSP0PERFREQ_b;
  } ;

  union {
    __IOM uint32_t DSP0MEMPWREN;                /*!< This register enables the individual banks for the memories.
                                                     When set, power will be enabled to the banks. This register
                                                     works in conjunction with the DSP0MEMRETCFG register when
                                                     DSP0 is OFF.                                                              */

