AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4l_generic.h
    struct {
      __IOM uint32_t PWRENDSP0RAM : 1;          /*!< Power up DSP0 IRAM and DRAM                                               */
      __IOM uint32_t PWRENDSP0ICACHE : 1;       /*!< Power up DSP0 ICACHE banks                                                */
            uint32_t            : 30;
    } DSP0MEMPWREN_b;
  } ;

  union {
    __IOM uint32_t DSP0MEMPWRST;                /*!< It provides the power status for all the memories of DSP0 subsystem       */

    struct {
      __IOM uint32_t PWRSTDSP0RAM : 1;          /*!< Status- 1:ON, 0:OFF                                                       */
      __IOM uint32_t PWRSTDSP0ICACHE : 1;       /*!< Power Status- 1:ON, 0:OFF                                                 */
            uint32_t            : 30;
    } DSP0MEMPWRST_b;
  } ;

  union {
    __IOM uint32_t DSP0MEMRETCFG;               /*!< This controls the power down of the DRAM/IRAM/CACHE banks when
                                                     DSP0 is powered off. If this is set, then the power for
                                                     that corresponding SRAM bank will be gated when the DSP0
                                                     is powered off and data is erased. If this is not set,
                                                     retention voltage will be applied when DSP0 is powered
                                                     off. Do not set this if the SRAM bank is used as the target
                                                     for DMA transfer while DSP0 is powered off.                               */

    struct {
      __IOM uint32_t RAMPWDDSP0OFF : 1;         /*!< IRAM/DRAM banks are powered down when DSP0 is switched off,
                                                     causing the contents of the bank to be lost.                              */
      __IOM uint32_t DSP0RAMACTMCU : 1;         /*!< Keep the memory domain active based on MCU state.                         */
      __IOM uint32_t ICACHEPWDDSP0OFF : 1;      /*!< ICACHE is powered down when DSP0 is switched off, causing the
                                                     contents of the bank to be lost.                                          */
      __IOM uint32_t DSP0RAMACTDISP : 1;        /*!< Keep the memory domain active based on DISP state.                        */
      __IOM uint32_t DSP0RAMACTGFX : 1;         /*!< Keep the memory domain active based on GFX state.                         */
            uint32_t            : 27;
    } DSP0MEMRETCFG_b;
  } ;
  __IM  uint32_t  RESERVED2[3];

  union {
    __IOM uint32_t DSP1PWRCTRL;                 /*!< Power and RST controls for DSP1                                           */

    struct {
      __IOM uint32_t DSP1PCMRSTDLY : 4;         /*!< PCM Reset delay in number of 24MHz clocks.                                */
      __IOM uint32_t DSP1PCMRSTOR : 1;          /*!< PCM Reset override. If this is disabled, then h/w will handle
                                                     the de-assertion of pcm reset.                                            */
            uint32_t            : 27;
    } DSP1PWRCTRL_b;
  } ;

  union {
    __IOM uint32_t DSP1PERFREQ;                 /*!< This register provides the performance mode knobs for DSP1.
                                                     S/w should write the *PERFREQ field to desired mode and
                                                     wait for the *PERFACK and check for the *PERFSTATUS. Some
                                                     times system may not allow certain modes but *PERFACK should
                                                     always follow *PERFREQ change.                                            */

    struct {
      __IOM uint32_t DSP1PERFREQ : 2;           /*!< DSP1 Performance mode request                                             */
      __IOM uint32_t DSP1PERFACK : 1;           /*!< Indicates the DSP1 performance status indicated in STATUS register
                                                     is valid.                                                                 */
      __IOM uint32_t DSP1PERFSTATUS : 2;        /*!< DSP1 Performance mode request                                             */
            uint32_t            : 27;
    } DSP1PERFREQ_b;
  } ;

  union {
    __IOM uint32_t DSP1MEMPWREN;                /*!< This register enables the individual banks for the memories.
                                                     When set, power will be enabled to the banks. This register
                                                     works in conjunction with the DSP1MEMRETCFG register when
                                                     DSP1 is OFF.                                                              */

    struct {
      __IOM uint32_t PWRENDSP1RAM : 1;          /*!< Power up DSP1 IRAM and DRAM                                               */
      __IOM uint32_t PWRENDSP1ICACHE : 1;       /*!< Power up DSP1 ICACHE banks                                                */
            uint32_t            : 30;
    } DSP1MEMPWREN_b;
  } ;

  union {
    __IOM uint32_t DSP1MEMPWRST;                /*!< It provides the power status for all the memories of DSP1 subsystem       */

    struct {
      __IOM uint32_t PWRSTDSP1RAM : 1;          /*!< Status- 1:ON, 0:OFF                                                       */
      __IOM uint32_t PWRSTDSP1ICACHE : 1;       /*!< Power Status- 1:ON, 0:OFF                                                 */
            uint32_t            : 30;
    } DSP1MEMPWRST_b;
  } ;

  union {
    __IOM uint32_t DSP1MEMRETCFG;               /*!< This controls the power down of the DRAM/IRAM/CACHE banks when
                                                     DSP1 is powered off. If this is set, then the power for
                                                     that corresponding SRAM bank will be gated when the DSP1
                                                     is powered off and data is erased. If this is not set,
                                                     retention voltage will be applied when DSP1 is powered
                                                     off. Do not set this if the SRAM bank is used as the target
                                                     for DMA transfer while DSP1 is powered off.                               */

