AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4l_generic.h
    struct {
      __IOM uint32_t RAMPWDDSP1OFF : 1;         /*!< IRAM/DRAM banks are powered down when DSP1 is switched off,
                                                     causing the contents of the bank to be lost.                              */
      __IOM uint32_t DSP1RAMACTMCU : 1;         /*!< Keep the memory domain active based on MCU state.                         */
      __IOM uint32_t ICACHEPWDDSP1OFF : 1;      /*!< ICACHE is powered down when DSP1 is switched off, causing the
                                                     contents of the bank to be lost.                                          */
      __IOM uint32_t DSP1RAMACTDISP : 1;        /*!< Keep the memory domain active based on DISP state.                        */
      __IOM uint32_t DSP1RAMACTGFX : 1;         /*!< Keep the memory domain active based on GFX state.                         */
            uint32_t            : 27;
    } DSP1MEMRETCFG_b;
  } ;

  union {
    __IOM uint32_t PWRACKOVR;                   /*!< This register contains override bit fields for various power
                                                     domain power switch acknowledge notification. As a part
                                                     of power up sequnce, Power controller will look for power
                                                     switch ack to advance power up sequence. It is possible
                                                     for power controller to be a forever wait state in case
                                                     of a unforeseen HW bug. This register defines a bit fileds
                                                     to work around if needed in such a situation. The default
                                                     behavior is to use HW power switch ack. Software can set
                                                     it to override this feature for each power switch.                        */

    struct {
      __IOM uint32_t PWRACKOVERRIDEADC : 1;     /*!< Power switch acknowledgement override from Power switch to power
                                                     control ST MC                                                             */
      __IOM uint32_t PWRACKOVERRIDEAUD : 1;     /*!< Power switch acknowledgement override from Power switch to power
                                                     control ST MC                                                             */
      __IOM uint32_t PWRACKOVERRIDEAUDADC : 1;  /*!< Power switch acknowledgement override from Power switch to power
                                                     control ST MC                                                             */
      __IOM uint32_t PWRACKOVERRIDECRYPTO : 1;  /*!< Power switch acknowledgement override from Power switch to power
                                                     control ST MC                                                             */
      __IOM uint32_t PWRACKOVERRIDEDBG : 1;     /*!< Power switch acknowledgement override from Power switch to power
                                                     control ST MC                                                             */
      __IOM uint32_t PWRACKOVERRIDEDISP : 1;    /*!< Power switch acknowledgement override from Power switch to power
                                                     control ST MC                                                             */
      __IOM uint32_t PWRACKOVERRIDEDISPPHY : 1; /*!< Power switch acknowledgement override from Power switch to power
                                                     control ST MC                                                             */
      __IOM uint32_t PWRACKOVERRIDEGFX : 1;     /*!< Power switch acknowledgement override from Power switch to power
                                                     control ST MC                                                             */
      __IOM uint32_t PWRACKOVERRIDEHCPA : 1;    /*!< Power switch acknowledgement override from Power switch to power
                                                     control ST MC                                                             */
      __IOM uint32_t PWRACKOVERRIDEHCPB : 1;    /*!< Power switch acknowledgement override from Power switch to power
                                                     control ST MC                                                             */
      __IOM uint32_t PWRACKOVERRIDEHCPC : 1;    /*!< Power switch acknowledgement override from Power switch to power
                                                     control ST MC                                                             */
      __IOM uint32_t PWRACKOVERRIDEIOS : 1;     /*!< Power switch acknowledgement override from Power switch to power
                                                     control ST MC                                                             */
      __IOM uint32_t PWRACKOVERRIDEMCUL : 1;    /*!< Power switch acknowledgement override from Power switch to power
                                                     control ST MC                                                             */
      __IOM uint32_t PWRACKOVERRIDEMSPI : 1;    /*!< Power switch acknowledgement override from Power switch to power
                                                     control ST MC                                                             */
      __IOM uint32_t PWRACKOVERRIDESDIO : 1;    /*!< Power switch acknowledgement override from Power switch to power
                                                     control ST MC                                                             */
      __IOM uint32_t PWRACKOVERRIDEUSB : 1;     /*!< Power switch acknowledgement override from Power switch to power
                                                     control ST MC                                                             */
      __IOM uint32_t PWRACKOVERRIDEUSBPHY : 1;  /*!< Power switch acknowledgement override from Power switch to power
                                                     control ST MC                                                             */
      __IOM uint32_t PWRACKOVERRIDEDSPA : 1;    /*!< Power switch acknowledgement override from Power switch to power
                                                     control ST MC                                                             */
            uint32_t            : 14;
    } PWRACKOVR_b;
  } ;

  union {
    __IOM uint32_t PWRCNTDEFVAL;                /*!< This register contains programmble delay values for various
                                                     state michines. Fields contain dev st machine default value,
                                                     SIMOBUCK state machine wait delay counter etc.                            */

