AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4l_generic.h
    struct {
      __IOM uint32_t PWRDEFVALDEVSTMC : 6;      /*!< Default count max value for dev ST MC                                     */
      __IOM uint32_t PWRACKWAITDELSIMOSTMC : 10;/*!< Default counter max for buck ST MC                                        */
            uint32_t            : 16;
    } PWRCNTDEFVAL_b;
  } ;
  __IM  uint32_t  RESERVED3[29];

  union {
    __IOM uint32_t VRCTRL;                      /*!< This register includes additional debug control bits. This is
                                                     an internal Ambiq-only register. Customers should not attempt
                                                     to change this or else functionality cannot be guaranteed.                */

    struct {
      __IOM uint32_t SIMOBUCKEN : 1;            /*!< Enables and Selects the SIMO Buck as the supply for the low-voltage
                                                     power domains. It takes the initial value from the bit
                                                     set in Customer INFO space.                                               */
            uint32_t            : 31;
    } VRCTRL_b;
  } ;

  union {
    __IOM uint32_t LEGACYVRLPOVR;               /*!< When an override is set for a power domain, VR logic will ignore
                                                     that power domain state in making a decision to go into
                                                     lp state.                                                                 */

    struct {
      __IOM uint32_t IGNOREIOS  : 1;            /*!< Ignore IOS                                                                */
      __IOM uint32_t IGNOREHCPA : 1;            /*!< Ignore HCPA                                                               */
      __IOM uint32_t IGNOREHCPB : 1;            /*!< Ignore HCPB                                                               */
      __IOM uint32_t IGNOREHCPC : 1;            /*!< Ignore HCPC                                                               */
      __IOM uint32_t IGNOREHCPD : 1;            /*!< Ignore HCPD                                                               */
      __IOM uint32_t IGNOREHCPE : 1;            /*!< Ignore HCPE                                                               */
      __IOM uint32_t IGNOREMSPI : 1;            /*!< Ignore MSPI                                                               */
      __IOM uint32_t IGNOREGFX  : 1;            /*!< Ignore GFX                                                                */
            uint32_t            : 2;
      __IOM uint32_t IGNORECRYPTO : 1;          /*!< Ignore CRYPTO                                                             */
      __IOM uint32_t IGNORESDIO : 1;            /*!< Ignore SDIO                                                               */
            uint32_t            : 2;
      __IOM uint32_t IGNOREAUD  : 1;            /*!< Ignore AUD                                                                */
            uint32_t            : 3;
      __IOM uint32_t IGNOREDBG  : 1;            /*!< Ignore DBG                                                                */
            uint32_t            : 13;
    } LEGACYVRLPOVR_b;
  } ;

  union {
    __IOM uint32_t VRSTATUS;                    /*!< Provides BUCK and LDOs status.                                            */

    struct {
      __IOM uint32_t CORELDOST  : 2;            /*!< Indicates CORELDO status. bit[1] indicates ON/OFF and bit[0]
                                                     indicates ACT/LP.                                                         */
      __IOM uint32_t MEMLDOST   : 2;            /*!< Indicates MEMLDO status. bit[1] indicates ON/OFF and bit[0]
                                                     indicates ACT/LP.                                                         */
      __IOM uint32_t SIMOBUCKST : 2;            /*!< Indicates SIMO BUCK status. bit[1] indicates ON/OFF and bit[0]
                                                     indicates ACT/LP                                                          */
            uint32_t            : 26;
    } VRSTATUS_b;
  } ;
  __IM  uint32_t  RESERVED4[33];

  union {
    __IOM uint32_t SRAMCTRL;                    /*!< This register provides additional fine-tune power management
                                                     controls for the SRAMs and the SRAM controller. This includes
                                                     enabling light sleep for the SRAM and TCM banks, and clock
                                                     gating for reduced dynamic power.                                         */

    struct {
            uint32_t            : 1;
      __IOM uint32_t SRAMCLKGATE : 1;           /*!< This bit is 1 if clock gating is allowed for individual system
                                                     SRAMs                                                                     */
      __IOM uint32_t SRAMMASTERCLKGATE : 1;     /*!< This bit is 1 when the master clock gate is enabled (top-level
                                                     clock gate for entire SRAM block)                                         */
            uint32_t            : 5;
      __IOM uint32_t SRAMLIGHTSLEEP : 12;       /*!< Light Sleep enable for each TCM/SRAM bank. When 1, corresponding
                                                     bank will be put into light sleep. For optimal power, banks
                                                     should be put into light sleep while the system is active
                                                     but the bank has minimal or no accesses.                                  */
            uint32_t            : 12;
    } SRAMCTRL_b;
  } ;

  union {
    __IOM uint32_t ADCSTATUS;                   /*!< This provides the power status for various blocks within the
                                                     ADC. These status comes directly from the ADC module and
                                                     is captured through this interface.                                       */

