AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4l_generic.h
    struct {
      __IOM uint32_t ADCPWD     : 1;            /*!< This bit indicates that the ADC is powered down                           */
      __IOM uint32_t BGTPWD     : 1;            /*!< This bit indicates that the ADC Band Gap is powered down                  */
      __IOM uint32_t VPTATPWD   : 1;            /*!< This bit indicates that the ADC temperature sensor input buffer
                                                     is powered down                                                           */
      __IOM uint32_t VBATPWD    : 1;            /*!< This bit indicates that the ADC VBAT resistor divider is powered
                                                     down                                                                      */
      __IOM uint32_t REFKEEPPWD : 1;            /*!< This bit indicates that the ADC REFKEEP is powered down                   */
      __IOM uint32_t REFBUFPWD  : 1;            /*!< This bit indicates that the ADC REFBUF is powered down                    */
            uint32_t            : 26;
    } ADCSTATUS_b;
  } ;

  union {
    __IOM uint32_t AUDADCSTATUS;                /*!< This provides the power status for various blocks within the
                                                     audio ADC. These status comes directly from the audio ADC
                                                     module and is captured through this interface.                            */

    struct {
      __IOM uint32_t AUDADCPWD  : 1;            /*!< This bit indicates that the ADC is powered down                           */
      __IOM uint32_t AUDBGTPWD  : 1;            /*!< This bit indicates that the ADC Band Gap is powered down                  */
      __IOM uint32_t AUDVPTATPWD : 1;           /*!< This bit indicates that the ADC temperature sensor input buffer
                                                     is powered down                                                           */
      __IOM uint32_t AUDVBATPWD : 1;            /*!< This bit indicates that the ADC VBAT resistor divider is powered
                                                     down                                                                      */
      __IOM uint32_t AUDREFKEEPPWD : 1;         /*!< This bit indicates that the ADC REFKEEP is powered down                   */
      __IOM uint32_t AUDREFBUFPWD : 1;          /*!< This bit indicates that the ADC REFBUF is powered down                    */
            uint32_t            : 26;
    } AUDADCSTATUS_b;
  } ;
  __IM  uint32_t  RESERVED5[25];

  union {
    __IOM uint32_t EMONCTRL;                    /*!< Controls each of the energy monitor conuters                              */

    struct {
      __IOM uint32_t FREEZE     : 8;            /*!< Freeze the counter. Each bit corresponds to a counter. 0: Let
                                                     the counter run. 1: Stop the counter.                                     */
      __IOM uint32_t CLEAR      : 8;            /*!< Clear the counter. Each bit corresponds to a counter. 0: Let
                                                     the counter run run on its input clk. 1: Clear the counter                */
            uint32_t            : 16;
    } EMONCTRL_b;
  } ;

  union {
    __IOM uint32_t EMONCFG0;                    /*!< The counter increments when the counter is enabled and the mode
                                                     selected here matches the power mode.                                     */

    struct {
      __IOM uint32_t EMONSEL0   : 8;            /*!< Power modes for incrementing the counter                                  */
            uint32_t            : 24;
    } EMONCFG0_b;
  } ;

  union {
    __IOM uint32_t EMONCFG1;                    /*!< The counter increments when the counter is enabled and the mode
                                                     selected here matches the power mode.                                     */

    struct {
      __IOM uint32_t EMONSEL1   : 8;            /*!< Power modes for incrementing the counter                                  */
            uint32_t            : 24;
    } EMONCFG1_b;
  } ;

  union {
    __IOM uint32_t EMONCFG2;                    /*!< The counter increments when the counter is enabled and the mode
                                                     selected here matches the power mode.                                     */

    struct {
      __IOM uint32_t EMONSEL2   : 8;            /*!< Power modes for incrementing the counter                                  */
            uint32_t            : 24;
    } EMONCFG2_b;
  } ;

  union {
    __IOM uint32_t EMONCFG3;                    /*!< The counter increments when the counter is enabled and the mode
                                                     selected here matches the power mode.                                     */

    struct {
      __IOM uint32_t EMONSEL3   : 8;            /*!< Power modes for incrementing the counter                                  */
            uint32_t            : 24;
    } EMONCFG3_b;
  } ;

  union {
    __IOM uint32_t EMONCFG4;                    /*!< The counter increments when the counter is enabled and the mode
                                                     selected here matches the power mode.                                     */

    struct {
      __IOM uint32_t EMONSEL4   : 8;            /*!< Power modes for incrementing the counter                                  */
            uint32_t            : 24;
    } EMONCFG4_b;
  } ;

  union {
    __IOM uint32_t EMONCFG5;                    /*!< The counter increments when the counter is enabled and the mode
                                                     selected here matches the power mode.                                     */

    struct {
      __IOM uint32_t EMONSEL5   : 8;            /*!< Power modes for incrementing the counter                                  */
            uint32_t            : 24;
    } EMONCFG5_b;
  } ;

  union {
    __IOM uint32_t EMONCFG6;                    /*!< The counter increments when the counter is enabled and the mode
                                                     selected here matches the power mode.                                     */

