AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4l_generic.h
    struct {
      __IOM uint32_t STTMR      : 32;           /*!< Value of the 32-bit counter as it ticks over.                             */
    } STTMR_b;
  } ;
  __IM  uint32_t  RESERVED[2];

  union {
    __IOM uint32_t SCAPCTRL0;                   /*!< The STIMER Capture Control Register controls each of the 4 capture
                                                     registers. It selects their GPIO pin number for a trigger
                                                     source, enables a capture operation and sets the input
                                                     polarity for the capture. NOTE: 8-bit writes can control
                                                     individual capture registers atomically.                                  */

    struct {
      __IOM uint32_t STSEL0     : 7;            /*!< STIMER Capture 0 Select.                                                  */
            uint32_t            : 1;
      __IOM uint32_t STPOL0     : 1;            /*!< STIMER Capture 0 Polarity.                                                */
      __IOM uint32_t CAPTURE0   : 1;            /*!< Selects whether capture 0 is enabled for the specified capture
                                                     register.                                                                 */
            uint32_t            : 22;
    } SCAPCTRL0_b;
  } ;

  union {
    __IOM uint32_t SCAPCTRL1;                   /*!< The STIMER Capture Control Register controls each of the 4 capture
                                                     registers. It selects their GPIO pin number for a trigger
                                                     source, enables a capture operation and sets the input
                                                     polarity for the capture. NOTE: 8-bit writes can control
                                                     individual capture registers atomically.                                  */

    struct {
      __IOM uint32_t STSEL1     : 7;            /*!< STIMER Capture 1 Select.                                                  */
            uint32_t            : 1;
      __IOM uint32_t STPOL1     : 1;            /*!< STIMER Capture 1 Polarity.                                                */
      __IOM uint32_t CAPTURE1   : 1;            /*!< Selects whether capture 1 is enabled for the specified capture
                                                     register.                                                                 */
            uint32_t            : 22;
    } SCAPCTRL1_b;
  } ;

  union {
    __IOM uint32_t SCAPCTRL2;                   /*!< The STIMER Capture Control Register controls each of the 4 capture
                                                     registers. It selects their GPIO pin number for a trigger
                                                     source, enables a capture operation and sets the input
                                                     polarity for the capture. NOTE: 8-bit writes can control
                                                     individual capture registers atomically.                                  */

    struct {
      __IOM uint32_t STSEL2     : 7;            /*!< STIMER Capture 2 Select.                                                  */
            uint32_t            : 1;
      __IOM uint32_t STPOL2     : 1;            /*!< STIMER Capture 2 Polarity.                                                */
      __IOM uint32_t CAPTURE2   : 1;            /*!< Selects whether capture 2 is enabled for the specified capture
                                                     register.                                                                 */
            uint32_t            : 22;
    } SCAPCTRL2_b;
  } ;

  union {
    __IOM uint32_t SCAPCTRL3;                   /*!< The STIMER Capture Control Register controls each of the 4 capture
                                                     registers. It selects their GPIO pin number for a trigger
                                                     source, enables a capture operation and sets the input
                                                     polarity for the capture. NOTE: 8-bit writes can control
                                                     individual capture registers atomically.                                  */

    struct {
      __IOM uint32_t STSEL3     : 7;            /*!< STIMER Capture 3 Select.                                                  */
            uint32_t            : 1;
      __IOM uint32_t STPOL3     : 1;            /*!< STIMER Capture 3 Polarity.                                                */
      __IOM uint32_t CAPTURE3   : 1;            /*!< Selects whether capture 3 is enabled for the specified capture
                                                     register.                                                                 */
            uint32_t            : 22;
    } SCAPCTRL3_b;
  } ;

  union {
    __IOM uint32_t SCMPR0;                      /*!< The VALUE in this bit field is used to compare against the VALUE
                                                     in the COUNTER register. If the match criterion in the
                                                     configuration register is met then a corresponding interrupt
                                                     status bit is set. The match criterion is defined as COUNTER
                                                     equal to COMPARE. To establish a desired value in this
                                                     COMPARE register, write the number of ticks in the future
                                                     to this register to indicate when to interrupt. The hardware
                                                     does the addition to the COUNTER value in the STIMER clock
                                                     domain so that the math is precise. Reading this register
                                                     shows the COUNTER value at which this interrupt will occur.               */

