AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4l_generic.h
    struct {
      __IOM uint32_t SCMPR4     : 32;           /*!< Compare this value to the value in the COUNTER register according
                                                     to the match criterion, as selected in the COMPARE_A_EN
                                                     bit in the REG_CTIMER_STCFG register.                                     */
    } SCMPR4_b;
  } ;

  union {
    __IOM uint32_t SCMPR5;                      /*!< The VALUE in this bit field is used to compare against the VALUE
                                                     in the COUNTER register. If the match criterion in the
                                                     configuration register is met then a corresponding interrupt
                                                     status bit is set. The match criterion is defined as COUNTER
                                                     equal to COMPARE. To establish a desired value in this
                                                     COMPARE register, write the number of ticks in the future
                                                     to this register to indicate when to interrupt. The hardware
                                                     does the addition to the COUNTER value in the STIMER clock
                                                     domain so that the math is precise. Reading this register
                                                     shows the COUNTER value at which this interrupt will occur.               */

    struct {
      __IOM uint32_t SCMPR5     : 32;           /*!< Compare this value to the value in the COUNTER register according
                                                     to the match criterion, as selected in the COMPARE_A_EN
                                                     bit in the REG_CTIMER_STCFG register.                                     */
    } SCMPR5_b;
  } ;

  union {
    __IOM uint32_t SCMPR6;                      /*!< The VALUE in this bit field is used to compare against the VALUE
                                                     in the COUNTER register. If the match criterion in the
                                                     configuration register is met then a corresponding interrupt
                                                     status bit is set. The match criterion is defined as COUNTER
                                                     equal to COMPARE. To establish a desired value in this
                                                     COMPARE register, write the number of ticks in the future
                                                     to this register to indicate when to interrupt. The hardware
                                                     does the addition to the COUNTER value in the STIMER clock
                                                     domain so that the math is precise. Reading this register
                                                     shows the COUNTER value at which this interrupt will occur.               */

    struct {
      __IOM uint32_t SCMPR6     : 32;           /*!< Compare this value to the value in the COUNTER register according
                                                     to the match criterion, as selected in the COMPARE_A_EN
                                                     bit in the REG_CTIMER_STCFG register.                                     */
    } SCMPR6_b;
  } ;

  union {
    __IOM uint32_t SCMPR7;                      /*!< The VALUE in this bit field is used to compare against the VALUE
                                                     in the COUNTER register. If the match criterion in the
                                                     configuration register is met then a corresponding interrupt
                                                     status bit is set. The match criterion is defined as COUNTER
                                                     equal to COMPARE. To establish a desired value in this
                                                     COMPARE register, write the number of ticks in the future
                                                     to this register to indicate when to interrupt. The hardware
                                                     does the addition to the COUNTER value in the STIMER clock
                                                     domain so that the math is precise. Reading this register
                                                     shows the COUNTER value at which this interrupt will occur.               */

    struct {
      __IOM uint32_t SCMPR7     : 32;           /*!< Compare this value to the value in the COUNTER register according
                                                     to the match criterion, as selected in the COMPARE_A_EN
                                                     bit in the REG_CTIMER_STCFG register.                                     */
    } SCMPR7_b;
  } ;

  union {
    __IOM uint32_t SCAPT0;                      /*!< The STIMER capture Register 0 captures the VALUE in the COUNTER
                                                     register whenever capture condition (event) occurs. This
                                                     register holds a time stamp for the event.                                */

    struct {
      __IOM uint32_t SCAPT0     : 32;           /*!< Whenever the event is detected, the value in the COUNTER is
                                                     copied into this register and the corresponding interrupt
                                                     status bit is set.                                                        */
    } SCAPT0_b;
  } ;

  union {
    __IOM uint32_t SCAPT1;                      /*!< The STIMER capture Register 1 captures the VALUE in the COUNTER
                                                     register whenever capture condition (event) occurs. This
                                                     register holds a time stamp for the event.                                */

