AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4l_generic.h
    struct {
            uint32_t            : 8;
      __IOM uint32_t TMR10TRIGSEL : 8;          /*!< Counter/Timer 10 Trigger Source Selection                                 */
            uint32_t            : 16;
    } MODE10_b;
  } ;

  union {
    __IOM uint32_t TMR10LMTVAL;                 /*!< This is an internal counter in the hardware that counts down
                                                     from TMR_LMT to 1                                                         */

    struct {
      __IOM uint32_t TMR10LMTVAL : 8;           /*!< Counter/Timer 10 Limit Readback                                           */
            uint32_t            : 24;
    } TMR10LMTVAL_b;
  } ;
  __IM  uint32_t  RESERVED14[2];

  union {
    __IOM uint32_t CTRL11;                      /*!< This includes the Control bit fields for timer 11.                        */

    struct {
      __IOM uint32_t TMR11EN    : 1;            /*!< Counter/Timer 11 Enable bit.                                              */
      __IOM uint32_t TMR11CLR   : 1;            /*!< Counter/Timer Clear bit.                                                  */
      __IOM uint32_t TMR11POL0  : 1;            /*!< Counter/Timer 11 output 0 polarity.                                       */
      __IOM uint32_t TMR11POL1  : 1;            /*!< Counter/Timer 11 output 1 polarity.                                       */
      __IOM uint32_t TMR11FN    : 4;            /*!< Counter/Timer 11 Function Select. For all Functions, CMP0 marks
                                                     the end of timer cycle, and thus restarts the timer.                      */
      __IOM uint32_t TMR11CLK   : 8;            /*!< Counter/Timer 11 Clock Select.                                            */
      __IOM uint32_t TMR11TMODE : 2;            /*!< Counter/Timer 11 Trigger Mode                                             */
            uint32_t            : 6;
      __IOM uint32_t TMR11LMT   : 8;            /*!< This field decides the number of iterations of Counter/Timer
                                                     11. For Single/Repeat Patterns, it indicates number of
                                                     bits to be shifted out and so, max value is 63.                           */
    } CTRL11_b;
  } ;

  union {
    __IOM uint32_t TIMER11;                     /*!< This register holds the running time or event count for timer
                                                     11.                                                                       */

    struct {
      __IOM uint32_t TIMER11    : 32;           /*!< Counter/Timer 11                                                          */
    } TIMER11_b;
  } ;

  union {
    __IOM uint32_t TMR11CMP0;                   /*!< This contains the Compare limits for timer 11. This is the primary
                                                     comparator that can be used to mark the END of a timer
                                                     cycle (and thus restart the timer for repeat modes)                       */

    struct {
      __IOM uint32_t TMR11CMP0  : 32;           /*!< Counter/Timer 11 End Compare Register. For MEASURE mode indicates
                                                     the high phase sample count.                                              */
    } TMR11CMP0_b;
  } ;

  union {
    __IOM uint32_t TMR11CMP1;                   /*!< This comparator is used as a secondary compare count for modes
                                                     that generate pulses. For MEASURE mode indicates the low
                                                     phase sample count.                                                       */

    struct {
      __IOM uint32_t TMR11CMP1  : 32;           /*!< Holds the secondary comparator that can be used to generate
                                                     a PWM or generate secondary pulses. CMP0 should ALWAYS
                                                     be used first.                                                            */
    } TMR11CMP1_b;
  } ;

  union {
    __IOM uint32_t MODE11;                      /*!< The mode register contains optional mode controls for the timer           */

    struct {
            uint32_t            : 8;
      __IOM uint32_t TMR11TRIGSEL : 8;          /*!< Counter/Timer 11 Trigger Source Selection                                 */
            uint32_t            : 16;
    } MODE11_b;
  } ;

  union {
    __IOM uint32_t TMR11LMTVAL;                 /*!< This is an internal counter in the hardware that counts down
                                                     from TMR_LMT to 1                                                         */

    struct {
      __IOM uint32_t TMR11LMTVAL : 8;           /*!< Counter/Timer 11 Limit Readback                                           */
            uint32_t            : 24;
    } TMR11LMTVAL_b;
  } ;
  __IM  uint32_t  RESERVED15[2];

  union {
    __IOM uint32_t CTRL12;                      /*!< This includes the Control bit fields for timer 12.                        */

    struct {
      __IOM uint32_t TMR12EN    : 1;            /*!< Counter/Timer 12 Enable bit.                                              */
      __IOM uint32_t TMR12CLR   : 1;            /*!< Counter/Timer Clear bit.                                                  */
      __IOM uint32_t TMR12POL0  : 1;            /*!< Counter/Timer 12 output 0 polarity.                                       */
      __IOM uint32_t TMR12POL1  : 1;            /*!< Counter/Timer 12 output 1 polarity.                                       */
      __IOM uint32_t TMR12FN    : 4;            /*!< Counter/Timer 12 Function Select. For all Functions, CMP0 marks
                                                     the end of timer cycle, and thus restarts the timer.                      */
      __IOM uint32_t TMR12CLK   : 8;            /*!< Counter/Timer 12 Clock Select.                                            */
      __IOM uint32_t TMR12TMODE : 2;            /*!< Counter/Timer 12 Trigger Mode                                             */
            uint32_t            : 6;
      __IOM uint32_t TMR12LMT   : 8;            /*!< This field decides the number of iterations of Counter/Timer
                                                     12. For Single/Repeat Patterns, it indicates number of
                                                     bits to be shifted out and so, max value is 63.                           */
    } CTRL12_b;
  } ;

  union {
    __IOM uint32_t TIMER12;                     /*!< This register holds the running time or event count for timer
                                                     12.                                                                       */

