AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4l_generic.h
    struct {
            uint32_t            : 8;
      __IOM uint32_t TMR13TRIGSEL : 8;          /*!< Counter/Timer 13 Trigger Source Selection                                 */
            uint32_t            : 16;
    } MODE13_b;
  } ;

  union {
    __IOM uint32_t TMR13LMTVAL;                 /*!< This is an internal counter in the hardware that counts down
                                                     from TMR_LMT to 1                                                         */

    struct {
      __IOM uint32_t TMR13LMTVAL : 8;           /*!< Counter/Timer 13 Limit Readback                                           */
            uint32_t            : 24;
    } TMR13LMTVAL_b;
  } ;
  __IM  uint32_t  RESERVED17[2];

  union {
    __IOM uint32_t CTRL14;                      /*!< This includes the Control bit fields for timer 14.                        */

    struct {
      __IOM uint32_t TMR14EN    : 1;            /*!< Counter/Timer 14 Enable bit.                                              */
      __IOM uint32_t TMR14CLR   : 1;            /*!< Counter/Timer Clear bit.                                                  */
      __IOM uint32_t TMR14POL0  : 1;            /*!< Counter/Timer 14 output 0 polarity.                                       */
      __IOM uint32_t TMR14POL1  : 1;            /*!< Counter/Timer 14 output 1 polarity.                                       */
      __IOM uint32_t TMR14FN    : 4;            /*!< Counter/Timer 14 Function Select. For all Functions, CMP0 marks
                                                     the end of timer cycle, and thus restarts the timer.                      */
      __IOM uint32_t TMR14CLK   : 8;            /*!< Counter/Timer 14 Clock Select.                                            */
      __IOM uint32_t TMR14TMODE : 2;            /*!< Counter/Timer 14 Trigger Mode                                             */
            uint32_t            : 6;
      __IOM uint32_t TMR14LMT   : 8;            /*!< This field decides the number of iterations of Counter/Timer
                                                     14. For Single/Repeat Patterns, it indicates number of
                                                     bits to be shifted out and so, max value is 63.                           */
    } CTRL14_b;
  } ;

  union {
    __IOM uint32_t TIMER14;                     /*!< This register holds the running time or event count for timer
                                                     14.                                                                       */

    struct {
      __IOM uint32_t TIMER14    : 32;           /*!< Counter/Timer 14                                                          */
    } TIMER14_b;
  } ;

  union {
    __IOM uint32_t TMR14CMP0;                   /*!< This contains the Compare limits for timer 14. This is the primary
                                                     comparator that can be used to mark the END of a timer
                                                     cycle (and thus restart the timer for repeat modes)                       */

    struct {
      __IOM uint32_t TMR14CMP0  : 32;           /*!< Counter/Timer 14 End Compare Register. For MEASURE mode indicates
                                                     the high phase sample count.                                              */
    } TMR14CMP0_b;
  } ;

  union {
    __IOM uint32_t TMR14CMP1;                   /*!< This comparator is used as a secondary compare count for modes
                                                     that generate pulses. For MEASURE mode indicates the low
                                                     phase sample count.                                                       */

    struct {
      __IOM uint32_t TMR14CMP1  : 32;           /*!< Holds the secondary comparator that can be used to generate
                                                     a PWM or generate secondary pulses. CMP0 should ALWAYS
                                                     be used first.                                                            */
    } TMR14CMP1_b;
  } ;

  union {
    __IOM uint32_t MODE14;                      /*!< The mode register contains optional mode controls for the timer           */

    struct {
            uint32_t            : 8;
      __IOM uint32_t TMR14TRIGSEL : 8;          /*!< Counter/Timer 14 Trigger Source Selection                                 */
            uint32_t            : 16;
    } MODE14_b;
  } ;

  union {
    __IOM uint32_t TMR14LMTVAL;                 /*!< This is an internal counter in the hardware that counts down
                                                     from TMR_LMT to 1                                                         */

    struct {
      __IOM uint32_t TMR14LMTVAL : 8;           /*!< Counter/Timer 14 Limit Readback                                           */
            uint32_t            : 24;
    } TMR14LMTVAL_b;
  } ;
  __IM  uint32_t  RESERVED18[2];

  union {
    __IOM uint32_t CTRL15;                      /*!< This includes the Control bit fields for timer 15.                        */

    struct {
      __IOM uint32_t TMR15EN    : 1;            /*!< Counter/Timer 15 Enable bit.                                              */
      __IOM uint32_t TMR15CLR   : 1;            /*!< Counter/Timer Clear bit.                                                  */
      __IOM uint32_t TMR15POL0  : 1;            /*!< Counter/Timer 15 output 0 polarity.                                       */
      __IOM uint32_t TMR15POL1  : 1;            /*!< Counter/Timer 15 output 1 polarity.                                       */
      __IOM uint32_t TMR15FN    : 4;            /*!< Counter/Timer 15 Function Select. For all Functions, CMP0 marks
                                                     the end of timer cycle, and thus restarts the timer.                      */
      __IOM uint32_t TMR15CLK   : 8;            /*!< Counter/Timer 15 Clock Select.                                            */
      __IOM uint32_t TMR15TMODE : 2;            /*!< Counter/Timer 15 Trigger Mode                                             */
            uint32_t            : 6;
      __IOM uint32_t TMR15LMT   : 8;            /*!< This field decides the number of iterations of Counter/Timer
                                                     15. For Single/Repeat Patterns, it indicates number of
                                                     bits to be shifted out and so, max value is 63.                           */
    } CTRL15_b;
  } ;

  union {
    __IOM uint32_t TIMER15;                     /*!< This register holds the running time or event count for timer
                                                     15.                                                                       */

