AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4l_generic.h
    struct {
      __IOM uint32_t TXCMPMIC   : 1;            /*!< This bit holds the modem TXCMP interrupt clear.                           */
      __IOM uint32_t CTSMIC     : 1;            /*!< This bit holds the nUARTCTS modem interrupt clear. Clears the
                                                     UARTCTSINTR interrupt.                                                    */
      __IOM uint32_t DCDMIC     : 1;            /*!< This bit holds the nUARTDCD modem interrupt clear. Clears the
                                                     UARTDCDINTR interrupt.                                                    */
      __IOM uint32_t DSRMIC     : 1;            /*!< This bit holds the nUARTDSR modem interrupt clear. Clears the
                                                     UARTDSRINTR interrupt.                                                    */
      __IOM uint32_t RXIC       : 1;            /*!< This bit holds the receive interrupt clear. Clears the UARTRXINTR
                                                     interrupt.                                                                */
      __IOM uint32_t TXIC       : 1;            /*!< This bit holds the transmit interrupt clear. Clears the UARTTXINTR
                                                     interrupt.                                                                */
      __IOM uint32_t RTIC       : 1;            /*!< This bit holds the receive timeout interrupt clear. Clears the
                                                     UARTRTINTR interrupt.                                                     */
      __IOM uint32_t FEIC       : 1;            /*!< This bit holds the framing error interrupt clear. Clears the
                                                     UARTFEINTR interrupt.                                                     */
      __IOM uint32_t PEIC       : 1;            /*!< This bit holds the parity error interrupt clear. Clears the
                                                     UARTPEINTR interrupt.                                                     */
      __IOM uint32_t BEIC       : 1;            /*!< This bit holds the break error interrupt clear. Clears the UARTBEINTR
                                                     interrupt.                                                                */
      __IOM uint32_t OEIC       : 1;            /*!< This bit holds the overrun interrupt clear. Clears the UARTOEINTR
                                                     interrupt.                                                                */
            uint32_t            : 21;
    } IEC_b;
  } ;
} UART0_Type;                                   /*!< Size = 72 (0x48)                                                          */



/* =========================================================================================================================== */
/* ================                                           VCOMP                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Voltage Comparator (VCOMP)
  */

typedef struct {                                /*!< VCOMP Structure                                                           */

  union {
    __IOM uint32_t CFG;                         /*!< The Voltage Comparator Configuration Register contains the software
                                                     control for selecting beween the 4 options for the positive
                                                     input as well as the multiple options for the reference
                                                     input.                                                                    */

    struct {
      __IOM uint32_t PSEL       : 2;            /*!< This bitfield selects the positive input to the comparator.               */
            uint32_t            : 6;
      __IOM uint32_t NSEL       : 2;            /*!< This bitfield selects the negative input to the comparator.               */
            uint32_t            : 6;
      __IOM uint32_t LVLSEL     : 4;            /*!< When the reference input NSEL is set to NSEL_DAC, this bitfield
                                                     selects the voltage level for the negative input to the
                                                     comparator.                                                               */
            uint32_t            : 12;
    } CFG_b;
  } ;

  union {
    __IOM uint32_t STAT;                        /*!< Status                                                                    */

    struct {
      __IOM uint32_t CMPOUT     : 1;            /*!< This bit is 1 if the positive input of the comparator is greater
                                                     than the negative input.                                                  */
      __IOM uint32_t PWDSTAT    : 1;            /*!< This bit indicates the power down state of the voltage comparator.        */
            uint32_t            : 30;
    } STAT_b;
  } ;

  union {
    __IOM uint32_t PWDKEY;                      /*!< Write a value of 0x37 to unlock, write any other value to lock.
                                                     This register also indicates lock status when read. When
                                                     in the unlccked state (i.e. 0x37 has been written), it
                                                     reads as 1. When in the locked state, it reads as 0.                      */

    struct {
      __IOM uint32_t PWDKEY     : 32;           /*!< Key register value.                                                       */
    } PWDKEY_b;
  } ;
  __IM  uint32_t  RESERVED[125];

  union {
    __IOM uint32_t INTEN;                       /*!< Set bits in this register to allow this module to generate the
                                                     corresponding interrupt.                                                  */

