AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4l_generic.h
    struct {
      __IOM uint32_t OUTLOW     : 1;            /*!< This bit is the vcompout low interrupt.                                   */
      __IOM uint32_t OUTHI      : 1;            /*!< This bit is the vcompout high interrupt.                                  */
            uint32_t            : 30;
    } INTEN_b;
  } ;

  union {
    __IOM uint32_t INTSTAT;                     /*!< Read bits from this register to discover the cause of a recent
                                                     interrupt.                                                                */

    struct {
      __IOM uint32_t OUTLOW     : 1;            /*!< This bit is the vcompout low interrupt.                                   */
      __IOM uint32_t OUTHI      : 1;            /*!< This bit is the vcompout high interrupt.                                  */
            uint32_t            : 30;
    } INTSTAT_b;
  } ;

  union {
    __IOM uint32_t INTCLR;                      /*!< Write a 1 to a bit in this register to clear the interrupt status
                                                     associated with that bit.                                                 */

    struct {
      __IOM uint32_t OUTLOW     : 1;            /*!< This bit is the vcompout low interrupt.                                   */
      __IOM uint32_t OUTHI      : 1;            /*!< This bit is the vcompout high interrupt.                                  */
            uint32_t            : 30;
    } INTCLR_b;
  } ;

  union {
    __IOM uint32_t INTSET;                      /*!< Write a 1 to a bit in this register to instantly generate an
                                                     interrupt from this module. (Generally used for testing
                                                     purposes).                                                                */

    struct {
      __IOM uint32_t OUTLOW     : 1;            /*!< This bit is the vcompout low interrupt.                                   */
      __IOM uint32_t OUTHI      : 1;            /*!< This bit is the vcompout high interrupt.                                  */
            uint32_t            : 30;
    } INTSET_b;
  } ;
} VCOMP_Type;                                   /*!< Size = 528 (0x210)                                                        */



/* =========================================================================================================================== */
/* ================                                            WDT                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Watchdog Timer (WDT)
  */

typedef struct {                                /*!< WDT Structure                                                             */

  union {
    __IOM uint32_t CFG;                         /*!< This is the configuration register for the watch dog timer.
                                                     It controls the enable, interrupt set, clocks for the timer,
                                                     the compare values for the counters to trigger a reset
                                                     or interrupt. This register can only be written to if the
                                                     watch dog timer is unlocked (WDTLOCK is not set).                         */

    struct {
      __IOM uint32_t WDTEN      : 1;            /*!< This bitfield enables the WDT.                                            */
      __IOM uint32_t INTEN      : 1;            /*!< This bitfield enables the WDT interrupt. Note : This bit must
                                                     be set before the interrupt status bit will reflect a watchdog
                                                     timer expiration. The IER interrupt register must also
                                                     be enabled for a WDT interrupt to be sent to the NVIC.                    */
      __IOM uint32_t RESEN      : 1;            /*!< This bitfield enables the WDT reset. This needs to be set together
                                                     with the WDREN bit in REG_RSTGEN_CFG register (in reset
                                                     gen) to trigger the reset.                                                */
            uint32_t            : 5;
      __IOM uint32_t RESVAL     : 8;            /*!< This bitfield is the compare value for counter bits 7:0 to generate
                                                     a watchdog reset. This will cause a software reset.                       */
      __IOM uint32_t INTVAL     : 8;            /*!< This bitfield is the compare value for counter bits 7:0 to generate
                                                     a watchdog interrupt.                                                     */
      __IOM uint32_t CLKSEL     : 3;            /*!< Select the frequency for the WDT. All values not enumerated
                                                     below are undefined.                                                      */
            uint32_t            : 5;
    } CFG_b;
  } ;

  union {
    __IOM uint32_t RSTRT;                       /*!< This register will Restart the watchdog timer. Writing a special
                                                     key value into this register will result in the watch dog
                                                     timer being reset, so that the count will start again.
                                                     It is expected that the software will periodically write
                                                     to this register to indicate that the system is functional.
                                                     The watch dog timer can continue running when the system
                                                     is in deep sleep, and the interrupt will trigger the wake.
                                                     After the wake, the core can reset the watch dog timer.                   */

