AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4l_generic.h
/* ======================================================  APBDMACTRL  ======================================================= */
#define MCUCTRL_APBDMACTRL_HYSTERESIS_Pos (8UL)                     /*!< HYSTERESIS (Bit 8)                                    */
#define MCUCTRL_APBDMACTRL_HYSTERESIS_Msk (0xff00UL)                /*!< HYSTERESIS (Bitfield-Mask: 0xff)                      */
#define MCUCTRL_APBDMACTRL_DECODEABORT_Pos (1UL)                    /*!< DECODEABORT (Bit 1)                                   */
#define MCUCTRL_APBDMACTRL_DECODEABORT_Msk (0x2UL)                  /*!< DECODEABORT (Bitfield-Mask: 0x01)                     */
#define MCUCTRL_APBDMACTRL_DMAENABLE_Pos  (0UL)                     /*!< DMAENABLE (Bit 0)                                     */
#define MCUCTRL_APBDMACTRL_DMAENABLE_Msk  (0x1UL)                   /*!< DMAENABLE (Bitfield-Mask: 0x01)                       */
/* ======================================================  KEXTCLKSEL  ======================================================= */
#define MCUCTRL_KEXTCLKSEL_KEXTCLKSEL_Pos (0UL)                     /*!< KEXTCLKSEL (Bit 0)                                    */
#define MCUCTRL_KEXTCLKSEL_KEXTCLKSEL_Msk (0xffffffffUL)            /*!< KEXTCLKSEL (Bitfield-Mask: 0xffffffff)                */
/* =======================================================  SIMOBUCK0  ======================================================= */
#define MCUCTRL_SIMOBUCK0_TONTOFFNODEGLITCH_Pos (4UL)               /*!< TONTOFFNODEGLITCH (Bit 4)                             */
#define MCUCTRL_SIMOBUCK0_TONTOFFNODEGLITCH_Msk (0x10UL)            /*!< TONTOFFNODEGLITCH (Bitfield-Mask: 0x01)               */
#define MCUCTRL_SIMOBUCK0_VDDCLVRXCOMPEN_Pos (3UL)                  /*!< VDDCLVRXCOMPEN (Bit 3)                                */
#define MCUCTRL_SIMOBUCK0_VDDCLVRXCOMPEN_Msk (0x8UL)                /*!< VDDCLVRXCOMPEN (Bitfield-Mask: 0x01)                  */
#define MCUCTRL_SIMOBUCK0_VDDSRXCOMPEN_Pos (2UL)                    /*!< VDDSRXCOMPEN (Bit 2)                                  */
#define MCUCTRL_SIMOBUCK0_VDDSRXCOMPEN_Msk (0x4UL)                  /*!< VDDSRXCOMPEN (Bitfield-Mask: 0x01)                    */
#define MCUCTRL_SIMOBUCK0_VDDFRXCOMPEN_Pos (1UL)                    /*!< VDDFRXCOMPEN (Bit 1)                                  */
#define MCUCTRL_SIMOBUCK0_VDDFRXCOMPEN_Msk (0x2UL)                  /*!< VDDFRXCOMPEN (Bitfield-Mask: 0x01)                    */
#define MCUCTRL_SIMOBUCK0_VDDCRXCOMPEN_Pos (0UL)                    /*!< VDDCRXCOMPEN (Bit 0)                                  */
#define MCUCTRL_SIMOBUCK0_VDDCRXCOMPEN_Msk (0x1UL)                  /*!< VDDCRXCOMPEN (Bitfield-Mask: 0x01)                    */
/* =======================================================  SIMOBUCK1  ======================================================= */
#define MCUCTRL_SIMOBUCK1_TONCLKTRIM_Pos  (22UL)                    /*!< TONCLKTRIM (Bit 22)                                   */
#define MCUCTRL_SIMOBUCK1_TONCLKTRIM_Msk  (0x3c00000UL)             /*!< TONCLKTRIM (Bitfield-Mask: 0x0f)                      */
#define MCUCTRL_SIMOBUCK1_RXCLKACTTRIM_Pos (6UL)                    /*!< RXCLKACTTRIM (Bit 6)                                  */
#define MCUCTRL_SIMOBUCK1_RXCLKACTTRIM_Msk (0x7c0UL)                /*!< RXCLKACTTRIM (Bitfield-Mask: 0x1f)                    */
/* =======================================================  SIMOBUCK2  ======================================================= */
#define MCUCTRL_SIMOBUCK2_VDDCACTLOWTONTRIM_Pos (24UL)              /*!< VDDCACTLOWTONTRIM (Bit 24)                            */
#define MCUCTRL_SIMOBUCK2_VDDCACTLOWTONTRIM_Msk (0x1f000000UL)      /*!< VDDCACTLOWTONTRIM (Bitfield-Mask: 0x1f)               */
#define MCUCTRL_SIMOBUCK2_VDDCACTHIGHTONTRIM_Pos (11UL)             /*!< VDDCACTHIGHTONTRIM (Bit 11)                           */
#define MCUCTRL_SIMOBUCK2_VDDCACTHIGHTONTRIM_Msk (0x7800UL)         /*!< VDDCACTHIGHTONTRIM (Bitfield-Mask: 0x0f)              */
/* =======================================================  SIMOBUCK3  ======================================================= */
#define MCUCTRL_SIMOBUCK3_VDDCLPLOWTONTRIM_Pos (26UL)               /*!< VDDCLPLOWTONTRIM (Bit 26)                             */
#define MCUCTRL_SIMOBUCK3_VDDCLPLOWTONTRIM_Msk (0x3c000000UL)       /*!< VDDCLPLOWTONTRIM (Bitfield-Mask: 0x0f)                */
#define MCUCTRL_SIMOBUCK3_VDDCLPHIGHTONTRIM_Pos (13UL)              /*!< VDDCLPHIGHTONTRIM (Bit 13)                            */
#define MCUCTRL_SIMOBUCK3_VDDCLPHIGHTONTRIM_Msk (0x1e000UL)         /*!< VDDCLPHIGHTONTRIM (Bitfield-Mask: 0x0f)               */
/* =======================================================  SIMOBUCK6  ======================================================= */
#define MCUCTRL_SIMOBUCK6_VDDFACTHIGHTONTRIM_Pos (17UL)             /*!< VDDFACTHIGHTONTRIM (Bit 17)                           */
#define MCUCTRL_SIMOBUCK6_VDDFACTHIGHTONTRIM_Msk (0x1e0000UL)       /*!< VDDFACTHIGHTONTRIM (Bitfield-Mask: 0x0f)              */
/* =======================================================  SIMOBUCK7  ======================================================= */
#define MCUCTRL_SIMOBUCK7_ZXCOMPZXTRIM_Pos (18UL)                   /*!< ZXCOMPZXTRIM (Bit 18)                                 */
#define MCUCTRL_SIMOBUCK7_ZXCOMPZXTRIM_Msk (0x7c0000UL)             /*!< ZXCOMPZXTRIM (Bitfield-Mask: 0x1f)                    */
#define MCUCTRL_SIMOBUCK7_VDDFACTLOWTONTRIM_Pos (8UL)               /*!< VDDFACTLOWTONTRIM (Bit 8)                             */
#define MCUCTRL_SIMOBUCK7_VDDFACTLOWTONTRIM_Msk (0x1f00UL)          /*!< VDDFACTLOWTONTRIM (Bitfield-Mask: 0x1f)               */
/* =======================================================  SIMOBUCK8  ======================================================= */
#define MCUCTRL_SIMOBUCK8_VDDFLPLOWTONTRIM_Pos (22UL)               /*!< VDDFLPLOWTONTRIM (Bit 22)                             */
#define MCUCTRL_SIMOBUCK8_VDDFLPLOWTONTRIM_Msk (0x3c00000UL)        /*!< VDDFLPLOWTONTRIM (Bitfield-Mask: 0x0f)                */
#define MCUCTRL_SIMOBUCK8_VDDFLPHIGHTONTRIM_Pos (9UL)               /*!< VDDFLPHIGHTONTRIM (Bit 9)                             */
#define MCUCTRL_SIMOBUCK8_VDDFLPHIGHTONTRIM_Msk (0x1e00UL)          /*!< VDDFLPHIGHTONTRIM (Bitfield-Mask: 0x0f)               */
/* =======================================================  SIMOBUCK9  ======================================================= */
#define MCUCTRL_SIMOBUCK9_VDDSACTLOWTONTRIM_Pos (22UL)              /*!< VDDSACTLOWTONTRIM (Bit 22)                            */
#define MCUCTRL_SIMOBUCK9_VDDSACTLOWTONTRIM_Msk (0x7c00000UL)       /*!< VDDSACTLOWTONTRIM (Bitfield-Mask: 0x1f)               */
#define MCUCTRL_SIMOBUCK9_VDDSACTHIGHTONTRIM_Pos (17UL)             /*!< VDDSACTHIGHTONTRIM (Bit 17)                           */
#define MCUCTRL_SIMOBUCK9_VDDSACTHIGHTONTRIM_Msk (0x1e0000UL)       /*!< VDDSACTHIGHTONTRIM (Bitfield-Mask: 0x0f)              */
/* ======================================================  SIMOBUCK12  ======================================================= */
#define MCUCTRL_SIMOBUCK12_LPTRIMVDDF_Pos (26UL)                    /*!< LPTRIMVDDF (Bit 26)                                   */
#define MCUCTRL_SIMOBUCK12_LPTRIMVDDF_Msk (0xfc000000UL)            /*!< LPTRIMVDDF (Bitfield-Mask: 0x3f)                      */
#define MCUCTRL_SIMOBUCK12_ACTTRIMVDDF_Pos (20UL)                   /*!< ACTTRIMVDDF (Bit 20)                                  */
#define MCUCTRL_SIMOBUCK12_ACTTRIMVDDF_Msk (0x3f00000UL)            /*!< ACTTRIMVDDF (Bitfield-Mask: 0x3f)                     */
/* ======================================================  SIMOBUCK13  ======================================================= */
#define MCUCTRL_SIMOBUCK13_LPTRIMVDDS_Pos (26UL)                    /*!< LPTRIMVDDS (Bit 26)                                   */
#define MCUCTRL_SIMOBUCK13_LPTRIMVDDS_Msk (0xfc000000UL)            /*!< LPTRIMVDDS (Bitfield-Mask: 0x3f)                      */
#define MCUCTRL_SIMOBUCK13_ACTTRIMVDDS_Pos (20UL)                   /*!< ACTTRIMVDDS (Bit 20)                                  */
#define MCUCTRL_SIMOBUCK13_ACTTRIMVDDS_Msk (0x3f00000UL)            /*!< ACTTRIMVDDS (Bitfield-Mask: 0x3f)                     */
/* ======================================================  SIMOBUCK15  ======================================================= */
#define MCUCTRL_SIMOBUCK15_TRIMLATCHOVER_Pos (31UL)                 /*!< TRIMLATCHOVER (Bit 31)                                */
#define MCUCTRL_SIMOBUCK15_TRIMLATCHOVER_Msk (0x80000000UL)         /*!< TRIMLATCHOVER (Bitfield-Mask: 0x01)                   */
#define MCUCTRL_SIMOBUCK15_ZXCOMPOFFSETTRIM_Pos (24UL)              /*!< ZXCOMPOFFSETTRIM (Bit 24)                             */
#define MCUCTRL_SIMOBUCK15_ZXCOMPOFFSETTRIM_Msk (0x1f000000UL)      /*!< ZXCOMPOFFSETTRIM (Bitfield-Mask: 0x1f)                */
/* ========================================================  PWRSW0  ========================================================= */
#define MCUCTRL_PWRSW0_PWRSWVDDRCPUOVERRIDE_Pos (31UL)              /*!< PWRSWVDDRCPUOVERRIDE (Bit 31)                         */
#define MCUCTRL_PWRSW0_PWRSWVDDRCPUOVERRIDE_Msk (0x80000000UL)      /*!< PWRSWVDDRCPUOVERRIDE (Bitfield-Mask: 0x01)            */
#define MCUCTRL_PWRSW0_PWRSWVDDRCPUSTATSEL_Pos (30UL)               /*!< PWRSWVDDRCPUSTATSEL (Bit 30)                          */
#define MCUCTRL_PWRSW0_PWRSWVDDRCPUSTATSEL_Msk (0x40000000UL)       /*!< PWRSWVDDRCPUSTATSEL (Bitfield-Mask: 0x01)             */
#define MCUCTRL_PWRSW0_PWRSWVDDRCPUPGN_Pos (29UL)                   /*!< PWRSWVDDRCPUPGN (Bit 29)                              */
#define MCUCTRL_PWRSW0_PWRSWVDDRCPUPGN_Msk (0x20000000UL)           /*!< PWRSWVDDRCPUPGN (Bitfield-Mask: 0x01)                 */
#define MCUCTRL_PWRSW0_PWRSWVDDRCPUDYNSEL_Pos (27UL)                /*!< PWRSWVDDRCPUDYNSEL (Bit 27)                           */
#define MCUCTRL_PWRSW0_PWRSWVDDRCPUDYNSEL_Msk (0x18000000UL)        /*!< PWRSWVDDRCPUDYNSEL (Bitfield-Mask: 0x03)              */
#define MCUCTRL_PWRSW0_PWRSWVDDMLOVERRIDE_Pos (26UL)                /*!< PWRSWVDDMLOVERRIDE (Bit 26)                           */
#define MCUCTRL_PWRSW0_PWRSWVDDMLOVERRIDE_Msk (0x4000000UL)         /*!< PWRSWVDDMLOVERRIDE (Bitfield-Mask: 0x01)              */
#define MCUCTRL_PWRSW0_PWRSWVDDMLSTATSEL_Pos (25UL)                 /*!< PWRSWVDDMLSTATSEL (Bit 25)                            */
#define MCUCTRL_PWRSW0_PWRSWVDDMLSTATSEL_Msk (0x2000000UL)          /*!< PWRSWVDDMLSTATSEL (Bitfield-Mask: 0x01)               */
#define MCUCTRL_PWRSW0_PWRSWVDDMLDYNSEL_Pos (24UL)                  /*!< PWRSWVDDMLDYNSEL (Bit 24)                             */
#define MCUCTRL_PWRSW0_PWRSWVDDMLDYNSEL_Msk (0x1000000UL)           /*!< PWRSWVDDMLDYNSEL (Bitfield-Mask: 0x01)                */
#define MCUCTRL_PWRSW0_PWRSWVDDMDSP1OVERRIDE_Pos (23UL)             /*!< PWRSWVDDMDSP1OVERRIDE (Bit 23)                        */
#define MCUCTRL_PWRSW0_PWRSWVDDMDSP1OVERRIDE_Msk (0x800000UL)       /*!< PWRSWVDDMDSP1OVERRIDE (Bitfield-Mask: 0x01)           */
#define MCUCTRL_PWRSW0_PWRSWVDDMDSP1STATSEL_Pos (22UL)              /*!< PWRSWVDDMDSP1STATSEL (Bit 22)                         */
#define MCUCTRL_PWRSW0_PWRSWVDDMDSP1STATSEL_Msk (0x400000UL)        /*!< PWRSWVDDMDSP1STATSEL (Bitfield-Mask: 0x01)            */
#define MCUCTRL_PWRSW0_PWRSWVDDMDSP1DYNSEL_Pos (21UL)               /*!< PWRSWVDDMDSP1DYNSEL (Bit 21)                          */
#define MCUCTRL_PWRSW0_PWRSWVDDMDSP1DYNSEL_Msk (0x200000UL)         /*!< PWRSWVDDMDSP1DYNSEL (Bitfield-Mask: 0x01)             */
#define MCUCTRL_PWRSW0_PWRSWVDDMDSP0OVERRIDE_Pos (20UL)             /*!< PWRSWVDDMDSP0OVERRIDE (Bit 20)                        */
#define MCUCTRL_PWRSW0_PWRSWVDDMDSP0OVERRIDE_Msk (0x100000UL)       /*!< PWRSWVDDMDSP0OVERRIDE (Bitfield-Mask: 0x01)           */
#define MCUCTRL_PWRSW0_PWRSWVDDMDSP0STATSEL_Pos (19UL)              /*!< PWRSWVDDMDSP0STATSEL (Bit 19)                         */
#define MCUCTRL_PWRSW0_PWRSWVDDMDSP0STATSEL_Msk (0x80000UL)         /*!< PWRSWVDDMDSP0STATSEL (Bitfield-Mask: 0x01)            */
#define MCUCTRL_PWRSW0_PWRSWVDDMDSP0DYNSEL_Pos (18UL)               /*!< PWRSWVDDMDSP0DYNSEL (Bit 18)                          */
#define MCUCTRL_PWRSW0_PWRSWVDDMDSP0DYNSEL_Msk (0x40000UL)          /*!< PWRSWVDDMDSP0DYNSEL (Bitfield-Mask: 0x01)             */
#define MCUCTRL_PWRSW0_PWRSWVDDMCPUOVERRIDE_Pos (17UL)              /*!< PWRSWVDDMCPUOVERRIDE (Bit 17)                         */
#define MCUCTRL_PWRSW0_PWRSWVDDMCPUOVERRIDE_Msk (0x20000UL)         /*!< PWRSWVDDMCPUOVERRIDE (Bitfield-Mask: 0x01)            */
#define MCUCTRL_PWRSW0_PWRSWVDDMCPUSTATSEL_Pos (16UL)               /*!< PWRSWVDDMCPUSTATSEL (Bit 16)                          */
#define MCUCTRL_PWRSW0_PWRSWVDDMCPUSTATSEL_Msk (0x10000UL)          /*!< PWRSWVDDMCPUSTATSEL (Bitfield-Mask: 0x01)             */
#define MCUCTRL_PWRSW0_PWRSWVDDMCPUDYNSEL_Pos (15UL)                /*!< PWRSWVDDMCPUDYNSEL (Bit 15)                           */
#define MCUCTRL_PWRSW0_PWRSWVDDMCPUDYNSEL_Msk (0x8000UL)            /*!< PWRSWVDDMCPUDYNSEL (Bitfield-Mask: 0x01)              */
#define MCUCTRL_PWRSW0_PWRSWVDDDSP1OVERRIDE_Pos (14UL)              /*!< PWRSWVDDDSP1OVERRIDE (Bit 14)                         */
#define MCUCTRL_PWRSW0_PWRSWVDDDSP1OVERRIDE_Msk (0x4000UL)          /*!< PWRSWVDDDSP1OVERRIDE (Bitfield-Mask: 0x01)            */
#define MCUCTRL_PWRSW0_PWRSWVDDDSP1PGN_Pos (13UL)                   /*!< PWRSWVDDDSP1PGN (Bit 13)                              */
#define MCUCTRL_PWRSW0_PWRSWVDDDSP1PGN_Msk (0x2000UL)               /*!< PWRSWVDDDSP1PGN (Bitfield-Mask: 0x01)                 */
#define MCUCTRL_PWRSW0_PWRSWVDDDSP1DYNSEL_Pos (11UL)                /*!< PWRSWVDDDSP1DYNSEL (Bit 11)                           */
#define MCUCTRL_PWRSW0_PWRSWVDDDSP1DYNSEL_Msk (0x1800UL)            /*!< PWRSWVDDDSP1DYNSEL (Bitfield-Mask: 0x03)              */
#define MCUCTRL_PWRSW0_PWRSWVDDDSP0OVERRIDE_Pos (10UL)              /*!< PWRSWVDDDSP0OVERRIDE (Bit 10)                         */
#define MCUCTRL_PWRSW0_PWRSWVDDDSP0OVERRIDE_Msk (0x400UL)           /*!< PWRSWVDDDSP0OVERRIDE (Bitfield-Mask: 0x01)            */
#define MCUCTRL_PWRSW0_PWRSWVDDDSP0PGN_Pos (9UL)                    /*!< PWRSWVDDDSP0PGN (Bit 9)                               */
#define MCUCTRL_PWRSW0_PWRSWVDDDSP0PGN_Msk (0x200UL)                /*!< PWRSWVDDDSP0PGN (Bitfield-Mask: 0x01)                 */
#define MCUCTRL_PWRSW0_PWRSWVDDDSP0DYNSEL_Pos (7UL)                 /*!< PWRSWVDDDSP0DYNSEL (Bit 7)                            */
#define MCUCTRL_PWRSW0_PWRSWVDDDSP0DYNSEL_Msk (0x180UL)             /*!< PWRSWVDDDSP0DYNSEL (Bitfield-Mask: 0x03)              */
#define MCUCTRL_PWRSW0_PWRSWVDDCAOROVERRIDE_Pos (6UL)               /*!< PWRSWVDDCAOROVERRIDE (Bit 6)                          */
#define MCUCTRL_PWRSW0_PWRSWVDDCAOROVERRIDE_Msk (0x40UL)            /*!< PWRSWVDDCAOROVERRIDE (Bitfield-Mask: 0x01)            */
#define MCUCTRL_PWRSW0_PWRSWVDDCAORDYNSEL_Pos (4UL)                 /*!< PWRSWVDDCAORDYNSEL (Bit 4)                            */
#define MCUCTRL_PWRSW0_PWRSWVDDCAORDYNSEL_Msk (0x30UL)              /*!< PWRSWVDDCAORDYNSEL (Bitfield-Mask: 0x03)              */
#define MCUCTRL_PWRSW0_PWRSWVDDCPUOVERRIDE_Pos (3UL)                /*!< PWRSWVDDCPUOVERRIDE (Bit 3)                           */
#define MCUCTRL_PWRSW0_PWRSWVDDCPUOVERRIDE_Msk (0x8UL)              /*!< PWRSWVDDCPUOVERRIDE (Bitfield-Mask: 0x01)             */
#define MCUCTRL_PWRSW0_PWRSWVDDCPUPGN_Pos (2UL)                     /*!< PWRSWVDDCPUPGN (Bit 2)                                */
#define MCUCTRL_PWRSW0_PWRSWVDDCPUPGN_Msk (0x4UL)                   /*!< PWRSWVDDCPUPGN (Bitfield-Mask: 0x01)                  */
#define MCUCTRL_PWRSW0_PWRSWVDDCPUDYNSEL_Pos (0UL)                  /*!< PWRSWVDDCPUDYNSEL (Bit 0)                             */
#define MCUCTRL_PWRSW0_PWRSWVDDCPUDYNSEL_Msk (0x3UL)                /*!< PWRSWVDDCPUDYNSEL (Bitfield-Mask: 0x03)               */
/* ========================================================  PWRSW1  ========================================================= */
#define MCUCTRL_PWRSW1_SHORTVDDFVDDSORVAL_Pos (31UL)                /*!< SHORTVDDFVDDSORVAL (Bit 31)                           */
#define MCUCTRL_PWRSW1_SHORTVDDFVDDSORVAL_Msk (0x80000000UL)        /*!< SHORTVDDFVDDSORVAL (Bitfield-Mask: 0x01)              */
#define MCUCTRL_PWRSW1_SHORTVDDFVDDSOREN_Pos (30UL)                 /*!< SHORTVDDFVDDSOREN (Bit 30)                            */
#define MCUCTRL_PWRSW1_SHORTVDDFVDDSOREN_Msk (0x40000000UL)         /*!< SHORTVDDFVDDSOREN (Bitfield-Mask: 0x01)               */
#define MCUCTRL_PWRSW1_SHORTVDDCVDDCLVORVAL_Pos (29UL)              /*!< SHORTVDDCVDDCLVORVAL (Bit 29)                         */
#define MCUCTRL_PWRSW1_SHORTVDDCVDDCLVORVAL_Msk (0x20000000UL)      /*!< SHORTVDDCVDDCLVORVAL (Bitfield-Mask: 0x01)            */
#define MCUCTRL_PWRSW1_SHORTVDDCVDDCLVOREN_Pos (28UL)               /*!< SHORTVDDCVDDCLVOREN (Bit 28)                          */
#define MCUCTRL_PWRSW1_SHORTVDDCVDDCLVOREN_Msk (0x10000000UL)       /*!< SHORTVDDCVDDCLVOREN (Bitfield-Mask: 0x01)             */
#define MCUCTRL_PWRSW1_FORCEVDDRMOFF_Pos  (27UL)                    /*!< FORCEVDDRMOFF (Bit 27)                                */
#define MCUCTRL_PWRSW1_FORCEVDDRMOFF_Msk  (0x8000000UL)             /*!< FORCEVDDRMOFF (Bitfield-Mask: 0x01)                   */
#define MCUCTRL_PWRSW1_FORCEVDDRMVDDS_Pos (26UL)                    /*!< FORCEVDDRMVDDS (Bit 26)                               */
#define MCUCTRL_PWRSW1_FORCEVDDRMVDDS_Msk (0x4000000UL)             /*!< FORCEVDDRMVDDS (Bitfield-Mask: 0x01)                  */
#define MCUCTRL_PWRSW1_USEVDDF4VDDRCPUINHP_Pos (25UL)               /*!< USEVDDF4VDDRCPUINHP (Bit 25)                          */
#define MCUCTRL_PWRSW1_USEVDDF4VDDRCPUINHP_Msk (0x2000000UL)        /*!< USEVDDF4VDDRCPUINHP (Bitfield-Mask: 0x01)             */
#define MCUCTRL_PWRSW1_DIGPWRSWOVRDRVSEL_Pos (23UL)                 /*!< DIGPWRSWOVRDRVSEL (Bit 23)                            */
#define MCUCTRL_PWRSW1_DIGPWRSWOVRDRVSEL_Msk (0x1800000UL)          /*!< DIGPWRSWOVRDRVSEL (Bitfield-Mask: 0x03)               */
#define MCUCTRL_PWRSW1_DIGPWRSWOVRDRVEN_Pos (22UL)                  /*!< DIGPWRSWOVRDRVEN (Bit 22)                             */
#define MCUCTRL_PWRSW1_DIGPWRSWOVRDRVEN_Msk (0x400000UL)            /*!< DIGPWRSWOVRDRVEN (Bitfield-Mask: 0x01)                */
#define MCUCTRL_PWRSW1_PWRSWOVRDRVEN_Pos  (21UL)                    /*!< PWRSWOVRDRVEN (Bit 21)                                */
#define MCUCTRL_PWRSW1_PWRSWOVRDRVEN_Msk  (0x200000UL)              /*!< PWRSWOVRDRVEN (Bitfield-Mask: 0x01)                   */
#define MCUCTRL_PWRSW1_PWRSWCOMPPDNB_Pos  (20UL)                    /*!< PWRSWCOMPPDNB (Bit 20)                                */
#define MCUCTRL_PWRSW1_PWRSWCOMPPDNB_Msk  (0x100000UL)              /*!< PWRSWCOMPPDNB (Bitfield-Mask: 0x01)                   */
#define MCUCTRL_PWRSW1_PWRSWVDDLOVERRIDE_Pos (19UL)                 /*!< PWRSWVDDLOVERRIDE (Bit 19)                            */
#define MCUCTRL_PWRSW1_PWRSWVDDLOVERRIDE_Msk (0x80000UL)            /*!< PWRSWVDDLOVERRIDE (Bitfield-Mask: 0x01)               */
#define MCUCTRL_PWRSW1_PWRSWVDDLPGN_Pos   (18UL)                    /*!< PWRSWVDDLPGN (Bit 18)                                 */
#define MCUCTRL_PWRSW1_PWRSWVDDLPGN_Msk   (0x40000UL)               /*!< PWRSWVDDLPGN (Bitfield-Mask: 0x01)                    */
#define MCUCTRL_PWRSW1_PWRSWVDDRMOVERRIDE_Pos (17UL)                /*!< PWRSWVDDRMOVERRIDE (Bit 17)                           */
#define MCUCTRL_PWRSW1_PWRSWVDDRMOVERRIDE_Msk (0x20000UL)           /*!< PWRSWVDDRMOVERRIDE (Bitfield-Mask: 0x01)              */
#define MCUCTRL_PWRSW1_PWRSWVDDRMSTATSEL_Pos (16UL)                 /*!< PWRSWVDDRMSTATSEL (Bit 16)                            */
#define MCUCTRL_PWRSW1_PWRSWVDDRMSTATSEL_Msk (0x10000UL)            /*!< PWRSWVDDRMSTATSEL (Bitfield-Mask: 0x01)               */
#define MCUCTRL_PWRSW1_PWRSWVDDRMPGN_Pos  (15UL)                    /*!< PWRSWVDDRMPGN (Bit 15)                                */
#define MCUCTRL_PWRSW1_PWRSWVDDRMPGN_Msk  (0x8000UL)                /*!< PWRSWVDDRMPGN (Bitfield-Mask: 0x01)                   */
#define MCUCTRL_PWRSW1_PWRSWVDDRMDYNSEL_Pos (14UL)                  /*!< PWRSWVDDRMDYNSEL (Bit 14)                             */
#define MCUCTRL_PWRSW1_PWRSWVDDRMDYNSEL_Msk (0x4000UL)              /*!< PWRSWVDDRMDYNSEL (Bitfield-Mask: 0x01)                */
#define MCUCTRL_PWRSW1_PWRSWVDDRLOVERRIDE_Pos (13UL)                /*!< PWRSWVDDRLOVERRIDE (Bit 13)                           */
#define MCUCTRL_PWRSW1_PWRSWVDDRLOVERRIDE_Msk (0x2000UL)            /*!< PWRSWVDDRLOVERRIDE (Bitfield-Mask: 0x01)              */
#define MCUCTRL_PWRSW1_PWRSWVDDRLSTATSEL_Pos (12UL)                 /*!< PWRSWVDDRLSTATSEL (Bit 12)                            */
#define MCUCTRL_PWRSW1_PWRSWVDDRLSTATSEL_Msk (0x1000UL)             /*!< PWRSWVDDRLSTATSEL (Bitfield-Mask: 0x01)               */
#define MCUCTRL_PWRSW1_PWRSWVDDRLPGN_Pos  (11UL)                    /*!< PWRSWVDDRLPGN (Bit 11)                                */
#define MCUCTRL_PWRSW1_PWRSWVDDRLPGN_Msk  (0x800UL)                 /*!< PWRSWVDDRLPGN (Bitfield-Mask: 0x01)                   */
#define MCUCTRL_PWRSW1_PWRSWVDDRLDYNSEL_Pos (10UL)                  /*!< PWRSWVDDRLDYNSEL (Bit 10)                             */
#define MCUCTRL_PWRSW1_PWRSWVDDRLDYNSEL_Msk (0x400UL)               /*!< PWRSWVDDRLDYNSEL (Bitfield-Mask: 0x01)                */
#define MCUCTRL_PWRSW1_PWRSWVDDRDSP1OVERRIDE_Pos (9UL)              /*!< PWRSWVDDRDSP1OVERRIDE (Bit 9)                         */
#define MCUCTRL_PWRSW1_PWRSWVDDRDSP1OVERRIDE_Msk (0x200UL)          /*!< PWRSWVDDRDSP1OVERRIDE (Bitfield-Mask: 0x01)           */
#define MCUCTRL_PWRSW1_PWRSWVDDRDSP1STATSEL_Pos (8UL)               /*!< PWRSWVDDRDSP1STATSEL (Bit 8)                          */
#define MCUCTRL_PWRSW1_PWRSWVDDRDSP1STATSEL_Msk (0x100UL)           /*!< PWRSWVDDRDSP1STATSEL (Bitfield-Mask: 0x01)            */
#define MCUCTRL_PWRSW1_PWRSWVDDRDSP1PGN_Pos (7UL)                   /*!< PWRSWVDDRDSP1PGN (Bit 7)                              */
#define MCUCTRL_PWRSW1_PWRSWVDDRDSP1PGN_Msk (0x80UL)                /*!< PWRSWVDDRDSP1PGN (Bitfield-Mask: 0x01)                */
#define MCUCTRL_PWRSW1_PWRSWVDDRDSP1DYNSEL_Pos (5UL)                /*!< PWRSWVDDRDSP1DYNSEL (Bit 5)                           */
#define MCUCTRL_PWRSW1_PWRSWVDDRDSP1DYNSEL_Msk (0x60UL)             /*!< PWRSWVDDRDSP1DYNSEL (Bitfield-Mask: 0x03)             */
#define MCUCTRL_PWRSW1_PWRSWVDDRDSP0OVERRIDE_Pos (4UL)              /*!< PWRSWVDDRDSP0OVERRIDE (Bit 4)                         */
#define MCUCTRL_PWRSW1_PWRSWVDDRDSP0OVERRIDE_Msk (0x10UL)           /*!< PWRSWVDDRDSP0OVERRIDE (Bitfield-Mask: 0x01)           */
#define MCUCTRL_PWRSW1_PWRSWVDDRDSP0STATSEL_Pos (3UL)               /*!< PWRSWVDDRDSP0STATSEL (Bit 3)                          */
#define MCUCTRL_PWRSW1_PWRSWVDDRDSP0STATSEL_Msk (0x8UL)             /*!< PWRSWVDDRDSP0STATSEL (Bitfield-Mask: 0x01)            */
#define MCUCTRL_PWRSW1_PWRSWVDDRDSP0PGN_Pos (2UL)                   /*!< PWRSWVDDRDSP0PGN (Bit 2)                              */
#define MCUCTRL_PWRSW1_PWRSWVDDRDSP0PGN_Msk (0x4UL)                 /*!< PWRSWVDDRDSP0PGN (Bitfield-Mask: 0x01)                */
#define MCUCTRL_PWRSW1_PWRSWVDDRDSP0DYNSEL_Pos (0UL)                /*!< PWRSWVDDRDSP0DYNSEL (Bit 0)                           */
#define MCUCTRL_PWRSW1_PWRSWVDDRDSP0DYNSEL_Msk (0x3UL)              /*!< PWRSWVDDRDSP0DYNSEL (Bitfield-Mask: 0x03)             */
/* ======================================================  USBRSTCTRL  ======================================================= */
