AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4l_generic.h
/* =======================================  CLKGEN MISC PWRONCLKENI2S1REFCLK [16..16]  ======================================= */
typedef enum {                                  /*!< CLKGEN_MISC_PWRONCLKENI2S1REFCLK                                          */
  CLKGEN_MISC_PWRONCLKENI2S1REFCLK_I2S1REFCLKENRST = 0,/*!< I2S1REFCLKENRST : Enable I2S instance 1 Clock to run during
                                                     reset                                                                     */
  CLKGEN_MISC_PWRONCLKENI2S1REFCLK_DEFEATURE = 1,/*!< DEFEATURE : Chicken bit to revert to rev A                               */
} CLKGEN_MISC_PWRONCLKENI2S1REFCLK_Enum;

/* =======================================  CLKGEN MISC PWRONCLKENI2S0REFCLK [15..15]  ======================================= */
typedef enum {                                  /*!< CLKGEN_MISC_PWRONCLKENI2S0REFCLK                                          */
  CLKGEN_MISC_PWRONCLKENI2S0REFCLK_I2S0REFCLKENRST = 0,/*!< I2S0REFCLKENRST : Enable I2S instance 0 Clock to run during
                                                     reset                                                                     */
  CLKGEN_MISC_PWRONCLKENI2S0REFCLK_DEFEATURE = 1,/*!< DEFEATURE : Chicken bit to revert to rev A                               */
} CLKGEN_MISC_PWRONCLKENI2S0REFCLK_Enum;

/* ========================================  CLKGEN MISC AXIXACLKENOVRRIDE [14..14]  ========================================= */
typedef enum {                                  /*!< CLKGEN_MISC_AXIXACLKENOVRRIDE                                             */
  CLKGEN_MISC_AXIXACLKENOVRRIDE_DEFEATURE_DISABLED = 0,/*!< DEFEATURE_DISABLED : Fine grain clock gating enabled               */
  CLKGEN_MISC_AXIXACLKENOVRRIDE_DEFEATURE = 1,  /*!< DEFEATURE : AXI Clock enabled when core is not in Sleep mode              */
} CLKGEN_MISC_AXIXACLKENOVRRIDE_Enum;

/* ==========================================  CLKGEN MISC PWRONCLKENI2S1 [13..13]  ========================================== */
typedef enum {                                  /*!< CLKGEN_MISC_PWRONCLKENI2S1                                                */
  CLKGEN_MISC_PWRONCLKENI2S1_I2S1CLKENRST = 0,  /*!< I2S1CLKENRST : Enable I2S instance 1 engine Clock to run during
                                                     reset                                                                     */
  CLKGEN_MISC_PWRONCLKENI2S1_DEFEATURE = 1,     /*!< DEFEATURE : Chicken bit to revert to rev A                                */
} CLKGEN_MISC_PWRONCLKENI2S1_Enum;

/* ==========================================  CLKGEN MISC PWRONCLKENI2S0 [12..12]  ========================================== */
typedef enum {                                  /*!< CLKGEN_MISC_PWRONCLKENI2S0                                                */
  CLKGEN_MISC_PWRONCLKENI2S0_I2S0CLKENRST = 0,  /*!< I2S0CLKENRST : Enable I2S instance 0 engine Clock to run during
                                                     reset                                                                     */
  CLKGEN_MISC_PWRONCLKENI2S0_DEFEATURE = 1,     /*!< DEFEATURE : Chicken bit to revert to rev A                                */
} CLKGEN_MISC_PWRONCLKENI2S0_Enum;

/* =========================================  CLKGEN MISC PWRONCLKENCRYPTO [11..11]  ========================================= */
typedef enum {                                  /*!< CLKGEN_MISC_PWRONCLKENCRYPTO                                              */
  CLKGEN_MISC_PWRONCLKENCRYPTO_CRYPTOCLKENRST = 0,/*!< CRYPTOCLKENRST : Enable Cryto engine Clock to run during reset          */
  CLKGEN_MISC_PWRONCLKENCRYPTO_DEFEATURE = 1,   /*!< DEFEATURE : Chicken bit to revert to rev A                                */
} CLKGEN_MISC_PWRONCLKENCRYPTO_Enum;

/* ==========================================  CLKGEN MISC PWRONCLKENSDIO [10..10]  ========================================== */
typedef enum {                                  /*!< CLKGEN_MISC_PWRONCLKENSDIO                                                */
  CLKGEN_MISC_PWRONCLKENSDIO_SDIOCLKENRST = 0,  /*!< SDIOCLKENRST : Enable SDIO Clock to run during reset                      */
  CLKGEN_MISC_PWRONCLKENSDIO_DEFEATURE = 1,     /*!< DEFEATURE : Chicken bit to revert to rev A                                */
} CLKGEN_MISC_PWRONCLKENSDIO_Enum;

/* ===========================================  CLKGEN MISC PWRONCLKENGFX [8..8]  ============================================ */
typedef enum {                                  /*!< CLKGEN_MISC_PWRONCLKENGFX                                                 */
  CLKGEN_MISC_PWRONCLKENGFX_GFXCLKENRST = 0,    /*!< GFXCLKENRST : Enable GFX Clock to run during reset                        */
  CLKGEN_MISC_PWRONCLKENGFX_DEFEATURE  = 1,     /*!< DEFEATURE : Chicken bit to revert to rev A                                */
} CLKGEN_MISC_PWRONCLKENGFX_Enum;

/* ==============================================  CLKGEN MISC FRCHFRC2 [5..5]  ============================================== */
typedef enum {                                  /*!< CLKGEN_MISC_FRCHFRC2                                                      */
  CLKGEN_MISC_FRCHFRC2_NOFRC           = 0,     /*!< NOFRC : Do not force HFRC2 on; stops in deep sleep mode.                  */
  CLKGEN_MISC_FRCHFRC2_FRC             = 1,     /*!< FRC : Force HFRC2 on; runs in deep sleep mode.                            */
} CLKGEN_MISC_FRCHFRC2_Enum;

/* ==========================================  CLKGEN MISC USEHFRC2FQ192MHZ [4..4]  ========================================== */
typedef enum {                                  /*!< CLKGEN_MISC_USEHFRC2FQ192MHZ                                              */
  CLKGEN_MISC_USEHFRC2FQ192MHZ_HFRCFQ192MHz = 0,/*!< HFRCFQ192MHz : Use HFRC-192MHz                                            */
  CLKGEN_MISC_USEHFRC2FQ192MHZ_HFRC2FQ192MHz = 1,/*!< HFRC2FQ192MHz : Use HFRC2-192MHz                                         */
} CLKGEN_MISC_USEHFRC2FQ192MHZ_Enum;

/* ==========================================  CLKGEN MISC USEHFRC2FQ96MHZ [3..3]  =========================================== */
typedef enum {                                  /*!< CLKGEN_MISC_USEHFRC2FQ96MHZ                                               */
  CLKGEN_MISC_USEHFRC2FQ96MHZ_HFRCFQ96MHz = 0,  /*!< HFRCFQ96MHz : Use HFRC-96MHz                                              */
  CLKGEN_MISC_USEHFRC2FQ96MHZ_HFRC2FQ96MHz = 1, /*!< HFRC2FQ96MHz : Use HFRC2-96MHz                                            */
} CLKGEN_MISC_USEHFRC2FQ96MHZ_Enum;

/* ==========================================  CLKGEN MISC USEHFRC2FQ48MHZ [2..2]  =========================================== */
typedef enum {                                  /*!< CLKGEN_MISC_USEHFRC2FQ48MHZ                                               */
  CLKGEN_MISC_USEHFRC2FQ48MHZ_HFRCFQ48MHz = 0,  /*!< HFRCFQ48MHz : Use HFRC-48MHz                                              */
  CLKGEN_MISC_USEHFRC2FQ48MHZ_HFRC2FQ48MHz = 1, /*!< HFRC2FQ48MHz : Use HFRC2-48MHz                                            */
} CLKGEN_MISC_USEHFRC2FQ48MHZ_Enum;

/* ============================================  CLKGEN MISC FRCBURSTOFF [1..1]  ============================================= */
typedef enum {                                  /*!< CLKGEN_MISC_FRCBURSTOFF                                                   */
  CLKGEN_MISC_FRCBURSTOFF_BURSTCLKON   = 0,     /*!< BURSTCLKON : fclk, hclk and fclk_wic are turned on during the
                                                     burst transition                                                          */
  CLKGEN_MISC_FRCBURSTOFF_BURSTCLKOFF  = 1,     /*!< BURSTCLKOFF : fclk, hclk and fclk are turned off during burst
                                                     transition                                                                */
} CLKGEN_MISC_FRCBURSTOFF_Enum;

