AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4l_generic.h
/* ==============================================  SDIO TRANSFER BLKSEL [5..5]  ============================================== */
typedef enum {                                  /*!< SDIO_TRANSFER_BLKSEL                                                      */
  SDIO_TRANSFER_BLKSEL_SINGLEBLOCK     = 0,     /*!< SINGLEBLOCK : Single Block                                                */
  SDIO_TRANSFER_BLKSEL_MULTIPLEBLOCK   = 1,     /*!< MULTIPLEBLOCK : Multiple Block                                            */
} SDIO_TRANSFER_BLKSEL_Enum;

/* ===========================================  SDIO TRANSFER DXFERDIRSEL [4..4]  ============================================ */
typedef enum {                                  /*!< SDIO_TRANSFER_DXFERDIRSEL                                                 */
  SDIO_TRANSFER_DXFERDIRSEL_WRITE      = 0,     /*!< WRITE : Write (Host to Card)                                              */
  SDIO_TRANSFER_DXFERDIRSEL_READ       = 1,     /*!< READ : Read (Card to Host)                                                */
} SDIO_TRANSFER_DXFERDIRSEL_Enum;

/* ==============================================  SDIO TRANSFER ACMDEN [2..3]  ============================================== */
typedef enum {                                  /*!< SDIO_TRANSFER_ACMDEN                                                      */
  SDIO_TRANSFER_ACMDEN_DISABLED        = 0,     /*!< DISABLED : Auto Command Disabled                                          */
  SDIO_TRANSFER_ACMDEN_CMD12ENABLE     = 1,     /*!< CMD12ENABLE : Auto CMD12 Enable                                           */
  SDIO_TRANSFER_ACMDEN_CMD23ENABLE     = 2,     /*!< CMD23ENABLE : Auto CMD23 Enable                                           */
} SDIO_TRANSFER_ACMDEN_Enum;

/* =============================================  SDIO TRANSFER BLKCNTEN [1..1]  ============================================= */
typedef enum {                                  /*!< SDIO_TRANSFER_BLKCNTEN                                                    */
  SDIO_TRANSFER_BLKCNTEN_DISABLE       = 0,     /*!< DISABLE : Disable                                                         */
  SDIO_TRANSFER_BLKCNTEN_ENABLE        = 1,     /*!< ENABLE : Enable                                                           */
} SDIO_TRANSFER_BLKCNTEN_Enum;

/* ==============================================  SDIO TRANSFER DMAEN [0..0]  =============================================== */
typedef enum {                                  /*!< SDIO_TRANSFER_DMAEN                                                       */
  SDIO_TRANSFER_DMAEN_DISABLE          = 0,     /*!< DISABLE : Disable                                                         */
  SDIO_TRANSFER_DMAEN_ENABLE           = 1,     /*!< ENABLE : Enable                                                           */
} SDIO_TRANSFER_DMAEN_Enum;

/* =======================================================  RESPONSE0  ======================================================= */
/* =======================================================  RESPONSE1  ======================================================= */
/* =======================================================  RESPONSE2  ======================================================= */
/* =======================================================  RESPONSE3  ======================================================= */
/* ========================================================  BUFFER  ========================================================= */
/* ========================================================  PRESENT  ======================================================== */
/* ============================================  SDIO PRESENT DAT74LINE [25..28]  ============================================ */
typedef enum {                                  /*!< SDIO_PRESENT_DAT74LINE                                                    */
  SDIO_PRESENT_DAT74LINE_DAT7          = 8,     /*!< DAT7 : DAT[7]                                                             */
  SDIO_PRESENT_DAT74LINE_DAT6          = 4,     /*!< DAT6 : DAT[6]                                                             */
  SDIO_PRESENT_DAT74LINE_DAT5          = 2,     /*!< DAT5 : DAT[5]                                                             */
  SDIO_PRESENT_DAT74LINE_DAT4          = 1,     /*!< DAT4 : DAT[4]                                                             */
} SDIO_PRESENT_DAT74LINE_Enum;

/* ============================================  SDIO PRESENT DAT30LINE [20..23]  ============================================ */
typedef enum {                                  /*!< SDIO_PRESENT_DAT30LINE                                                    */
  SDIO_PRESENT_DAT30LINE_DAT3          = 8,     /*!< DAT3 : DAT[3]                                                             */
  SDIO_PRESENT_DAT30LINE_DAT2          = 4,     /*!< DAT2 : DAT[2]                                                             */
  SDIO_PRESENT_DAT30LINE_DAT1          = 2,     /*!< DAT1 : DAT[1]                                                             */
  SDIO_PRESENT_DAT30LINE_DAT0          = 1,     /*!< DAT0 : DAT[0]                                                             */
} SDIO_PRESENT_DAT30LINE_Enum;

/* ============================================  SDIO PRESENT WRPROTSW [19..19]  ============================================= */
typedef enum {                                  /*!< SDIO_PRESENT_WRPROTSW                                                     */
  SDIO_PRESENT_WRPROTSW_WRITEPROTECTED = 0,     /*!< WRITEPROTECTED : Write protected (SDWP# = 0)                              */
  SDIO_PRESENT_WRPROTSW_WRITEENABLED   = 1,     /*!< WRITEENABLED : Write enabled (SDWP# = 1)                                  */
} SDIO_PRESENT_WRPROTSW_Enum;

/* =============================================  SDIO PRESENT CARDDET [18..18]  ============================================= */
typedef enum {                                  /*!< SDIO_PRESENT_CARDDET                                                      */
  SDIO_PRESENT_CARDDET_NOCARDPRESENT   = 0,     /*!< NOCARDPRESENT : No Card present (SDCD# = 1)                               */
  SDIO_PRESENT_CARDDET_CARDPRESENT     = 1,     /*!< CARDPRESENT : Card present (SDCD# = 0)                                    */
} SDIO_PRESENT_CARDDET_Enum;

/* ===========================================  SDIO PRESENT CARDSTABLE [17..17]  ============================================ */
typedef enum {                                  /*!< SDIO_PRESENT_CARDSTABLE                                                   */
  SDIO_PRESENT_CARDSTABLE_RESET_DEBOUNCING_NOCARD = 0,/*!< RESET_DEBOUNCING_NOCARD : Reset or Debouncing or No Card            */
  SDIO_PRESENT_CARDSTABLE_CARDINSERTED = 1,     /*!< CARDINSERTED : Card Inserted                                              */
} SDIO_PRESENT_CARDSTABLE_Enum;

